{"zone": "_Unknown7", "rooms": {"0": {"index": "0", "name": "The crater.", "desc": ["\"   Here is where the meteor recently slammed into the ground, shrouding", "Midguard in ash and hitting the ground with such force as to cause an", "earthquake.  The results of this earthquake have made themselves known only", "in the very base of the crater, as for some reason the earth has not split", "above ground, though you see a large crack running along the base of the", "crater.", "The crater is very close to the entrance of moria, and the entire area", "is heavily covered in a thick layer of dirt and ash thrown up from the", "crater, making movement very difficult.  The crater is still putting out", "a good amount of heat, and though you can touch the ground without getting", "burnt, it is certainly not comfortable."], "extra": [{"keywords": "_ex10"}, {"desc": ["\"   You loose your footing in the lose gravel thrown up from the earthquake", "and fall......"]}, {"keywords": "_weather"}, {"desc": ["\"   The sun is still partially covered by a cloud of thick ash, a good thing", "for you, as the added heat of the sun would make this place unbearable."]}], "flags": "no_mob", "zone": "_Unknown7", "room_key": "_Unknown7:0", "exits": [{"direction": "southwest", "room": "MoriaLevel1:2"}, {"direction": "10", "room": "_Unknown7:1", "desc": ["\"   You look down into the crack in the base of the crater....and notice", "something....someone seems to have been here before, and has left a rope", "dangling from the edge of the crack, perhaps a much safer route to the", "bottom of the crack."], "info": "message", "keywords": "crack"}, {"direction": "11", "room": "_Unknown7:8", "info": "hidden", "keywords": "rope"}]}, "1": {"index": "1", "name": "Falling.....", "desc": "\"", "extra": {"keywords": "_teleport", "desc": ["\"   Your ability to fly comes in handy, and you waft to the ground, laughing", "at the gravity which would flatten lesser mortals."]}, "flags": "indoors, noshowexit, fall", "tele": "10, 0, 5", "zone": "_Unknown7", "room_key": "_Unknown7:1", "exits": [{"direction": "d", "room": "_Unknown7:2"}]}, "2": {"index": "2", "name": "Falling.....", "desc": "\"", "flags": "indoors, noshowexit, fall", "zone": "_Unknown7", "room_key": "_Unknown7:2", "exits": [{"direction": "d", "room": "_Unknown7:3"}]}, "3": {"index": "3", "name": "Falling.....", "desc": "\"", "flags": "indoors, noshowexit, fall", "zone": "_Unknown7", "room_key": "_Unknown7:3", "exits": [{"direction": "d", "room": "_Unknown7:4"}]}, "4": {"index": "4", "name": "Falling.....", "desc": "\"", "flags": "indoors, noshowexit, fall", "zone": "_Unknown7", "room_key": "_Unknown7:4", "exits": [{"direction": "d", "room": "_Unknown7:5"}]}, "5": {"index": "5", "name": "Center of the huge cave.", "desc": ["\"   You stand in the center of a very large, obviously crafted cave, it looks", "as if the meteor has opened up an entrance into some old cave system, and", "judging from the layers of dust on the cavern floor, this cave has not", "been used in quite a while.  The air in this cave is stale and dry, though", "the heat radiating from the meteor has warmed it up considerably, and thrown", "quite a bit of dust up into the air, reducing visibility quite a bit.", "The walls of the cave, about one hundred yards in each direction, give", "off a slight glow from some phosphorescent moss or lichen growing on them.", "The cave is symetrical and dome shaped, and you can just make out some", "sort of opening to the north."], "extra": {"keywords": "dust ground floor", "desc": ["\"   Looking at the ground, you see that the dust has allowed for very clear", "footprints, and it looks as if twenty to thirty roughly man sized creatures", "have been walking though here recently."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:5", "exits": [{"direction": "n", "room": "_Unknown7:10"}, {"direction": "e", "room": "_Unknown7:11"}, {"direction": "s", "room": "_Unknown7:12"}, {"direction": "w", "room": "_Unknown7:13"}, {"direction": "10", "room": "_Unknown7:6", "keywords": "rope"}]}, "6": {"index": "6", "name": "Near the bottom of the rope.", "desc": ["\"   Down near the bottom of the rope, you can just make out the bottom of", "the huge cave in the dim light.  The rope seems unsturdy at best, and frayed", "at the worst, but at least at this height you won't break anything if you", "should fall.  There is some sort of lightly glowing phosphorescent moss", "growing in the cave, allowing you to see the edges of the cave, almost a full", "hundred yards in each direction."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:6", "exits": [{"direction": "u", "room": "_Unknown7:7"}, {"direction": "d", "room": "_Unknown7:5"}]}, "7": {"index": "7", "name": "Midway up the rope.", "desc": ["\"   You are dangling approximately thirty feet off the base of the cave on", "a frayed and dangerous looking rope.  From this vantage you can just make", "out the slightly glowing edges of the huge cave, perhaps one hundred yards", "in each direction.  The cave looks amazingly semetrical, a semicircular", "dome with phosphorescent glowing walls."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:7", "exits": [{"direction": "u", "room": "_Unknown7:8"}, {"direction": "d", "room": "_Unknown7:6"}]}, "8": {"index": "8", "name": "At the top of the rope.", "desc": ["\"   You are clinging to he top of a rope, dangling approximately fifty to", "sixty feet down to the base of a large cave.  The rope is badly frayed, and", "made badly to start with, but it should hold as long as you hurry along,", "better not to stay too long.  Dangling over the lip of the crack in the", "roof, it is difficult to see from above, but is the only point of reference", "in this huge cave."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:8", "exits": [{"direction": "u", "room": "_Unknown7:0"}, {"direction": "d", "room": "_Unknown7:7"}]}, "10": {"index": "10", "name": "Northern end of the huge cave.", "desc": ["\"   Though old and covered in dust, you can clearly see the original beauty", "of this construction now.  Huge pillars support a semicircular tunnel to", "the north, opening out in a grand curving arch, the construction", "obviously not simply functional, but decorative as well."], "extra": {"keywords": "pillars pillar", "desc": ["\"   The pillars are large and seemingly decorative, folding into the gaping", "arch to the north, a wonderous construction from a civilization probably", "long gone.  The pillars are decorated with highly symbolic runes,", "impressive but untranslatable."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:10", "exits": [{"direction": "n", "room": "_Unknown7:14"}, {"direction": "s", "room": "_Unknown7:5"}, {"direction": "southeast", "room": "_Unknown7:11"}, {"direction": "southwest", "room": "_Unknown7:13"}]}, "11": {"index": "11", "name": "Eastern end of the huge cave.", "desc": ["\"   The eastern end of this cave now supports a rather large bat population,", "and the corresponding amount of guano.  Your boots quickly become coated", "in the vicious sticky material, and the bats seem to make it their goal in", "life to hit your head with each addition to the guano reserves."], "extra": {"keywords": "guano", "desc": "It's just guano, that's it, no trick to it."}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:11", "exits": [{"direction": "w", "room": "_Unknown7:5"}, {"direction": "southwest", "room": "_Unknown7:12"}, {"direction": "northwest", "room": "_Unknown7:10"}]}, "12": {"index": "12", "name": "Southern end of the huge cave.", "desc": ["\"   The wall here is glowing from what you can see is a phosphorescent lichen,", "allowing enough light for you too see, even though the dust thrown up from", "the recent meteor strike would quickly smother any flame.  There are", "several holes dug into the walls, approximately a foot in diameter, and", "amazingly circular, obviously crafted as opposed to a natural occurance."], "extra": [{"keywords": "circular holes hole"}, {"desc": ["\"   The holes have some sort of wood splinters in them, perhaps they were", "struts or the base of a ladder originally...whatever they were, they have", "long ceased to serve any useful purpose."]}, {"keywords": "lichen light"}, {"desc": ["\"   The lichen glows a light green, and tints everything in the cave that", "same color, giving an eerie feel to it."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:12", "exits": [{"direction": "n", "room": "_Unknown7:5"}, {"direction": "northeast", "room": "_Unknown7:11"}, {"direction": "northwest", "room": "_Unknown7:13"}]}, "13": {"index": "13", "name": "Western end of the huge cave.", "desc": ["\"   The meteor seems to have had the most disasterous effects on the wester", "end of the cave, and the dome is obviously in bad shape here, with long", "cracks running all the way up to the top of the cave."], "extra": {"keywords": "wall cracks crack dome", "desc": ["\"   You can see that lichen has already begun to creep into the cracks, and", "it illuminates veins of gold, silver, and even gems, no wonder that some", "ancient culture dug out this cave, it is a virtual treasure trove of", "valuable materials."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:13", "exits": [{"direction": "e", "room": "_Unknown7:5"}, {"direction": "northeast", "room": "_Unknown7:10"}, {"direction": "southeast", "room": "_Unknown7:12"}]}, "14": {"index": "14", "name": "Ancient tunnel.", "desc": ["\"   Pillars line this long north south tunnel, not merely supporting it, but", "giving evidence of some ancient underground culture which cared not only", "for mineral wealth, but for the beauty of fine craftsmanship as well.  The", "glowing lichen grows along the length of the tunnel as well, lending enough", "light to see by, and even the dust thrown up by the crater has settled down", "here, allowing you to see the tunnel's construction in all it's glory."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:14", "exits": [{"direction": "s", "room": "_Unknown7:10"}, {"direction": "northeast", "room": "_Unknown7:15"}]}, "15": {"index": "15", "name": "Curving tunnel.", "desc": ["\"   The tunnel curves here, though it looks more like a purposful curving", "than a random occurance, perhaps it was a defensive measure to prevent", "armies from moving easily through the tunnels.  The tunnel also narrows", "considerably, adding some validity to this theory, though the walls are", "still decorated with runes and such, showing that the race which built", "this had no use for spartan building techniques."], "extra": {"keywords": "rune runes", "desc": ["\"   The runes are highly symbolic, but you think you can make out some", "of the depictions of clerical symbols, and the odd royal symbol here", "and there."]}, "flags": "indoors", "max_people": "3", "zone": "_Unknown7", "room_key": "_Unknown7:15", "exits": [{"direction": "southwest", "room": "_Unknown7:14"}, {"direction": "northwest", "room": "_Unknown7:16"}]}, "16": {"index": "16", "name": "Row of Pillars.", "desc": ["\"   An interesting effect is achieved here, the walls seem to fade away,", "leaving a simple row of pillars leading into the cave to the north.  The", "ones who constructed this cave must have been geniuses for working in", "stone, perhaps a race of underground dwarves.  The pillars are decorated", "with strange runes, but the runes are too symbolic to be easily deciphered.", "This tunnel must have had some significance for the ancient race which", "built it, as nobody would dedicate so much time to decorating a simple", "mining shaft."], "extra": {"keywords": "pillar pillars walls wall", "desc": ["\"   The workmanship is excellent, and the walls seem to fade into a row of", "pillars, though the row is solid and there is simply nowhere to go to", "except along the pathway created."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:16", "exits": [{"direction": "n", "room": "_Unknown7:17"}, {"direction": "southeast", "room": "_Unknown7:15"}]}, "17": {"index": "17", "name": "Ancient cave.", "desc": ["\"   A large, obviously quite old cave greets you, decorated on all sides with", "runed pillars and the ruins of what were once grand arches.  The only", "intact arch lies to the south, back towards the cave that the meteor opened", "up to the world once again.  There are small piles of rotten wood lying", "in the back side of the cave, and the only thing which remains intact is", "a large stone altar built into the northern wall.  Though the lichen", "adds the same eerie glow to this cave as the others, you can tell that this", "was once a magnificent center of activity, perhaps it is the stark", "emptiness which smacks of something wrong, it's longing to once again", "house crowds and become once again the apex of an advanced culture."], "extra": [{"keywords": "back altar stone north"}, {"desc": ["\"   The altar has been recently moved, you can tell by the dust, and looking", "behind it, you notice a small pathway.  The altar entrance seems to lead", "down into a dark cave, who knows what treasures lie below."]}, {"keywords": "runed pillars pillar runes rune"}, {"desc": ["\"   The pillars look mostly decorative, and the runes, though impressive and", "awe inspiring are hardly translatable."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:17", "exits": [{"direction": "s", "room": "_Unknown7:16"}, {"direction": "10", "room": "_Unknown7:18", "desc": ["\"   The altar has been recently moved, you can tell by the dust, and looking", "behind it, you notice a small pathway.  The altar entrance seems to lead", "down into a dark cave, who knows what treasures lie below."], "info": "hidden", "keywords": "altar"}]}, "18": {"index": "18", "name": "Cave of the Ancients.", "desc": ["[C   A large, obviously quite old cave greets you, decorated on all sides with", "runed pillars and the ruins of what were once grand arches.  The only", "intact arch lies to the south, back towards the cave that the meteor opened", "up to the world once again.  There are small piles of rotten wood lying", "in the back side of the cave, and the only thing which remains intact is", "a large stone altar built into the northern wall.  Though the lichen", "adds the same eerie glow to this cave as the others, you can tell that this", "was once a magnificent center of activity, perhaps it is the stark", "emptiness which smacks of something wrong, it's longing to once again", "house crowds and become once again the apex of an advanced culture."], "extra": [{"keywords": "rune runes"}, {"desc": ["\"   The runes show scenes from the lives of those in the sarcophagi, and from", "these you can put together a rough picture of what this race was like.  It", "seems that they had some sort of global empire, with lands both above and", "below ground, but the below ground portion was the apex of the civilization,", "and slaves were routinely sacrificed to prolong the life/enlarge the ruling", "class, this part is unclear.  It seems that a war broke out and decimated", "the empire, the remaining remnants of the civilization fled to caves in", "the northwestern end of their vast empire.  The history ends there, with", "the death of the last Emporor in a fight with uprising units from the", "northlands."]}, {"keywords": "sarcophagi"}, {"desc": ["\"   What you notice immideately is that the sarcophagi get progressivly", "smaller as you go north, it seems that social rank was determined by", "size, or perhaps the other way around....."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:18", "exits": [{"direction": "10", "room": "_Unknown7:17"}]}, "20": {"index": "20", "name": "Fortified cave entrance.", "desc": ["\"   The orcs of moria certainly have been busy, and have done a complete", "reversal of defence tactics it seems.  Though the cave was not particularly", "well hidden beforehand, it was the accessability of the caves which the", "orcs had relied upon for protection, well, no more.  The entrance to the", "orcish cave has been heavily fortified, with a buttressed three layer wall", "and a central gate keeping unwanted visitors out.  In addition, you can", "see fanatical orcs rushing about behind the gate, providing the orcish", "version of a posted guard.  Something sure has gotten into the orcs to", "posess them to add battlements to their caves, and to actually get them", "to stop infighting long enough to complete it.", "The fortified entrance itself is made up of a central barrier wall, with", "two lesser battlements perched atop, perhaps for archers.  A huge gateway,", "complete with a portcullis, replaces the once open entrance of the", "cave system.  Though no where near the excellent craftsmanship that would", "be required of a dwarven fortification, it is large and sturdy looking,", "and should serve it's purpose well enough."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:20", "exits": [{"direction": "s", "room": "MoriaLevel1:2"}, {"direction": "10", "room": "_Unknown7:21", "key": "60007", "info": "door, closed, locked, autoclose, autolock, pickproof, knockable", "keywords": "gate"}]}, "21": {"index": "21", "name": "Entrance to the caves.", "desc": ["\"   Of one thing you are very certain, and that is that you do not belong", "here, under the ground with a mountain sitting over your head.  Though", "the walls look sturdy enough, the orcs which inhabit these caves aren't", "the best hosts, and tend to eat their visitors.  The walls are cold stone,", "the only light coming from the gate to the south, and most of that is", "filtered out to protect the delicate eyes of the cave's inhabitants.  The", "gate contains a stairwell up to the parapets and arrow slits above.  Every", "now and then you hear a fanatical \"Whoop Whoop Whoop\" coming from somewhere", "deeper in the caves to the north...."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:21", "exits": [{"direction": "n", "room": "MoriaLevel1:10"}, {"direction": "u", "room": "_Unknown7:22"}, {"direction": "10", "room": "_Unknown7:20", "key": "60007", "info": "door, closed, locked, autoclose, autolock, pickproof, knockable", "keywords": "gate"}]}, "22": {"index": "22", "name": "Above the gateway.", "desc": ["\"   From this lofty perch you look around and can see....stone, and lots", "of it.  In fact, this entire mountain is made of stone, plus all of the", "fortifications, you suspect that orcs might have a little stone in them", "as well.  Two walkways, made of stone of course, lead out onto parapets,", "also made of stone, to the southwest and southeast."], "extra": [{"keywords": "stone"}, {"desc": "It's all over the place!"}, {"keywords": "parapet parapets"}, {"desc": ["\"   Two parapets, positioned over the gateway, allow for orc archers to", "defend their caves from intruders while offering protection for themselves."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:22", "exits": [{"direction": "d", "room": "_Unknown7:21"}, {"direction": "southeast", "room": "_Unknown7:24"}, {"direction": "southwest", "room": "_Unknown7:23"}]}, "23": {"index": "23", "name": "Western Parapet.", "desc": ["\"   This room is dominated by a battery of three huge spear lobbing war", "machines, the orcish version of ballistae, and one of the only things", "you have noticed which is not made of stone.  Though crews for the machines", "are not present, it is obvious that the orcs are gearing up for something", "big if they put the effort into building war machines of this calabre."], "extra": {"keywords": "ballistae war machines machine ballista", "desc": ["\"   The ballistae are approximately fifteen feet long, and resemble large", "crossbows.  The ammunition is like a cross between a spear and an extra", "large crossbow bolt.  The ammunition is not very easy to transport, and", "there must be some sort of place to store it around here if the ballistae", "are to be useful...."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:23", "exits": [{"direction": "northeast", "room": "_Unknown7:22"}, {"direction": "10", "room": "_Unknown7:25", "info": "hidden", "keywords": "secret"}]}, "24": {"index": "24", "name": "Eastern Parapet.", "desc": ["\"   Specially crafted to shield the archer's eyes from the burning light", "of the sun, this parapet watches over the path leading up to the orcish", "caves, allowing for approximately a dozen archers to shower an invading", "army with arrows as they smash up against the gate below.  A cauldron of", "boiling oil in the corner leaves no doubt as to the purpose of this", "room, it looks as if the orcs are getting much more defensive and organized", "than they once were."], "extra": {"keywords": "path", "desc": ["\"   The field of view allows archers to hit anything coming from directly", "in front or to the sides, and considering better organization from the", "orcs, they may even be able to manufacture bows and crossbows which would", "be able to strike from a considerable range."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:24", "exits": [{"direction": "northwest", "room": "_Unknown7:22"}]}, "25": {"index": "25", "name": "Ammunition storage room.", "desc": ["\"   A small room, orcs obviously built this rooms as an afterthought, hiding", "it behind the ballistae to protect their ammunition dump from thievary, yeah", "and it really worked...."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:25", "exits": [{"direction": "10", "room": "_Unknown7:23"}]}, "30": {"index": "30", "name": "Entrance to the lower levels.", "desc": ["\"   You can tell that the orcs have recently found some new organization, as", "an entire new level has been added to the stagnant areas of Moria.  There", "is a hole with a rope ladder leading up to the old areas of Moria, probably", "much safer than down here with the fanatical orcs."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:30", "exits": [{"direction": "s", "room": "_Unknown7:33"}, {"direction": "u", "room": "_Unknown7:31"}, {"direction": "northeast", "room": "_Unknown7:32"}]}, "31": {"index": "31", "name": "The hole.", "desc": ["\"   This area has recently been redone, the tunnel wideneded and reconstructed,", "with better worksmanship and sturdier foundations, braced with pillars and", "bespeckled with runes.  The hole, which had up until now remained collapsed", "and unworked, has been cleared, allowing travel to the lower regions once", "again.  The walls are smooth and well worked, the hole no longer just a hole,", "but a grand stairway down into a lower region of Moria."], "extra": [{"keywords": "hole stairs stairway"}, {"desc": ["\"   The hole, which has been collapsed and unaccessable for as long as you", "can remember has been recently reopened.  The amount of slave labor which", "would be required for such an endevor makes a chill run down your spine", "in revulsion."]}, {"keywords": "pillar pillars"}, {"desc": ["\"   They look familiar, in fact you could swear that you have seen this", "worksmanship elsewhere."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:31", "exits": [{"direction": "w", "room": "MoriaLevel2:11"}, {"direction": "d", "room": "_Unknown7:30"}]}, "32": {"index": "32", "name": "Long curving tunnel.", "desc": ["\"   This tunnel looks to be a part of an older tunnel system, stalagtites", "have formed from the ceiling, something which takes centuries at least,", "giving evidence that this entire \"new\" level of moria is in fact built", "off much older existing structures.  The tunnel is quite damp, water", "dripping from the ceiling and giving the impression of rain even this far", "underground.  Though stalagtites hang from the ceiling, it also looks as", "if the tunnel has been recently widened, perhaps to accomodate heavy", "traffic."], "extra": [{"keywords": "stalagtite stalagtites"}, {"desc": ["\"   Water dripping over centuries has formed long drooping inverted cones of", "stone on the ceiling.  The structures are a testament to the true age of", "this cave system."]}, {"keywords": "_weather"}, {"desc": ["\"   Though you are indoors, the cool water condensing from the ceiling gives", "you the impression of rain."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:32", "exits": [{"direction": "n", "room": "_Unknown7:46"}, {"direction": "southwest", "room": "_Unknown7:30"}]}, "33": {"index": "33", "name": "Long curving tunnel.", "desc": ["\"   This tunnel has been carved out of the damp, hard rock of the mountain,", "curving either by accident or design, it is hard to tell which.  The", "diameter remains approximately the same, seemingly canceling any defensive", "gain from the curvature of the tunnel.  Water drips from the ceiling,", "consensing out of the damp air and creating the impression of rain, even", "indoors."], "extra": [{"keywords": "_weather"}, {"desc": ["\"   Though deep in the caves, it seems as if it is raining due to the", "condensation dripping of the ceiling."]}, {"keywords": "water ceiling"}, {"desc": ["\"   The water has brought out all the dust from the cave, running in small,", "stagnant streams down the center of the tunnel, leaving crisp clear water", "dripping from the ceiling.  At least the orcs will never go thirsty."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:33", "exits": [{"direction": "n", "room": "_Unknown7:30"}, {"direction": "southeast", "room": "_Unknown7:34"}]}, "34": {"index": "34", "name": "Underground pool.", "desc": ["\"   The condensation from the damp tunnel seems to have accumulate here into", "a rather large underground pool, murky and dark.  Perhaps it is the other", "way around, and the pool is causing the dampness of the tunnels, but either", "way, it is clearly undrinkable, and even swimming in the cold, murky water", "seems uninviting in the extreme.  The orcs have been kind enough to build", "a sort of footpath over the pool, so that you may reach the southern edge", "without getting your feet wet."], "extra": [{"keywords": "_ex10"}, {"desc": ["\"   You tentatively duck your feet, then your waiste, and finally your head", "under the cool, dark water.  The water rushes in on you, freezing you to the", "bone and soaking your clothes, you begin to think that you will never again", "be warm...."]}, {"keywords": "footpath"}, {"desc": ["\"   The footpath consists of a large stone ediface, much like a bridge, but", "solid and continuing down into the water, a much cruder construction than", "those above ground."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:34", "exits": [{"direction": "southwest", "room": "_Unknown7:35"}, {"direction": "northwest", "room": "_Unknown7:33"}, {"direction": "10", "room": "_Unknown7:56", "desc": ["\"   Well, if you really desired, you could submerge yourself in the cold,", "murky water, but upon taking a second look, it really might not be the", "wisest choice."], "info": "hidden, message", "keywords": "pool"}]}, "35": {"index": "35", "name": "Damp Tunnel.", "desc": ["\"   The tunnel here is quite damp and dark, water condensing off the ceiling", "and forming small puddles on the floor of the cave.  This cave seems to", "have been recently expanded to accommodate heavier traffic.  You can see", "dim light coming from both the north and south, and an even brighter light", "coming from the western tunnel.  Broken debris litters the tunnel, making", "walking difficult."], "extra": {"keywords": "debris", "desc": ["\"   Mostly broken shovels and pickaxes, the debris includes broken rocks as", "well, reflecting most probably recent mining activity in the region."]}, "flags": "no_mob, indoors", "zone": "_Unknown7", "room_key": "_Unknown7:35", "exits": [{"direction": "w", "room": "_Unknown7:36"}, {"direction": "northeast", "room": "_Unknown7:34"}, {"direction": "southwest", "room": "_Unknown7:38"}]}, "36": {"index": "36", "name": "Mining Tunnel.", "desc": ["\"   This tunnel is currently being dug, it looks most certainly to be for", "mining purposes, as it winds back and forth, and gold veins can be seen near", "the end of the current tunnel.  Corpses of slaves line the tunnel, left to", "lie where they died while mining the gold veins, presumably."], "extra": {"keywords": "corpses corpse dead", "desc": ["\"   The corpses show whip marks along their backs, and the bodies are", "sickeningly gaunt, perhaps food was considered too high a price to pay to", "keep the slaves healthy."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:36", "exits": [{"direction": "e", "room": "_Unknown7:35"}, {"direction": "southwest", "room": "_Unknown7:37"}]}, "37": {"index": "37", "name": "Mining Tunnel.", "desc": ["\"   Mining is continuing on the veins of precious metals here, slave labor", "being used both in the actual digging and in the processing of the gold.", "Usually such an operation would require overseers to make sure that no", "gold was being smuggled out, but the orcs seem so confident in their", "degredation of the slaves that they do not even bother making sure that", "nobody is stealing from them."], "extra": {"keywords": "gold veins", "desc": ["\"   The gold, quite pure and very valuable, doesn't seem to be guarded as", "well as it should be, perhaps the orcs are overly confident in their own", "guards, or perhpas they think themselves too removed for anyone to escape", "from here."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:37", "exits": [{"direction": "e", "room": "_Unknown7:38"}, {"direction": "northeast", "room": "_Unknown7:36"}, {"direction": "southwest", "room": "_Unknown7:39"}]}, "38": {"index": "38", "name": "Damp Tunnel.", "desc": ["\"   This tunnel has recently been widened or restructured, the walls smooth", "and uncracked, not showing any of the effects of time.  Small veins of", "what appears to be gold and silver run along the walls, too small to be", "valuable in themselves, but often telling of larger veins which a good", "miner can follow to their highly valuable source.  The walls are damp", "from condensation from the slightly warmer air, perhaps travelling in from", "above.  It appears that orcs do not mind cold, as it is quite chilly", "in these caves."], "extra": {"keywords": "silver gold veins", "desc": ["\"   They are quite small, and crooked in shape, mostly appearing as mere", "spots, travelling perpendicular to the direction of the caves.  The amount", "of work it would take to mine these veins would not be worth the meagre", "output, but where small veins of ore abound, there are bound to be larger", "ones somewhere nearby."]}, "flags": "no_mob, indoors", "zone": "_Unknown7", "room_key": "_Unknown7:38", "exits": [{"direction": "w", "room": "_Unknown7:37"}, {"direction": "northeast", "room": "_Unknown7:35"}, {"direction": "southeast", "room": "_Unknown7:40"}]}, "39": {"index": "39", "name": "Mining tunnel.", "desc": ["\"   This looks like an area where the vein which was being mined has run out,", "abandoned shovels and pickaxes, mostly broken, line the end of this", "tunnel.  The power of gold is clear here, as what lengths men and orcs will", "go to to get it are clear.  You could see no use that the orcs could have", "for so much gold, however, as they are not paying for the labor costs of", "building these caves."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:39", "exits": [{"direction": "northeast", "room": "_Unknown7:37"}]}, "40": {"index": "40", "name": "Guard post.", "desc": ["\"   A large, open gate to the east leads into a darker tunnel, from which", "emanates some truly foul smells, offensive to your delicate nose.  The", "tunnel here is rough and jagged, those who dug it spent no time smoothing", "it out, they must have simply hewn chunks out of the bare rock."], "extra": [{"keywords": "gate"}, {"desc": ["\"   The gate is large, but not very well crafted.  It must be closed by", "some sort of mechanical winch, as you certainly could not close it by", "hand."]}, {"keywords": "_ex1"}, {"desc": ["\"   As you wander east, the gate closes behind you and you hear laughter", "and a maniacle voice scream \"Welcome to the slave pits.....slave!\""]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:40", "exits": [{"direction": "e", "room": "_Unknown7:41", "info": "message"}, {"direction": "northwest", "room": "_Unknown7:38"}]}, "41": {"index": "41", "name": "Slavemaster's Quarters.", "desc": ["\"   A rough hewn tunnel, with an impressive looking gate to the west, this", "seems to serve as the quarters for the slave master, as you can see a cot", "lying against the southern wall.  Terrifying sounds come from the east,", "wailing screams and the sounds of dying creatures."], "extra": {"keywords": "cot", "desc": ["\"   It is a simple cot, made out of some sort of wood fibres sewn together", "into a makeshift mattress."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:41", "exits": [{"direction": "e", "room": "_Unknown7:42"}, {"direction": "w", "room": "_Unknown7:40", "key": "60006", "info": "door, closed, locked, pickproof, autoclose, autolock", "keywords": "escape gate door west"}]}, "42": {"index": "42", "name": "Torture chamber.", "desc": "Empty", "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:42", "exits": [{"direction": "e", "room": "_Unknown7:44"}, {"direction": "w", "room": "_Unknown7:41"}]}, "43": {"index": "43", "name": "Slave pit.", "desc": ["\"   Squallid and reeking of feces, the slave pit is definitely not where you", "would like to spend the rest of your life.  Sounds of extreme human", "misery drift in from the northwest, it seems that the torturers are earning", "their keep.  A huge pile of hay lies in the corner, covered in human filth."], "extra": {"keywords": "hay filth", "desc": ["\"   The pile of hay is crawling with vermin and reeks of human feces, not", "the most inviting place to sleep, but all that's avaliable to slaves."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:43", "exits": [{"direction": "n", "room": "_Unknown7:44"}]}, "44": {"index": "44", "name": "Slave pit.", "desc": ["\"   Filthy and covered in blood, the shackle covered walls of the slave pit", "are most uninviting.  The slaves have obviously been regularly beaten in", "additon to being forced into backbreaking work, probably simply a matter", "of luck which killed them first, the beatings or the inhuman amounts of", "work.  Those that survive have lost all lust for life, and survive simply", "because they know nothing else to do but hang on for the sake of hanging", "on, you can tell that those you have seen have absolutely no inkling of", "hope, the sign of a good torturer."], "extra": {"keywords": "walls shackles shackle wall", "desc": ["\"   The shackles dangle from the walls, and in turn things hang from some of", "them....severed hands, rotting limbs, and some which might even be alive,", "the line is blurred in here."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:44", "exits": [{"direction": "n", "room": "_Unknown7:45"}, {"direction": "s", "room": "_Unknown7:43"}, {"direction": "w", "room": "_Unknown7:42"}]}, "45": {"index": "45", "name": "Slave pit.", "desc": ["\"   A dark, forboding hole, the slave pits have been recently dug out of the", "bare rock, and shackles attached to the broken rock of the walls.  Screams", "emanate from the southwest, and the sounds of slaves returning from work for", "a brief hour of sleep or to head off to the torture chamber to pay for some", "imagined lazyness."], "extra": {"keywords": "shackles shackle", "desc": ["\"   The shackles are bolted into the bare rock of the wall, and some", "disturbing things hang from some of the shackles, best not to get a closer", "look at them."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:45", "exits": [{"direction": "s", "room": "_Unknown7:44"}]}, "46": {"index": "46", "name": "Tunnel intersection.", "desc": ["\"   The older section of the tunnel, marked by the existance of stalagtites,", "runs from the northwest to the south.  A newly carved tunnel branches off", "to the northeast, smooth and semicircular in shape.  The tunnel here is", "quite damp, but the darkness is driven away by the occasional lantern."], "extra": {"keywords": "lantern lanterns", "desc": ["\"   Strange, orcs seem to hate light, and yet these lower tunnels are at", "least moderately well lit, perhaps it is for the benefit of the slaves who", "are digging them out."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:46", "exits": [{"direction": "s", "room": "_Unknown7:32"}, {"direction": "northeast", "room": "_Unknown7:48"}, {"direction": "northwest", "room": "_Unknown7:47"}]}, "47": {"index": "47", "name": "Curving tunnel.", "desc": ["\"   The tunnel is dark and forboding here, nobody has bothered to clear out", "the centuries, perhaps millenia of stalagtites and stalagmites which have", "formed in this cave.  You can see that this cave was never a planned cave,", "but probably a natural formation, as the walls are uneven and cracked, the", "ravages of time left unchanged by the current occupants."], "extra": [{"keywords": "stalagmites stalagmite"}, {"desc": ["\"   The opposite of stalagtites, these shorter and squatter cones lay on the", "floor of the cave, making passage difficult."]}, {"keywords": "stalagtites stalagtite"}, {"desc": ["\"   Centuries worth of dripping water has created these formations which hang", "from the ceiling and create eerie shadows on the cave walls."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:47", "exits": [{"direction": "n", "room": "_Unknown7:51"}, {"direction": "southeast", "room": "_Unknown7:46"}]}, "48": {"index": "48", "name": "Runed tunnel.", "desc": ["\"   A newly crafted tunnel greets you, smooth walls enscripted with decorative", "runes and laced with gold.  The tunnel is semicircular in shape, with none of", "the stalagtites or water spots of the older tunnels.  Gently curving to the", "east, the tunnel is truly a grand construction, worthy of the dwarven", "stonesmiths of old.  No longer crude and disorganized, the orcs which", "created such a tunnel must have matured, and are no longer worthy of", "ridicule."], "extra": {"keywords": "rune runes", "desc": ["\"   The runes depict the return of a king/leader after a long \"sleep\", but", "beyond that the symbolism escapes you."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:48", "exits": [{"direction": "e", "room": "_Unknown7:49"}, {"direction": "southwest", "room": "_Unknown7:46"}]}, "49": {"index": "49", "name": "Runed tunnel.", "desc": ["\"   This richly outfitted tunnel does not seem to fit in with the dismal and", "undecorated tunnels which mark upper Moria.  The walls are lined with", "beautiful gold rimmed runes and decorations, and the tunnel is suprisingly", "well lit despite the orc's known dislike for light.  Torches provide much", "of the lighting, though you see that there has been an attempt to grow", "some glowing lichen on the walls too."], "extra": [{"keywords": "torch torches"}, {"desc": ["\"   The torches are quite dim compared to those that adventurers would prefer", "for venturing into truly dark caves.  They are bolted to the walls and look", "to burn some sort of oil, instead of simple wood burning."]}, {"keywords": "gold runes rune decorations decoration"}, {"desc": ["\"   The runes and decorations gleam in the torchlight with their heavy", "gold lining, a declaration to all that enter this tunnel that the", "owners are quite rich and powerful."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:49", "exits": [{"direction": "s", "room": "_Unknown7:50"}, {"direction": "w", "room": "_Unknown7:48"}]}, "50": {"index": "50", "name": "Grand Stairway.", "desc": ["\"   A grand stairway, outfitted with golden handrails and carved of bricks", "inlaid with silver, leads down into a lower level of Moria, an ostentatious", "declaration of the power and wealth of the new ruler of Moria, even the", "stairway is a bold statement to would be usurpers.  Clearly those in power", "intend to show off their wealth and power to all orcs who would come to see", "the new levels of Moria.  Vast amounts of gold and silver must have been", "used in the construction of this staircase, clearly this is near to the", "seat of power."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:50", "exits": [{"direction": "n", "room": "_Unknown7:49"}, {"direction": "d", "room": "_Unknown7:55"}]}, "51": {"index": "51", "name": "Curving tunnel.", "desc": ["\"   The tunnel twists and turns, though instead of a deliberate design to", "prevent invasion, the turns seem to be the natural configuration of the", "tunnel, created perhaps by an underground stream or volcanic flow."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:51", "exits": [{"direction": "s", "room": "_Unknown7:47"}, {"direction": "northwest", "room": "_Unknown7:52"}]}, "52": {"index": "52", "name": "Wide tunnel.", "desc": ["\"   The stalagtites and stalagmites which were common in the tunnel south of", "here have been cleared out and the tunnel widened considerably just", "recently.  You can see that where the natural tunnel ended, two new caves", "have been dug, to the northwest and swouthwest."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:52", "exits": [{"direction": "southeast", "room": "_Unknown7:51"}, {"direction": "southwest", "room": "_Unknown7:53"}, {"direction": "northwest", "room": "_Unknown7:54"}]}, "53": {"index": "53", "name": "Bare chamber.", "desc": ["\"   This chamber is absolutely bare, except for a large, blood stained altar", "along the back wall.  Candelabras light the altar with an eerie glow,", "lending an aura of unreality to this cave.  You feel disoriented in this", "unholy place, and cannot concentrate on any one thing, you mind becoming", "affected by the very power of this site."], "extra": {"keywords": "altar", "desc": ["\"   The altar is stained bright red from recent sacrifices, and skulls line", "the altar, making no secret of the practices which go on here."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:53", "exits": [{"direction": "northeast", "room": "_Unknown7:52"}]}, "54": {"index": "54", "name": "Richly adorned chamber.", "desc": ["\"   This chamber may be the trophy room of the orc king, it is certainly", "decorated well enough.  The walls are lined in gold, and the decapitated", "heads of many different races adorn the shelves of this room.  Huge", "tapestries and rugs line the walls and floor, and an absolutely massive", "chandelier hangs from the ceiling.  This room, a typically orcish mixture", "of riches and ruthlessness, looks much like many pagan worship sites,", "declaring it's power with the heads of it's enemies."], "extra": {"keywords": "chandelier", "desc": ["\"   It must be a captured war trophy from somewhere, as you know that the", "orcs would never be able to create such a work of beauty, much less to", "actually do it."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:54", "exits": [{"direction": "southeast", "room": "_Unknown7:52"}]}, "55": {"index": "55", "name": "Great Throne Room.", "desc": ["\"   A grand throne room, bedecked in gold and silver and housing the largest", "throne you have ever set your eyes upon greets you upon entering.  Several", "lesser chairs, obviously for the king's advisors, line a long table taking", "up much of the center of the room.  The walls are enscripted with gold", "laced runes, and balls of light suspended from the floor light the room", "with an eerie green glow, making the gold and silver look almost sickly", "in appearance."], "extra": [{"keywords": "rune runes"}, {"desc": ["\"   Garish and decorative, the runes seem not to serve any true purpose", "besides declaring the incredible wealth of the occupants of these", "caves."]}, {"keywords": "gold silver"}, {"desc": ["\"   It is everywhere, covering the walls, the throne, even the chairs and", "table."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:55", "exits": [{"direction": "s", "room": "_Unknown7:60", "key": "60005", "info": "door, closed, locked, pickproof", "keywords": "door gate"}, {"direction": "u", "room": "_Unknown7:50"}]}, "56": {"index": "56", "name": "Struggling in the murky depths.", "desc": ["\"   The water is almost black, and it pains you to open your eyes, even for", "just a few seconds....but in those few seconds, you catch a glimpse of a", "light.  Something inside of you says....go towards the light, go towards", "the light."], "sector": "Underwater", "extra": {"keywords": "_teleport", "desc": "You feel numbed to the bone, best to get out of this water quickly!"}, "flags": "indoors", "tele": "50, 0, 57", "zone": "_Unknown7", "room_key": "_Unknown7:56", "exits": [{"direction": "u", "room": "_Unknown7:34", "info": "hidden"}, {"direction": "10", "room": "_Unknown7:34", "keywords": "surface"}, {"direction": "11", "room": "_Unknown7:58", "info": "hidden", "keywords": "light"}]}, "57": {"index": "57", "name": "Struggling in the murky depths.", "desc": "\"\"", "flags": "indoors, noshowexit", "tele": "1, 0, 56", "zone": "_Unknown7", "room_key": "_Unknown7:57"}, "58": {"index": "58", "name": "In the less murky depths.", "desc": ["\"   The water has warmed up considerably, the light seems to have brought with", "it a warmpth, or perhaps you just couldn't hold it in.  In any case, you", "still cannot open your eyes for more than a second or two to get oriented,", "and just notice that you have gone under a sort of rock overpass.  The", "surface is well lit, though maybe it wouldn't be best to come up in the", "midst of an orc gathering, or whatever is up there....."], "sector": "Underwater", "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:58", "exits": [{"direction": "u", "room": "_Unknown7:59", "info": "hidden"}, {"direction": "10", "room": "_Unknown7:56", "keywords": "pool"}, {"direction": "11", "room": "_Unknown7:59", "keywords": "surface"}]}, "59": {"index": "59", "name": "Floating on an underground ocean.", "desc": ["\"   You float in what could rightly be called an ocean, be it underwater or", "above.  The overpass which you have come under to get here lies to the", "southwest, but you would need to go underwater yet again in order to find", "it, as the gloom here is overwhelming and you cannot see more than a foot", "into the murky waters.  A dim light comes from off the water to what you", "assume is the northeast, about half a mile or so.  From here it looks like", "a rather large island, perhaps an archepelagio, and someone is obvioulsy", "inhabiting it.  Even though these inhabitants may not be very nice, it", "is quite cold floating on this water, so you will have to either swim", "towards the island or try to find the way back under the overpass."], "sector": "Shallow Water", "extra": [{"keywords": "_ex10"}, {"desc": ["\"   You swim out towards the island, what seems an eternity of a quest in", "the bone chilling waters.  The thing which bothers you most is the lack", "of stars in what seems to be the night sky....when you finally wash up", "on the shores of the island, you are exausted."]}, {"keywords": "_ex5"}, {"desc": ["\"   You search around in the lukewarm water for a few minutes, and finally", "find the way back under the overpass, back into the chilly waters under", "the moria caves."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:59", "exits": [{"direction": "d", "room": "_Unknown7:56", "info": "message"}, {"direction": "10", "room": "_Unknown7:61", "info": "message", "keywords": "island"}]}, "60": {"index": "60", "name": "Treasure room.", "desc": ["\"   EMPTY!  What would obviously be a room where any great king or ruler", "would keep countless priceless treasures is....empty.  Teasing you is", "a thin layer of gold dust and flakes, probably coming from gold bars which", "have been moved or taken from here recently.  Could the orcs have possibly", "used all of their gold reserves?  Perhaps some theiving adventurer took", "what was rightfully YOUR gold....."], "extra": {"keywords": "gold dust flakes flake", "desc": ["\"   The dust and flakes must have come off of some large stores of gold bars,", "but all the dust pieced together now couldn't buy you breakfast."]}, "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:60", "exits": [{"direction": "n", "room": "_Unknown7:55"}]}, "61": {"index": "61", "name": "Underground Island.", "desc": ["\"   You are standing on a very large island in an underground ocean, with a", "hill dominating the landscape in the center of the island.  Signs of building", "are all over the island, foundations laid for what could become a castle", "even larger than Midguard, a worthy center of government for an ambitious", "Emporor.  For now all that is clearly built is a rather large keep on the", "top of the hill, though the roofing on that appears to be unfinished as", "well.  The island is well lit from some sort of glowing algae which has", "washed up on the shores of the island."], "extra": [{"keywords": "_ex10"}, {"desc": ["\"   You swim back towards the overpass which you used to get into this", "ocean, but with the lack of stars, it is almost impossible to find your", "way, eventually, you come to the edge of the ocean sized cavern."]}, {"keywords": "_ex11"}, {"desc": ["\"   Upon entering the keep, you realize that you have stepped in over your head", "and may not live to get out, you get a glimpse of an unfinished throne room", "before powerful mages rip your magical defences away and the orc king himself", "hefts up a giant axe to split your skull with."]}], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:61", "exits": [{"direction": "10", "room": "_Unknown7:59", "info": "message", "keywords": "ocean"}, {"direction": "11", "room": "_Unknown7:62", "info": "message", "keywords": "keep"}]}, "62": {"index": "62", "name": "\"\"", "desc": "\"\"", "flags": "indoors, noshowexit, dispel_magic", "tele": "1, 0, 63", "zone": "_Unknown7", "room_key": "_Unknown7:62"}, "63": {"index": "63", "name": "Unfinished throne room.", "desc": ["\"   This looks to be the beginnings of quite the ediface, a throne room which", "would rival any in the world.  Though clearly incomplete, with the ceiling", "foundation in but the roofing not done, it looks as if this would be the", "center of a castle with would cover the entire island if completed.  With", "a center of power such as that, the orc's imperial ambitions could easily", "become a reality."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:63", "exits": [{"direction": "n", "room": "_Unknown7:64"}]}, "64": {"index": "64", "name": "Treasure cove.", "desc": ["\"   What would some day be the imperial treasury lies here, open and incomplete,", "surely not as safe from bandits as any ruler would want their treasure to", "be.  The orcs seem very interested in gold as their standard, though you", "cannot see why it would be nessecary, as the orcs seem to gain anything they", "want through force."], "flags": "indoors", "zone": "_Unknown7", "room_key": "_Unknown7:64", "exits": [{"direction": "s", "room": "_Unknown7:63"}]}}}