{"zone": "AgatarsKeep", "rooms": {"0": {"index": "0", "name": "Entrance to Keep", "desc": ["\"   You are in between the two great doors that form the entrance to", "the keep.  The door to the south is made of heavy oak, blackened with", "age and whatever else.  The stone is cold and damp to touch.  The door", "to the north seems unlocked and opens slightly with a gentle touch.", "The darkness that you felt to the south, seems to be abated within", "the castle."], "flags": "no_mob", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:0", "exits": [{"direction": "s", "room": "HaondorDark:0"}, {"direction": "11", "room": "AgatarsKeep:1", "keywords": "inside"}]}, "1": {"index": "1", "name": "In a North-South Corridor", "desc": ["\"   You are just inside the entrance to the Keep.  It is better lit", "than the area just outside the door.  There is an unusual metal lining", "the walls which glows in the darkness, providing enough light to see", "by.  There is a gentle murmuring, like prayer, floating through the", "air.  There is a solid but small oak door to the south leading to the", "outside and another such door to the east."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:1", "exits": [{"direction": "n", "room": "AgatarsKeep:2"}, {"direction": "10", "room": "AgatarsKeep:0", "keywords": "outside"}, {"direction": "11", "room": "AgatarsKeep:7", "keywords": "door"}]}, "2": {"index": "2", "name": "At the Intersection of Two Corridors", "desc": ["\"   You are at the intersection of two corridors and a stairwell", "leading both up and down.  The corridors are quite wide and each has", "a large band of silvery metal running along the centres of each floor", "and wall.  The twisting of the staircase prevents any views of the", "rooms above and below you but it seems darker below.  Along each", "corridor you can see doors leading into some rooms.  Every now and then", "you can see a white clad figure cross between the rooms."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:2", "exits": [{"direction": "n", "room": "AgatarsKeep:5"}, {"direction": "e", "room": "AgatarsKeep:3"}, {"direction": "s", "room": "AgatarsKeep:1"}, {"direction": "w", "room": "AgatarsKeep:4"}, {"direction": "u", "room": "AgatarsKeep:10"}, {"direction": "d", "room": "AgatarsKeep:50"}]}, "3": {"index": "3", "name": "An East-West Corridor", "desc": ["\"   You are at the eastern end of a corridor.  The corridor has a large", "band of silvery metal running along the centres of each floor and wall.", "There is a nice smell coming from the room to the north of you.  The", "door leading to that room is closed but could be opened if the smell", "of cooking overpowers you.  To the west you can see more corridors", "and a staircase."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:3", "exits": [{"direction": "w", "room": "AgatarsKeep:2"}, {"direction": "10", "room": "AgatarsKeep:8", "keywords": "door"}]}, "4": {"index": "4", "name": "An East-West Corridor", "desc": ["\"   You are at the western end of a corridor.  There is a half-open", "door to the south, viewing inside you can see several white-clad figures", "moving silently around the room.  The gentle murmuring in the air is", "joined by the smell of herbs and spices.  The walls are dry here and", "a sense of warmth comes from the room behind the door. To the east you", "can see more corridors and a staircase."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:4", "exits": [{"direction": "e", "room": "AgatarsKeep:2"}, {"direction": "10", "room": "AgatarsKeep:6", "keywords": "door"}]}, "5": {"index": "5", "name": "A North-South Corridor", "desc": ["\"   You are at the northern end of a corridor.  The corridor has a large", "band of silvery metal running along the centres of each floor and wall.", "The metal glows in the dark providing just enough light to see by.", "There is a nice smell coming from the room to the west of you.  There", "is a little crack in the wall that allows the smell of cooking to", "permeate through.  To the west you can see an unlocked door leading", "into a large room.  To the south you can see a spiral staircase pierce", "down from the floor above to the floors below."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:5", "exits": [{"direction": "s", "room": "AgatarsKeep:2"}, {"direction": "10", "room": "AgatarsKeep:9", "keywords": "door"}]}, "6": {"index": "6", "name": "An Infirmary", "desc": ["\"   You are in the infirmary.  There are about six beds.  Many of the", "beds have patients and the patients are outnumbered by the carers.", "The air of the room is that of bleach and herbs.  The room is extremely", "well lit, not a dark spot is to be seen, and the omnipresent silver", "is even more densely covering the walls than ever before.  The patients", "are in several stages of healing.  Some of them look ready to leave but", "others look barely human, their visages contorted in inhuman ways.  The", "carers seem to be extremely caring, worrying up every twinge and call", "of the patients.  You sense both horror and love from the room, but", "cant determine if it is the patients that are horrified or the doctors."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:6", "exits": [{"direction": "10", "room": "AgatarsKeep:4"}]}, "7": {"index": "7", "name": "The Records Room", "desc": ["\"   You are in some form of records room.  The room is dank and musty,", "but in a way different than that experienced outside the castle.  It has", "the ancient feel of any great library.  In the centre of the room is a", "large seal.  Along some of the walls large plaques have been erected.", "Looking at the plaques you can see that several have been filled with", "the names of those that have fallen in the struggle within this castle.", "From the dates you can see that this mission is very recent and yet the", "numbers of souls lost in battle is significant, this must have been a", "dangerous place at one time."], "extra": {"keywords": "seal", "desc": ["\"   You see a large seal upon a sheet of paper.  Written in the complex", "seal you can see that it is of the High Council from Minton's Keep,", "from the side of the light.  Beneath the seal is written a small", "message in a beautifully flowing script.", "The perils of Agatar are many indeed", "For that the battle must be fought", "For if the darkside is to be held", "No breach must be neglected", "For this we endeavour a mission,", "This breach to seal and be sealed", "For where there is light there is hope", "Where there is hope there will be victory", "\"\t"]}, "zone": "AgatarsKeep", "room_key": "AgatarsKeep:7", "exits": [{"direction": "10", "room": "AgatarsKeep:1"}]}, "8": {"index": "8", "name": "A Large Kitchen", "desc": ["\"   You are in a large kitchen.  There are several figures working", "diligently over a large fire at the back of the room.  There is a", "beautiful smell of a thick creamy vegetable soup wafting through the", "air.  In the centre of the room you can see a large table, and stacked", "upon it you can see a large leg of ham, surrounded by sundry vegetables.", "Hanging near the table is a large side of beef, with several cuts", "already taken from the side.  The monks who are cooking notice your", "presence but dont seem to mind you being there."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:8", "exits": [{"direction": "10", "room": "AgatarsKeep:3"}]}, "9": {"index": "9", "name": "A Storage Room", "desc": ["\"   You are in a large room, about twelve yards by twenty.  The room is", "stacked with barrels in one corner and in the others, large crates.", "Peeking inside you can see that they are full of food.  Looking around", "you can see sides of beef, and many forms of bird, these monks may", "be religious but are also well-fed.  Several of the crates are even", "filled with bottles of wine.  The crates are all closed tightly,", "despite the odd cracks and it will be impossible to get to any of the", "stuff inside.  A door leads back into the corridor."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:9", "exits": [{"direction": "10", "room": "AgatarsKeep:5"}]}, "10": {"index": "10", "name": "On a Landing Upon A Spiral Staircase", "desc": ["\"   The darkness is near overwhelming but there is sufficient light", "from the spluttering torches for you to note that there are three", "corridors leading from this staircase.  The corridor to the east and", "north seem less dark-covered than the western corridor.  There is a", "dank smell to the air, like their is something rotten nearby.  Some", "extra light is produced by the silver linings on the floor that meet", "at the stairwell in a complicated twisting and twirling shape.  The", "lines lead along each corridor."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:10", "exits": [{"direction": "n", "room": "AgatarsKeep:13"}, {"direction": "e", "room": "AgatarsKeep:11"}, {"direction": "w", "room": "AgatarsKeep:12"}, {"direction": "u", "room": "AgatarsKeep:19"}, {"direction": "d", "room": "AgatarsKeep:2"}]}, "11": {"index": "11", "name": "In A Narrow Corridor", "desc": ["\"   You are in a narrow corridor.  There is a silver metal lining along", "the centre of the floor.  It seems to clear the area just a little.", "The corridor has a damp, decaying smell to it.  The walls have been", "scraped clean and the doors on either side of the corridor are marked", "with the same silvery material that lines the floor.  Touching the", "material you are momentarily filled with a sense of whiteness .. nothing", "else just a pure whiteness.  The door to the south is more an arch than", "a door, and the room beyond looks like a living room.  The door to the", "north is shut."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:11", "exits": [{"direction": "w", "room": "AgatarsKeep:10"}, {"direction": "10", "room": "AgatarsKeep:16", "keywords": "arch"}, {"direction": "11", "room": "AgatarsKeep:17", "keywords": "door"}]}, "12": {"index": "12", "name": "In A Narrow Corridor", "desc": ["\"   You are in a narrow corridor.  There are doors leading away to the", "north and the south.  The silver lining that leads from the stairwell", "to here gets rustier and smaller the further west you look.  About ten", "feet from the end of the corridor you can see the metal bubble and boil", "and slow recede towards to, almost imperceptibly slowly but the metal", "is being destroyed by something in this place.  The ever-present hum", "of prayer is quite audible here."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:12", "exits": [{"direction": "e", "room": "AgatarsKeep:10"}, {"direction": "10", "room": "AgatarsKeep:14", "keywords": "arch"}, {"direction": "11", "room": "AgatarsKeep:18", "keywords": "door"}]}, "13": {"index": "13", "name": "In A Narrow Corridor", "desc": ["\"   You are in a narrow corridor.  There is a silver metal lining along", "the centre of the floor.  It seems to clear the area just a little.", "The corridor has a damp, decaying smell to it.  The walls have been", "scraped clean and the doors on either side of the corridor are marked", "with the same silvery material that lines the floor.  There is a gentle", "hum of prayer floating through the air."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:13", "exits": [{"direction": "s", "room": "AgatarsKeep:10"}]}, "14": {"index": "14", "name": "A Large Dark-Filled Kitchen", "desc": ["\"   You are in the western part of a long room.  Nearby you can see", "a large withered table, bending, creaking as the dark, cloaking", "atmosphere twists and turns, bending the light and inverting it.  A", "door to the north leads out into a narrow corridor but you can feel", "that the darkness is straining, urging, to escape into the corridor.", "To the east you can see some white clad figures standing in the", "darkness, strangely solid in the twisting light."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:14", "exits": [{"direction": "e", "room": "AgatarsKeep:15"}, {"direction": "10", "room": "AgatarsKeep:12", "keywords": "arch"}]}, "15": {"index": "15", "name": "A Large Dark-Filled Kitchen", "desc": ["\"   You are just in front of the workline of the monks.  You are in", "the darkness, it is not very pressing, the monks must have some affect", "at this range but you can feel the evil pressing in, a warm, cloaking", "feeling.  The room bears a slight resemblance to that of a eating room", "combined with a kitchen but all the benches look withered and distorted.", "Beyond the monks you can see a great fireplace and to the west a large", "table and a door."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:15", "exits": [{"direction": "e", "room": "AgatarsKeep:16"}, {"direction": "w", "room": "AgatarsKeep:14"}]}, "16": {"index": "16", "name": "A Large Dark-Filled Kitchen", "desc": ["\"   You are in a large dining and eating room.  At your end you can", "see a large fire place, and further down the room some trestles and", "benches for the preparation and further still somewhere to eat.  You", "are not alone, there are several white clad monks hearing audibly", "praying and cast arcane spells.  About each monk a clear white aura,", "penetrating the darkness, is visible.  The monks are fighting to lay", "down some of that silver metal but it seems to vaporise almost as soon", "as it is laid on the walls or the floor, and yet the room lightens a", "little every time a new piece is laid."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:16", "exits": [{"direction": "w", "room": "AgatarsKeep:15"}, {"direction": "10", "room": "AgatarsKeep:11", "keywords": "arch"}]}, "17": {"index": "17", "name": "A Barren Room", "desc": ["\"   You are in a small barren room.  The room has been literally scoured", "clean.  Along each corner of the room the silver metal can be seen.  The", "hum of prayer is near-silently present and there is a small stand with", "a note left in the centre of the room."], "extra": {"keywords": "stand note", "desc": ["\"   In memory of Brother Horeas, who gave his life and his strength in", "purifying this room.  It was due only to his strength that pushed the", "forces of the evil ones away and released the haunted souls.  May his", "soul be rewarded."]}, "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:17", "exits": [{"direction": "10", "room": "AgatarsKeep:11"}]}, "18": {"index": "18", "name": "An Old Bedroom", "desc": ["\"    You are in a small room.  There is what appears to be the remains", "of a bed.  It is now burnt and shrivelled but still a dried up mattress", "lies on the bed and there are two dark hollows burnt into it, about", "five feet long.  Elsewhere in the room there are similarly roasted", "chairs.  The room is very dark and the scent of death and decay is", "very pervasive."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:18", "exits": [{"direction": "10", "room": "AgatarsKeep:12"}]}, "19": {"index": "19", "name": "On A Landing on a Spiral Staircase", "desc": ["\"   You are in a small dark room.  A spiralling staircase leads both", "up and down but the darkness that pervades this building hides those", "regions from view.  There is a small wooden door to the south and a", "small walkway leading north.  Looking north you can see a large window", "in the distance and exits both east and west.  The door to the south", "is of firm build but does not seem locked.  The room is very dark,", "the only source of light being that from the window, but at best that", "source seems to drown in the darkness that surrounds you.  Looking", "at the floor you can see a band of silver metal circling the stairwell", "It glows with a shining white light, in this darkness the only source", "of light."], "flags": "no_mob, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:19", "exits": [{"direction": "n", "room": "AgatarsKeep:20"}, {"direction": "u", "room": "AgatarsKeep:36"}, {"direction": "d", "room": "AgatarsKeep:10"}, {"direction": "10", "room": "AgatarsKeep:28", "keywords": "door"}]}, "20": {"index": "20", "name": "On the North Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room, leading all along", "the length of the corridor.  The glow from the metal lights the room", "sufficiently such that you can see that there are many doors leading", "off the corridor, but that for each a band of the silver metal has", "crossed it, in the shape of a large triangle.  An exit to the south", "remains unblocked, leading to the stairwell.  Looking out the windows,", "all you can see is a sheet of white flame, blocking everything from", "view.  The sheet is constant, more like a solid barrier than flickering", "flame. There is a continuous hum of people chanting echoing through", "the rooms, but you cannot make out from where it is coming."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:20", "exits": [{"direction": "e", "room": "AgatarsKeep:21"}, {"direction": "s", "room": "AgatarsKeep:19"}, {"direction": "w", "room": "AgatarsKeep:35"}]}, "21": {"index": "21", "name": "On the North Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it.  Looking out the windows, all you can see", "is a sheet of white flame, blocking everything from view.  You can see", "that the room and the walls have been scarred clean.  Alcoves where", "statues use to hang are now empty, holes in the walls where tapestries", "were once hung now bare."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:21", "exits": [{"direction": "e", "room": "AgatarsKeep:22"}, {"direction": "w", "room": "AgatarsKeep:20"}]}, "22": {"index": "22", "name": "On the East Wing of the Keep", "desc": ["\"   You are at the corner of a wide corridor, one side leads west, the", "other south.  A long band of that gleaming silver that is present in", "all the rooms is again present but instead of a single band it is now", "a complex pattern, resembling a triangle, with its point placed opposite", "the corner in the wall  The pattern inside the triangle is immensely", "complex.  The ever-present sheet of white flame blocks the view from", "both windows."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:22", "exits": [{"direction": "s", "room": "AgatarsKeep:23"}, {"direction": "w", "room": "AgatarsKeep:21"}]}, "23": {"index": "23", "name": "On the East Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room, leading all along", "the length of the corridor.  The glow from the metal lights the room", "sufficiently such that you can see that there are many doors leading", "off the corridor, but that for each a band of the silver metal has", "crossed it, in the shape of a large triangle. Looking out the windows,", "all you can see is a sheet of white flame, blocking everything from", "view.  There is a continuous hum of people chanting echoing through", "the rooms, but you cannot make out from where it is coming."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:23", "exits": [{"direction": "n", "room": "AgatarsKeep:22"}, {"direction": "s", "room": "AgatarsKeep:24"}]}, "24": {"index": "24", "name": "On the East Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it.  Looking out the windows, all you can see", "is a sheet of white flame, blocking everything from view.  You can see", "that the room and the walls have been scarred clean.  Nothing but the", "walls are left and a gentle hum of prayer."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:24", "exits": [{"direction": "n", "room": "AgatarsKeep:23"}, {"direction": "s", "room": "AgatarsKeep:25"}]}, "25": {"index": "25", "name": "On the East Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it.  Looking out the windows, all you can see", "is a sheet of white flame, blocking everything from view.  You can see", "that the room and the walls have been scarred clean.  Alcoves where", "statues use to hang are now empty, holes in the walls where tapestries", "were once hung now bare."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:25", "exits": [{"direction": "n", "room": "AgatarsKeep:24"}, {"direction": "s", "room": "AgatarsKeep:26"}]}, "26": {"index": "26", "name": "On the East Wing of the Keep", "desc": ["\"   You are at the corner of a wide corridor, one side leads west, the", "other north.  A long band of that gleaming silver that is present in", "all the rooms is again present but instead of a single band it is now", "a complex pattern, resembling a triangle, with its point placed opposite", "the corner in the wall  The pattern inside the triangle is immensely", "complex.  The sound of people chanting is even more prevalent here than", "in the rest of the corridor."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:26", "exits": [{"direction": "n", "room": "AgatarsKeep:25"}, {"direction": "w", "room": "AgatarsKeep:27"}]}, "27": {"index": "27", "name": "On the South Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it. You notice that some of the doors that have", "been sealed with the silver metal have begun to tarnish the metal, no", "longer is pure and unsullied but in parts rusty.  Looking out the", "windows, all you can see is a sheet of white flame, blocking everything", "from view.  You can see that the room and the walls have been scarred", "clean.  Alcoves where statues use to hang are now empty, holes in the", "walls where tapestries were once hung now bare."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:27", "exits": [{"direction": "e", "room": "AgatarsKeep:26"}, {"direction": "w", "room": "AgatarsKeep:28"}]}, "28": {"index": "28", "name": "On the South Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room, leading all along", "the length of the corridor.  The glow from the metal lights the room", "sufficiently such that you can see that there are many doors leading", "off the corridor, but that for each a band of the silver metal has", "crossed it, in the shape of a large triangle.  An exit to the north", "remains uncrossed.  Looking out the windows, all you can see is a sheet", "of white flame, blocking everything from view.  There is a continuous", "hum of people chanting echoing through the rooms, but you cannot make", "out from where it is coming."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:28", "exits": [{"direction": "e", "room": "AgatarsKeep:27"}, {"direction": "w", "room": "AgatarsKeep:29"}, {"direction": "10", "room": "AgatarsKeep:19", "keywords": "door"}]}, "29": {"index": "29", "name": "On the South Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it.  Looking out the windows, all you can see", "is a sheet of white flame, blocking everything from view.  You can see", "that the room and the walls have been scarred clean.  Nothing but the", "walls are left and a gentle hum of prayer."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:29", "exits": [{"direction": "e", "room": "AgatarsKeep:28"}, {"direction": "w", "room": "AgatarsKeep:30"}]}, "30": {"index": "30", "name": "On the West Wing of the Keep", "desc": ["\"   You are at the corner of a wide corridor, one side leads east, the", "other north.  A long band of that gleaming silver that is present in", "all the rooms is again present but instead of a single band it is now", "a complex pattern, resembling a triangle, with its point placed opposite", "the corner in the wall  The pattern inside the triangle is immensely", "complex.  The ever-present sheet of white flame blocks the view from", "both windows.  Looking north you catch a fleeting glimpse of something", "as it escaped a room and fled around the corridor.. a shivering sight."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:30", "exits": [{"direction": "n", "room": "AgatarsKeep:31"}, {"direction": "e", "room": "AgatarsKeep:29"}]}, "31": {"index": "31", "name": "On the West Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it. You notice that some of the doors that have", "been sealed with the silver metal have begun to tarnish the metal, no", "longer is it pure and unsullied but in parts rusty.  Looking out the", "windows reveals nothing but whiteness all over."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:31", "exits": [{"direction": "n", "room": "AgatarsKeep:32"}, {"direction": "s", "room": "AgatarsKeep:30"}]}, "32": {"index": "32", "name": "On the West Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room, partially corroded.", "The glow from the metal lights the room sufficiently such that you can", "see that there are many doors leading off the corridor, but that for", "each a band of the silver metal has crossed it.  The original shape was", "that of an inverted triangle but here some of the doors have had nearly", "all the sides broken by rust, and instead of gleaming white, a sullen", "red leaks from the metal."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:32", "exits": [{"direction": "n", "room": "AgatarsKeep:33"}, {"direction": "s", "room": "AgatarsKeep:31"}]}, "33": {"index": "33", "name": "On the West Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it. You notice that some of the doors that have", "been sealed with the silver metal have begun to tarnish the metal."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:33", "exits": [{"direction": "n", "room": "AgatarsKeep:34"}, {"direction": "s", "room": "AgatarsKeep:32"}]}, "34": {"index": "34", "name": "On the West Wing of the Keep", "desc": ["\"   You are at the corner of a wide corridor, one side leads east, the", "other south.  A long band of that gleaming silver that is present in", "all the rooms is again present but instead of a single band it is now", "a complex pattern, resembling a triangle, with its point placed opposite", "the corner in the wall  The pattern inside the triangle is immensely", "complex.  The sound of people chanting is even more prevalent here than", "in the rest of the corridor."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:34", "exits": [{"direction": "e", "room": "AgatarsKeep:35"}, {"direction": "s", "room": "AgatarsKeep:33"}]}, "35": {"index": "35", "name": "On the North Wing of the Keep", "desc": ["\"   You are in a wide corridor.  A long band of that gleaming silver", "metal has been laid along the centre of the room.  The glow from the", "metal lights the room sufficiently such that you can see that there are", "many doors leading off the corridor, but that for each a band of the", "silver metal has crossed it. You notice that some of the doors that have", "been sealed with the silver metal have begun to tarnish the metal, no", "longer is pure and unsullied but in parts rusty.  Looking out the", "windows reveals nothing but whiteness all over."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:35", "exits": [{"direction": "e", "room": "AgatarsKeep:20"}, {"direction": "w", "room": "AgatarsKeep:34"}]}, "36": {"index": "36", "name": "On a Landing on the Spiral Staircase", "desc": ["\"   You are in a small dark room.  A spiralling staircase leads both", "up and down but the darkness that pervades this building hides those", "regions from view.  There is a small wooden door, held shut with only", "a small latch, leading out of this room."], "flags": "no_mob, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:36", "exits": [{"direction": "u", "room": "AgatarsKeep:49"}, {"direction": "d", "room": "AgatarsKeep:19"}, {"direction": "10", "room": "AgatarsKeep:37", "keywords": "door"}]}, "37": {"index": "37", "name": "Out on the Upper Floor", "desc": ["\"   You are just outside of the door leading into the central tower.", "You are out on the roof of the keep and yet it still feels enclosed.", "Looking into the sky you can see that there is a strange luminous grey", "to the sky, not light and not dark, just grey.  A strong wind pulls", "at you, twisting around the tower, howling with a sound eerily similar", "to that of a child.  To the west you can see two towers and there is", "a path leading around the tower."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:37", "exits": [{"direction": "w", "room": "AgatarsKeep:42"}, {"direction": "northeast", "room": "AgatarsKeep:38"}, {"direction": "southeast", "room": "AgatarsKeep:40"}, {"direction": "10", "room": "AgatarsKeep:36", "keywords": "door"}]}, "38": {"index": "38", "name": "Out on the Upper Floor", "desc": ["\"   You are just outside of the central tower.  You are out on the roof", "of the keep and yet it still feels enclosed. Looking into the sky you", "can see that there is a strange luminous grey to the sky, not light and", "not dark, just grey.  A strong wind pulls at you, twisting around the", "tower, howling with a strangely lifelike ferocity to it, like a soul in", "torment by the denizens of the lower realms.  To the north you can see", "two towers and there is a path leading around the tower. Your view to", "the south is blocked by the tower."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:38", "exits": [{"direction": "n", "room": "AgatarsKeep:43"}, {"direction": "southeast", "room": "AgatarsKeep:39"}, {"direction": "southwest", "room": "AgatarsKeep:37"}]}, "39": {"index": "39", "name": "Out on the Upper Floor", "desc": ["\"   You are just east of the door leading into the central tower.", "You are out on the roof of the keep and yet it still feels enclosed.", "Looking into the sky you can see that there is a strange luminous grey", "to the sky, not light and not dark, just grey.  A strong wind pulls", "at you, twisting around the tower, howling with a sound eerily similar", "to that of a child.  To the east you can see two towers and there is", "a path leading around the tower.  Your view to the west is blocked by", "the tower but you can just make out some more corner towers from where", "you are standing."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:39", "exits": [{"direction": "e", "room": "AgatarsKeep:44"}, {"direction": "southwest", "room": "AgatarsKeep:40"}, {"direction": "northwest", "room": "AgatarsKeep:38"}]}, "40": {"index": "40", "name": "Out on the Upper Floor", "desc": ["\"   You are just south of the central tower.  You are out on the", "roof of the keep and yet it still feels enclosed. Looking into the sky", "you can see that there is a strange luminous grey to the sky, not light", "and not dark, just grey.  A strong wind pulls at you, twisting around the", "tower, howling with a strangely lifelike ferocity to it, like a soul in", "torment by the denizens of the lower realms.  Both to the north and the", "south you can make out some towers at the corners of the roof but the", "tower in the middle blocks most of the view to the north.  Nearby you can", "see a door leading into one of the towers."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:40", "exits": [{"direction": "s", "room": "AgatarsKeep:41"}, {"direction": "northeast", "room": "AgatarsKeep:39"}, {"direction": "northwest", "room": "AgatarsKeep:37"}, {"direction": "10", "room": "AgatarsKeep:46", "keywords": "tower"}]}, "41": {"index": "41", "name": "Out on the Upper Floor", "desc": ["\"   You are out upon the roof of the keep, from here you can look out", "over the southern battlements.  The view is strange, the grey clouds", "that cover the sky above seem to block the view below too.  Every now", "and then it is possible to grab a view of the land beyond the keep", "and it is horrifying.  The land is ablaze in flame, and yet you can", "see the rocky landscape slowly being submerged in a flow of ice with", "the flames flickering over the ice.  The screams are horrendous and", "a slight scent of cooked meat reaches your nose.  To the north you", "can see the central tower and to either side smaller towers guard the", "corners of the keep.  To the north you can see the entrance to the", "western one."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:41", "exits": [{"direction": "n", "room": "AgatarsKeep:40"}]}, "42": {"index": "42", "name": "Out on the Upper Floor", "desc": ["\"   You are out upon the roof of the keep, from here you can look out", "over the western battlements.  The view is strange, the grey clouds", "that cover the sky above block the view below too.  Occasionally a", "break in the cloud forms and a view of the ocean beyond becomes visible", "but it is not an ocean you remember ever seeing.  The waves are hundreds", "of feet high, smashing against the cliff, the spray reaching as high", "as the keep itself.  The small village at the base of the keep has", "been destroyed almost beyond recognition.  Despite the infrequency", "of the gaps one thing sticks in your mind, the twisted statue at the", "centre of the village is glowing a bright crimson red and dark creatures", "seem to be surrounding it, dancing.  Pulling your eyes from the horrid", "view you can see a small door leading into the north-western tower and", "further to the east a door leading into the central tower itself."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:42", "exits": [{"direction": "e", "room": "AgatarsKeep:37"}, {"direction": "10", "room": "AgatarsKeep:47", "keywords": "tower"}]}, "43": {"index": "43", "name": "Out on the Upper Floor", "desc": ["\"   You are out upon the roof of the keep, from here you can look out", "over the northern battlements.  The view is strange, the grey clouds", "that cover the sky above seem to block the view below too.  Every now", "and then it is possible to grab a view of the land beyond the keep", "and it is horrifying.  The land is ablaze in flame, and yet you can", "see the rocky landscape slowly being submerged in a flow of ice with", "the flames flickering over the ice.  The screams are horrendous and", "a slight scent of cooked meat reaches your nose.  To the south you", "can see the central tower and to either side smaller towers guard the", "corners of the keep.  To your east you can see a small entrance leading", "into one of the towers."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:43", "exits": [{"direction": "s", "room": "AgatarsKeep:38"}, {"direction": "10", "room": "AgatarsKeep:48", "keywords": "tower"}]}, "44": {"index": "44", "name": "Out on the Upper Floor", "desc": ["\"   You are out upon the roof of the keep, from here you can look out", "over the eastern battlements.  The view is strange, the grey clouds", "that cover the sky above block the view below too.  Occasionally a", "break in the cloud forms and a view of the land beyond the tower is", "visible though maybe that is a curse in itself, for the lands beyond", "used be some of the most fertile land in Arandia, but now the land", "is brown and every tree is distorted into shapes that only the", "most evil of devils could admire, and all around blue and red flames", "flicker just over the tree tops.  Tearing your eyes back to the roof", "you can see two towers to either side of you, and a door leads into", "one of them."], "flags": "mapable", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:44", "exits": [{"direction": "w", "room": "AgatarsKeep:39"}, {"direction": "10", "room": "AgatarsKeep:45", "keywords": "tower"}]}, "45": {"index": "45", "name": "Southeast Tower", "desc": ["\"   You are in a little tower, at least when you look around you no", "longer see that luminous grey sky.  The room you are in is small, about", "ten feet by ten, and about six feet tall.  The roof is conical with", "a little hole near the top to let the smoke out.  It must have been", "a cosy place once but now the chairs and tables have all been charred", "and skeletons lies cluttering the corners and the floor.  They lie in", "their armour, their swords undrawn.  The howling of the wind reaches", "in even here, enough to wake the dead."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:45", "exits": [{"direction": "10", "room": "AgatarsKeep:44"}]}, "46": {"index": "46", "name": "The Southwest Tower", "desc": ["\"   You are in a little tower, at least when you look around you no", "longer see that luminous grey sky.  The room you are in is small, about", "ten feet by ten, and about six feet tall. It must have been a cosy place", "once but now the chairs and tables have all been charred and skeletons", "lies cluttering the corners and the floor.  They lie in their armour,", "their swords undrawn.  The howling of the wind reaches in even here,", "enough to wake the dead.  A sort of gunge seems to lie along parts", "of the wall, icky to the touch and foul to the nose."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:46", "exits": [{"direction": "10", "room": "AgatarsKeep:40"}]}, "47": {"index": "47", "name": "The Northwest Tower", "desc": ["\"   You are in a little tower, at least when you look around you no", "longer see that luminous grey sky.  The room you are in is small, about", "ten feet by ten, and about six feet tall. It must have been a cosy place", "once but now the chairs and tables have all been charred and skeletons", "lies cluttering the corners and the floor.  They lie in their armour,", "their swords undrawn.  The howling of the wind reaches in even here,", "enough to wake the dead.  A sort of gunge seems to lie along parts", "of the wall.  Some of the skeletons here do not look as old as the", "others, the armour is different, some scimitars, rapiers as well as the", "ever-fashionable longsword."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:47", "exits": [{"direction": "10", "room": "AgatarsKeep:42"}]}, "48": {"index": "48", "name": "The Northeast Tower", "desc": ["\"   You are in a little tower, dark but enough of the grey light from", "beyond seeps in to make things visible.  The room you are in is small,", "about ten feet by ten, and about six feet tall.  Skeletons lies", "cluttering the corners and the floor.  They lie in their armour, their", "swords undrawn. The howling of the wind reaches in even here, enough to", "wake the dead. The walls are covered in places by a foul-smelling gunge.", "Among the skeletons you can see armour from many different places and", "some of the bones seem to be inhuman, elves and even some orcs, and some", "that are unrecognisable."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:48", "exits": [{"direction": "10", "room": "AgatarsKeep:43"}]}, "49": {"index": "49", "name": "At the Top of the Tower", "desc": ["\"   You are at the top of the central spire of the Keep.  There is a", "simple door leading down to the floors below and four windows, one for", "each of the cardinal directions.  To the north you can see an orange", "glow in the distance, as if a great fire is burning over the horizon,", "a similar view is visible to the south.  To the east you can see the", "great ruins of Lanmyer, destroyed and covered in ice and rock.  To the", "west the great ocean churns in turmoil, huge waves smashing against", "the cliff, throwing spray hundreds of feet into the air.  All around", "you can feel and hear the dark wind that surrounds this place.  In the", "centre of the room a large glowing tetrahedron lies, suspended about", "two feet off the ground by some mysterious means, emitting a dark light", "that throws the room into a strange form of darkness, where the shadows", "are lighter than the rest."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:49", "exits": [{"direction": "d", "room": "AgatarsKeep:36"}]}, "50": {"index": "50", "name": "Beside a Spiralling Staircase", "desc": ["\"   You are at the intersection of two corridors and a stairwell", "leading both up and down.  The corridors are quite wide and you can just", "make out the ends of the north-south corridor but the ends of the other", "corridor are out of sight.  There are many white clad figures walking", "around here, several of them are looking suspiciously un-monkish with", "powerfully muscled arms, heavy armour and long broadswords.  There are", "several runes marked around the stairwell below you, wards to keep", "something at bay but the inscription is too intricate for you to", "decipher anymore."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:50", "exits": [{"direction": "n", "room": "AgatarsKeep:53"}, {"direction": "e", "room": "AgatarsKeep:51"}, {"direction": "s", "room": "AgatarsKeep:56"}, {"direction": "w", "room": "AgatarsKeep:54"}, {"direction": "u", "room": "AgatarsKeep:2"}, {"direction": "d", "room": "AgatarsKeep:88"}]}, "51": {"index": "51", "name": "Along a Brightly Lit Corridor", "desc": ["\"   You are in a wide corridor.  You can see a door leading into a room", "to the south further east and a staircase to the west.  Apart from that", "there is little to be seen or heard, except for the periodic but random", "appearance of some monks.  Some of the monks seem severely stressed and", "tired from something, but the looks on their faces bears no questioning."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:51", "exits": [{"direction": "e", "room": "AgatarsKeep:52"}, {"direction": "w", "room": "AgatarsKeep:50"}]}, "52": {"index": "52", "name": "At the End of the Eastern Corridor", "desc": ["\"   You are at the eastern end of a long corridor.  The glowing bands that", "stream into the room to the south glow very brightly, lighting the", "corridor substantially.  To the far west you can make out a staircase", "but beyond that it gets very dark."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:52", "exits": [{"direction": "w", "room": "AgatarsKeep:51"}, {"direction": "10", "room": "AgatarsKeep:61", "keywords": "door"}]}, "53": {"index": "53", "name": "In A wide Corridor", "desc": ["\"   You are in a wide corridor, there are two large doors on either", "side of you.  The one to the west has been smashed open, the frame", "has splintered but the other one seems fine.  Looking into the room", "to the west you can see several beds and a some figures moving.  There", "is the ever-present bands of metal circling the corridor and walls."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:53", "exits": [{"direction": "s", "room": "AgatarsKeep:50"}, {"direction": "10", "room": "AgatarsKeep:58", "keywords": "broken"}, {"direction": "11", "room": "AgatarsKeep:59", "keywords": "door"}]}, "54": {"index": "54", "name": "West of the Intersection", "desc": ["\"   You are just west of a large staircase that leads back upstairs and", "down to the rooms below.  Nearby you can see a small door leading into", "a room to the south and further west there is another door.  The bands", "of silver metal are rather rusty here, as if not maintained for a long", "time.  There is a small rusty emblem on the door but it has decayed", "beyond recognition.  The light is getting quite poor here and further", "west it is pitch black darkness."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:54", "exits": [{"direction": "e", "room": "AgatarsKeep:50"}, {"direction": "w", "room": "AgatarsKeep:55"}, {"direction": "10", "room": "AgatarsKeep:63", "keywords": "door"}]}, "55": {"index": "55", "name": "At the Darkened End of the Corridor", "desc": ["\"   You are at the western end of the corridor.  It is very dark, if it", "were not for the little light you can provide, you would not be able", "to see even your nose.  The silver metal is visible glowing weakly to", "the east but here is darkness.  The door to the south is open and looks", "withered and old.  The walls are slimy and damp and there is a thin", "layer of green moss or slime growing on the western wall."], "extra": {"keywords": "green wall walls slime moss", "desc": ["\"   The walls are covered in an icky green slimy moss that is growing", "where there is heavy condensation upon the stones.  You can see it", "glisten gentle as your light flickers over it."]}, "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:55", "exits": [{"direction": "e", "room": "AgatarsKeep:54"}, {"direction": "10", "room": "AgatarsKeep:64", "keywords": "door"}]}, "56": {"index": "56", "name": "At the Southern End of the Corridor", "desc": ["\"   You are in a narrow corridor, whole bands of the silver metal stream", "into the room to your east.  The room has no door and you can see that", "is a rather beautifully decorated chapel.  There is a distinct gradation", "in the light, a hint of grayness to the west but blazing whiteness from", "the chapel.  To the north you can see the spiralling staircase leading", "both up and down."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:56", "exits": [{"direction": "n", "room": "AgatarsKeep:50"}, {"direction": "10", "room": "AgatarsKeep:62", "keywords": "door"}]}, "57": {"index": "57", "name": "A Large Dormitory", "desc": ["\"   You are at one end of a long chamber, full of beds.  The beds around", "you are occupied by several fatigued warriors, and yet watching the", "behaviour of the new arrivals, each one says a long prayer before", "sleeping.  Further west you can see that a small altar looks over the", "entire room.  Far to the east a door leads out to the corridor."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:57", "exits": [{"direction": "e", "room": "AgatarsKeep:58"}]}, "58": {"index": "58", "name": "A Large Dormitory", "desc": ["\"   You are at one end of a long chamber, full of beds.  Several of", "the beds are occupied by sleeping figures.  In total the beds must", "total at least two score in number.  The room is lit by a few candles,", "lending a half-light to the room suitable for sleeping.  Every now and", "then someone gets up and leaves while a few others meander in to sleep.", "The room has a peaceful atmosphere though austere."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:58", "exits": [{"direction": "w", "room": "AgatarsKeep:57"}, {"direction": "10", "room": "AgatarsKeep:53", "keywords": "broken"}]}, "59": {"index": "59", "name": "A Small Armoury", "desc": ["\"   You are at the entrance to an armoury.  Several large burly men", "are hammering at the swords.  Looking all around you can see swords,", "scimitars, pikes and even whips.  Each to his own, as the old saying", "goes.  Many of the swords look rusty rather than battered as if they", "have been left out in the weather for years.  To the east you can see", "a small forge, radiating heat.  A small well leads from below, providing", "water for the forge and the kitchens above."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:59", "exits": [{"direction": "e", "room": "AgatarsKeep:60"}, {"direction": "d", "room": "AgatarsKeep:91"}, {"direction": "10", "room": "AgatarsKeep:53", "keywords": "door"}]}, "60": {"index": "60", "name": "The Armoury's Forge", "desc": ["\"   You are near a small forge.  The men here are stripped to their", "waists.  The heat coming from the forge is immense.  The men are working", "on the rusty swords that were so visible near the entrance to the", "armoury.  It is strange how the swords flare blue flame in the forges", "heart and yet remains so cool that the water in which it is doused", "afterwards rarely steams, and still the weapons look like new afterwards.", "The door to the west provides a means to escape the heat and mysteries", "of this forge."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:60", "exits": [{"direction": "w", "room": "AgatarsKeep:59"}]}, "61": {"index": "61", "name": "At the Altar of Goodness", "desc": ["\"   You are at the altar of the chapel.  There is a door to the north", "leading out to the corridors and another door is visible to the west.", "There are several attendants nears the altar, keeping a watch on a large", "array of glowing rods.  All the threads gather into one large bundle", "above the array and flow down, merging with the array itself.  There", "is an immense sense of the power of the light in this room, forcing", "the evil away."], "flags": "indoors, anti_neutral, anti_evil, fast_mana, good_altar", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:61", "exits": [{"direction": "w", "room": "AgatarsKeep:62"}, {"direction": "10", "room": "AgatarsKeep:52", "keywords": "door"}]}, "62": {"index": "62", "name": "A Small Chapel", "desc": ["\"   You are at the back of the chapel.  There are some kneelers laid", "out in front of the altar.  The room is totally inundated with the silver", "metal that is all over this keep.  All the threads seem to lead to a", "large object that lies at the head of the room.  At the head of the", "room you can see some attendants bent down in prayer about the object."], "flags": "indoors, anti_neutral, anti_evil, good_altar", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:62", "exits": [{"direction": "e", "room": "AgatarsKeep:61"}, {"direction": "10", "room": "AgatarsKeep:56", "keywords": "door"}]}, "63": {"index": "63", "name": "An Old Armoury", "desc": ["\"   You are at the entrance to an armoury. Looking all around you can see", "swords, pikes and large axes.  The swords are all twisted and broken.", "Looking at the walls you can see where the silver metal used to run", "but most of it has been destroyed and the seeping slimy damp walls has", "begun to encroach upon the room.  A stairs leading to the prisons below", "is visible at the back of the room, almost hidden by the rubble of old", "weapons and decayed bodies."], "zone": "AgatarsKeep", "room_key": "AgatarsKeep:63", "exits": [{"direction": "10", "room": "AgatarsKeep:54", "keywords": "door"}, {"direction": "11", "room": "AgatarsKeep:90", "keywords": "stairs"}]}, "64": {"index": "64", "name": "The Blacksmith's Furnace", "desc": ["\"   You are in a dark room, the dampness on the walls has grown to such", "a degree that the slimy moss protrudes from the wall in sickly like", "growths, maybe your eyes are deceiving you but it looks like its moving.", "The room itself used to be a blacksmiths forge.  You can see the great", "furnace, the bellows and several other tools of the trade.  Several", "swords that were left uncompleted by the last inhabitant are now rusted", "and twisted beyond use.  The room is cold and shivery."], "extra": {"keywords": "furnace forge", "desc": ["\"   Looking into the furnace you can see where the coals have shifted", "and a shaft leading down to the floors below has opened.  It looks", "narrow but there should be no problem in getting down if you feel", "up to it."]}, "zone": "AgatarsKeep", "room_key": "AgatarsKeep:64", "exits": [{"direction": "d", "room": "AgatarsKeep:89", "info": "hidden"}, {"direction": "10", "room": "AgatarsKeep:55", "keywords": "door"}, {"direction": "11", "room": "AgatarsKeep:89", "info": "hidden", "keywords": "furnace"}]}, "65": {"index": "65", "name": "At a Slime Covered Stairwell", "desc": ["\"   You are at an intersection of several corridors.  A stairs leads up", "to the floors above but there is a strange glow about the top of the", "stairs.  The floor seems to slope gently towards the south-west, as", "if the part of the castles foundations have given way.  The moss is so", "thick here that you can only make out the first few yards of each", "corridor and not much else.  The floor is covered in a light covering", "of ichor and goo which makes walking very difficult."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:65", "exits": [{"direction": "n", "room": "AgatarsKeep:69"}, {"direction": "e", "room": "AgatarsKeep:66"}, {"direction": "s", "room": "AgatarsKeep:74"}, {"direction": "w", "room": "AgatarsKeep:71"}, {"direction": "u", "room": "AgatarsKeep:88"}]}, "66": {"index": "66", "name": "Along A Slime and Moss Covered Corridor", "desc": ["\"   You are in a long corridor.  Long strands of slimy moss hang across", "the corridor.  A way is broken through the moss to the east and it is", "clear enough to the west so that you can make out a stairwell leading", "up to the floors above.  The green light of the moss throws faint", "shadows in the distance.  The moss blocks viewing for any reasonable", "distance and a particularly large and thick clump of moss has grown", "on the southern wall.  The wall is so slimy here that the floor is", "covered in a layer of sodden, decaying moss."], "extra": {"keywords": "moss wall clump", "desc": ["\"   Looking closely at the clump you can see that it is gathered around", "a closed door, leading a room to the south.  This door is unusual,", "unlike the others here, it is not tarnished or damaged in any way, just", "covered by this over-abundant moss."]}, "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:66", "exits": [{"direction": "e", "room": "AgatarsKeep:67"}, {"direction": "w", "room": "AgatarsKeep:65"}, {"direction": "10", "room": "AgatarsKeep:84", "info": "door, closed, autoclose", "keywords": "door"}]}, "67": {"index": "67", "name": "Along A Slime and Moss Covered Corridor", "desc": ["\"   You are in a long corridor.  Long strands of slimy moss are slung", "across the corridor.  A way is broken through the moss to the east but", "the way west is so thick as to be more a forest than a castle.  The", "moss shimmers with a green light which seems to follow your movements.", "The green light is not strong enough to light your way but strong enough", "to throw moving shadows in the distance.  The moss blocks viewing for", "any reasonable distance and if the door to the south were not at your", "very hand you could have easily missed it in the moss.  The door has", "been smashed apart but a sheet of hanging moss blocks the way."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:67", "exits": [{"direction": "e", "room": "AgatarsKeep:68"}, {"direction": "w", "room": "AgatarsKeep:66"}, {"direction": "10", "room": "AgatarsKeep:82", "keywords": "door"}]}, "68": {"index": "68", "name": "Along A Slime and Moss Covered Corridor", "desc": ["\"   You are at the eastern end of the corridor.  It is very dark, if it", "were not for the little light you can provide, you would not be able", "to see even your nose.  The door to the north is open and looks", "withered and old.  Looking inside you can see an orange glow but this", "just highlights that the walls near you are slimy and damp and there is", "a thick layer of green moss or slime growing not only on the walls but", "the floor and the ceiling.  The ominous green light that the slime", "emits only heightens the darkness."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:68", "exits": [{"direction": "w", "room": "AgatarsKeep:67"}, {"direction": "10", "room": "AgatarsKeep:81", "keywords": "door"}]}, "69": {"index": "69", "name": "A Horrid Smelling Narrow Corridor", "desc": ["\"   You are in a narrow corridor. The slimy moss is thin enough that you", "can still see the stairwell to the south and a door into a room to", "the north.  The green light of the moss throws faint shadows in the", "distance.  The walls near you are slimy and damp and there is", "a thick layer of green moss or slime growing not only on the walls but", "the floor and the ceiling.  The ominous green light that the slime", "emits only heightens the darkness."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:69", "exits": [{"direction": "n", "room": "AgatarsKeep:70"}, {"direction": "s", "room": "AgatarsKeep:65"}]}, "70": {"index": "70", "name": "A Horrid Smelling Narrow Corridor", "desc": ["\"   You are at the northern end of a narrow corridor.  A strong door", "lies to the west, barely visible through the clumping of the moss.", "You try to shake of the feeling that the moss is watching you, but", "to no avail.  At your feet you can see the remains of some knightly", "armour, the once proud blade rusting visibly in spots, the owner of", "the armour now gone, but the bloodstains testament to his fate.  The", "blade of the sword jams open the door, the fallen warriors last act"], "extra": {"keywords": "armour armor sword", "desc": ["\"   The armour seems to be relatively old, the only mark that is still", "visible is that of a large letter A and M, entwined together, engraved", "in the hilt of the sword.  The sword is a longsword, quite thick for", "its type.  It has been wedged into the jam of the door, preventing the", "door from shutting fully."]}, "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:70", "exits": [{"direction": "s", "room": "AgatarsKeep:69"}, {"direction": "10", "room": "AgatarsKeep:78", "keywords": "door"}]}, "71": {"index": "71", "name": "A Dense Slime Forest", "desc": ["\"   The slime covering the floor has grown into a massive carpet that", "sucks your feet even deeper.  The walls are now indistinguishable from", "the slime, replaced by the hard knots of roots.  To the east you", "can make out a stairwell but it is hard to keep a view open with all", "the hanging slime.  The corridor becomes even more densely crowded", "to the west."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:71", "exits": [{"direction": "e", "room": "AgatarsKeep:65"}, {"direction": "w", "room": "AgatarsKeep:72"}]}, "72": {"index": "72", "name": "A Dense Slime Forest", "desc": ["\"   You are along a slime covered corridor.  A door is visible through", "the slime, leading into a room to the north.  The door is unable to", "be shut as the slime roots have dammed the hinges.  You notice that", "the damp stone is turning from a granite like stone to something more", "closely resembling basalt, a dark sinister rock which seems to be", "more damp and liquid than the water flowing over it."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:72", "exits": [{"direction": "e", "room": "AgatarsKeep:71"}, {"direction": "w", "room": "AgatarsKeep:73"}, {"direction": "10", "room": "AgatarsKeep:77", "keywords": "door"}]}, "73": {"index": "73", "name": "A Basalt Rock Corridor", "desc": ["\"   You are the end of the corridor.  It is amazing, there is no slime", "here and the black walls are totally dry, even the air is totally dry", "and a little bit warm.  A door leads into a room in the south but it", "is a strange door, wooden yet different.  Looking east you can see a", "massive curtain of slime about four feet away from the door, burnt", "and sintered at the border."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:73", "exits": [{"direction": "e", "room": "AgatarsKeep:72"}, {"direction": "10", "room": "AgatarsKeep:85", "keywords": "door"}]}, "74": {"index": "74", "name": "A Water-Covered Corridor", "desc": ["\"   You are just south of the stairwell.  In the faint light of the", "slime you can just make out the spiral of the staircase.  Another", "feature in this slime-filled, feet soaking, damp corridor is a door", "rusty and creaking, you couldnt open this door, but due to its decayed", "nature there is a hole in the centre of the door sufficient for you", "to step through it."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:74", "exits": [{"direction": "n", "room": "AgatarsKeep:65"}, {"direction": "s", "room": "AgatarsKeep:75"}]}, "75": {"index": "75", "name": "A Water-Covered Corridor", "desc": ["\"   You are at the southern end of the corridor.  There is a stairs", "here with some runes inscribed on the first few steps.  The water here", "has pooled and is several inches thick.  Some things are moving in", "the water, just below the surface, bumping against your boots.  The", "light from the room above escapes down the stairs, just to be suffocated", "by the darkness about you, but is sufficient to show the masses of", "green slime clinging to the walls."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:75", "exits": [{"direction": "n", "room": "AgatarsKeep:74"}, {"direction": "10", "room": "AgatarsKeep:87", "keywords": "door"}, {"direction": "11", "room": "AgatarsKeep:90", "keywords": "stairs"}]}, "76": {"index": "76", "name": "A Strange Guard's Room", "desc": ["\"   You are in a large room, the benches are thrown everywhere.  Looking", "down the hall you can see benches thrown everywhere.  Behind you there", "is a row of large beer barrels.  You knock on the sides of them, most", "are empty but one seems to be full and in working condition.  From", "here you can see two doors leading from the room, one leading south", "the other to the east."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:76", "exits": [{"direction": "e", "room": "AgatarsKeep:77"}]}, "77": {"index": "77", "name": "A Strange Guard's Room", "desc": ["\"   You are surrounded by loads of benches, several of which have been", "overturned, the beer mugs lying on the floor.  Among the benches you", "can see the bleached bones of the guards, their skeletons sticking out", "from their metal cases.  The door to the south has a solid slime growth", "around its edges but seems to be make little progress into the room.", "There is a haunting feeling about this room that is definitely", "uncomfortable."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:77", "exits": [{"direction": "e", "room": "AgatarsKeep:78"}, {"direction": "w", "room": "AgatarsKeep:76"}, {"direction": "10", "room": "AgatarsKeep:72", "keywords": "door"}]}, "78": {"index": "78", "name": "A Strange Guard's Room", "desc": ["\"   You are at the eastern end of a large common room.  There are two", "piles of bones near the door, with a tankard of beer lying nearby.", "There is a small clear area, or rather originally clear, the slime from", "the corridor outside is slowly making inroads into the room.  The room", "is a picture of pandemonium, the tables are overturned, lockers have", "been toppled and everywhere bleached skeletons lie where they'd fallen."], "flags": "dark", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:78", "exits": [{"direction": "w", "room": "AgatarsKeep:77"}, {"direction": "10", "room": "AgatarsKeep:70", "keywords": "door"}]}, "79": {"index": "79", "name": "The Well Room", "desc": ["\"   You are in a room which has at its centre a large well.  Peering", "into the well you can see that it extends down quite a distance.  A", "strange eerie glow echoes up the shaft.  Looking up you can see a hole", "in the roof where the kitchens above could drop a bucket into the well", "whenever water was needed.  The stonework in the room is quite ornate,", "with pictures of children dancing engraved about the lip of the well.", "The room is refreshingly cool."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:79", "exits": [{"direction": "u", "room": "AgatarsKeep:91"}, {"direction": "10", "room": "AgatarsKeep:80", "keywords": "door"}]}, "80": {"index": "80", "name": "An Old Treasury Room", "desc": ["\"   You are in a treasury room.  There are piles of chests and bags of", "gold stuck into a corner.  The room has a slight growth of slime, but", "the monks are fighting it with good old-fashioned fire.  The whole", "room is covered in flame.  It seems to be doing a good job on the slime", "but the slime is seeping in as fast as it is being burnt."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:80", "exits": [{"direction": "e", "room": "AgatarsKeep:81"}, {"direction": "10", "room": "AgatarsKeep:79", "keywords": "door"}]}, "81": {"index": "81", "name": "An Old Treasury Room", "desc": ["\"   You are in a treasury room.  There are piles of chests and bags of", "gold stuck into a corner. The whole room is covered in flame.  It seems", "to be doing a good job on the slime but the slime is seeping in as fast", "as it is being burnt.  Several of the monks are making their way through", "the door to the south but only for short periods at a time, and they", "always come back tired and covered in that icky slime."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:81", "exits": [{"direction": "w", "room": "AgatarsKeep:80"}, {"direction": "10", "room": "AgatarsKeep:68", "keywords": "corridor"}]}, "82": {"index": "82", "name": "Some Servant's Quarters", "desc": ["\"    You are in the old servants quarters.  The room is very small,", "with two halves in it.  The section that you are in at the moment has", "a small table and four chairs.  All slightly withered and kind of", "feeble.  The room is very tight with the chairs and tables that are", "here.  A small partition divides the rest of the room from view."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:82", "exits": [{"direction": "e", "room": "AgatarsKeep:83"}, {"direction": "10", "room": "AgatarsKeep:67", "keywords": "door"}]}, "83": {"index": "83", "name": "A Silent Bedroom", "desc": ["\"   You are in the bedroom.  There are four beds here, each with a bundle", "of bones under the clothes, whatever happened to them hit them all", "very quickly.  In one pile you can see a mother with her child in her", "grasp, obviously sleeping peacefully together before the end.  The room", "is very silent and it seems right for the room to be so."], "extra": {"keywords": "_teleport", "desc": ["A sense of sadness sweeps over you at the sight of the burnt", "bones of the child, wrapped in the arms of its mother."]}, "flags": "dark, no_mob, indoors", "tele": "25, 0, 83", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:83", "exits": [{"direction": "w", "room": "AgatarsKeep:82"}]}, "84": {"index": "84", "name": "A Dark Place", "desc": ["\"   You are in a dark room.  It is covered in slime, forming a near", "perfect globe about the centre of the room.  In the centre a tough", "bark-like growth from the floor holds a solid black object, a perfect", "sphere that gleams in the darkness.  A certain rich darkness pervades", "the room, surrounding you with voices from the depths of the earth", "and from behind the barrier of death."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:84", "exits": [{"direction": "10", "room": "AgatarsKeep:66"}]}, "85": {"index": "85", "name": "Old Prison Cells", "desc": ["\"   You are in a dark room, a shimmering column of dark light looms", "over a large shaft in the middle of the room, to the east.  This room is", "barren and covered in a dark dust.  There is nothing on this side of", "the room, except for a few small piles of dust in the corner."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:85", "exits": [{"direction": "u", "room": "AgatarsKeep:89"}, {"direction": "10", "room": "AgatarsKeep:73", "keywords": "door"}, {"direction": "11", "room": "AgatarsKeep:86", "keywords": "light"}]}, "86": {"index": "86", "name": "A Strange Light", "desc": ["\"   You are in a strange light, it is freezing here.  In here with you", "is a figure of a man, not clear and yet present.  From here you can", "see part of the underworld, a hazy place, dark and full of strange", "figures, creatures you've never seen before.  Looking out at the room", "that you've just left it looks very different, you can see people", "working, digging a large shaft down, you can see the gates being taken", "off the prison cells, the view shifts, you can see a young man looking", "down into the shaft and suddenly a shaft of dark light trapping him", "and the entire image shifts once more and the darkness and slime seeps", "out of the shaft.  The image begins to cycle over and over and over.."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:86", "exits": [{"direction": "e", "room": "AgatarsKeep:87"}, {"direction": "w", "room": "AgatarsKeep:85"}]}, "87": {"index": "87", "name": "Old Prison Cells", "desc": ["\"   You are just inside of the door leading back out to the corridor.", "The corridors outside were bad but in here the slime is everywhere,", "visibly alive.  In the centre of the room there is something glowing", "with a fierce light.  There is no way to make out what purpose this", "room has but it mustve been at least partly a prison cell, you can", "see the doors lying against one wall."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:87", "exits": [{"direction": "10", "room": "AgatarsKeep:75", "keywords": "door"}, {"direction": "11", "room": "AgatarsKeep:86", "keywords": "light"}]}, "88": {"index": "88", "name": "Upon the Steps of A Staircase", "desc": ["\"   You are at the intersection of two corridors and a stairwell", "leading both up and down.  The corridors are quite wide and you can just", "make out the ends of the north-south corridor but the ends of the other", "corridor are out of sight.  There are many white clad figures walking", "around here, several of them are looking suspiciously un-monkish with", "powerfully muscled arms, heavy armour and long broadswords.  There are", "several runes marked around the stairwell below you, wards to keep", "something at bay but the inscription is too intricate for you to", "decipher anymore."], "flags": "no_mob, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:88", "exits": [{"direction": "u", "room": "AgatarsKeep:50"}, {"direction": "d", "room": "AgatarsKeep:65"}]}, "89": {"index": "89", "name": "In a Dark Tunnel", "desc": ["\"   You are in a dark tunnel between the forge above and the floor", "below.  It is very dark but fortunately short."], "flags": "dark, indoors, anti_good, anti_neutral", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:89", "exits": [{"direction": "u", "room": "AgatarsKeep:64", "info": "hidden"}, {"direction": "d", "room": "AgatarsKeep:85"}]}, "90": {"index": "90", "name": "Upon a Narrow Winding Stairs", "desc": ["\"   You are on a narrow winding stairs.  The steps are worn and", "loose and are covered in a slimy goo.  The slime gets worse as", "the steps descend.  It is very dark but you can see the slime", "moves as it emitts a faint phosphorescent glow, but the glow", "more disturbs than comforts in this darkness.  It is not", "far either to the top or the bottom of the stairwell."], "flags": "dark, indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:90", "exits": [{"direction": "u", "room": "AgatarsKeep:63"}, {"direction": "d", "room": "AgatarsKeep:75"}]}, "91": {"index": "91", "name": "On A Rope between Floors", "desc": ["\"   You are on a strong rope leading down to the well-room below", "and the kitchens and armoury above."], "flags": "indoors", "zone": "AgatarsKeep", "room_key": "AgatarsKeep:91", "exits": [{"direction": "u", "room": "AgatarsKeep:59"}, {"direction": "d", "room": "AgatarsKeep:79"}]}}}