{"zone": "Bandits_Run", "rooms": {"1": {"index": "1", "name": "The Giant Statue", "desc": ["\"   You see a stopping place along the road, where weary travellers are", "sleeping and chatting beneath the shadow of a tall statue.  It seems quite", "peaceful here, as a calm, warm breeze blows in from the north.  You hear", "the sounds of a busy city farther to the north, but even those sounds", "are soft echoes upon your ears.  There are several wooden cots and chairs", "scattered about a stone platform built into the side of the road where you", "might rest for awhile.  The jungle road continues north and south from here."], "sector": "Forest", "extra": {"keywords": "statue", "desc": ["\"   The statue is that of a legendary sun giant, which is said to be a good", "omen.  The creature faces the south in a protective combat position.", "Visitors here mumble that they have heard of such creatures existing", "somewhere in the northern mountains."]}, "flags": "peaceful, nosteal, no_sum, no_magic, fast_moves", "zone": "Bandits_Run", "room_key": "Bandits_Run:1", "exits": [{"direction": "n", "room": "Bandits_Run:2"}, {"direction": "s", "room": "Bandits_Run:3"}]}, "2": {"index": "2", "name": "Bandit's Run", "desc": ["\"   You are standing upon an old dirt road, that winds its way to the south", "through dense jungle.  A few passers by mutter curses about bandits that", "litter the road along the way to Phul's Choice.  A large stone bridge", "stands proudly to the north.  You hear the sounds of many strange animals", "hooting and roaring towards the south.  The road here does not appear to be", "well maintained, and you see from its earthen surface that it does not", "appear to be well travelled either."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:2", "exits": [{"direction": "n", "room": "WildernessMidgardSouth:45"}, {"direction": "s", "room": "Bandits_Run:1"}]}, "3": {"index": "3", "name": "The Jungle Ambush", "desc": ["\"   You see a spot in the road where several trees have been cut down,", "blocking access for carts and wagons.  In fact, an old carriage sits here", "turned upon its side, with royal markings painted on its wooden surfaces.", "This appears to be a place where bandits trapped a wealthy caravan,", "pilfering everything before burning the carts and carriage.  All of the", "items here are useless, as they have been scorched and riddled with arrows.", "The road continues north and southeast from here."], "sector": "Forest", "extra": {"keywords": "royal markings", "desc": ["\"   This appears to have been a member of one of the lesser royal houses", "of Arador."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:3", "exits": [{"direction": "n", "room": "Bandits_Run:1"}, {"direction": "southeast", "room": "Bandits_Run:4"}]}, "4": {"index": "4", "name": "The Fallen Guard", "desc": ["\"   It is quite hot here, as you walk along the dirt road through the jungle.", "A mass of abandoned wooden objects sits in the road further to the north.", "You see a rusty set of useless royal guard armor here, half covered by", "dirt and moss.  It seems that a guard was defending someone here long ago.", "He appears to have etched something into a nearby tree stump before dying", "on the road.  The twisting roadway continues northwest and southeast from", "here, its destination lost in the dense jungle growth."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:4", "exits": [{"direction": "southeast", "room": "Bandits_Run:5"}, {"direction": "northwest", "room": "Bandits_Run:3"}]}, "5": {"index": "5", "name": "The Panther's Curve", "desc": ["\"   You hear the roars of large jungle cats nearby, as they seem to be", "stalking something in the jungle... perhaps you?  You see several tall,", "moss-covered trees growing along the road, with long green vines dangling", "down to the jungle floor.  Small monkeys dart about from limb to limb upon", "the high branches.  The road you are standing upon winds southeast and", "northwest from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:5", "exits": [{"direction": "southeast", "room": "Bandits_Run:6"}, {"direction": "northwest", "room": "Bandits_Run:4"}]}, "6": {"index": "6", "name": "A Branch In The Road", "desc": ["\"   The road takes a sharp turn here, as it winds around an ancient totem", "pole set in a clump of trees.  There is a smaller path heading off towards", "the east, that appears to lead to some kind of small farm.  You see a couple", "of primitive buildings there.  The road bends south and northwest from here.", "The totem pole is covered with vines and moss, apparently an ancient stone", "relic."], "sector": "Forest", "extra": [{"keywords": "buildings small farm"}, {"desc": "  \"   It is a tiny farming system, that looks to be managed by peasants."}, {"keywords": "totem pole"}, {"desc": ["\"   The pole has shapes of demons carved into the stone surfaces.  It appears", "to be some kind of warding obilisk."]}], "zone": "Bandits_Run", "room_key": "Bandits_Run:6", "exits": [{"direction": "e", "room": "Bandits_Run:8"}, {"direction": "s", "room": "Bandits_Run:7"}, {"direction": "northwest", "room": "Bandits_Run:5"}]}, "7": {"index": "7", "name": "A Winding Road", "desc": ["\"   The road continues to wind through the jungle here, as it is almost", "covered by the undergrowth.  Exotic birds sing odd songs high in the trees,", "being your only companions here.  The bushes and ferns along the road are", "dripping wet, betraying the amount of heavy rainfall that cascades here", "much of the time.  The road bends onwards north and southeast from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:7", "exits": [{"direction": "n", "room": "Bandits_Run:6"}, {"direction": "southeast", "room": "Bandits_Run:12"}]}, "8": {"index": "8", "name": "A Small Farm", "desc": ["\"   You are standing at the edge of a small farm.  A barn lies to the north,", "a small hut to the south, and a wide field sits to the east.  This seems", "to be a peaceful place, carved out of a clearing in the dense jungle.  You", "smell roasting chickens coming from the humble home south of you.  A small", "trail leads back to the main road to the west."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:8", "exits": [{"direction": "n", "room": "Bandits_Run:10"}, {"direction": "e", "room": "Bandits_Run:9"}, {"direction": "s", "room": "Bandits_Run:11"}, {"direction": "w", "room": "Bandits_Run:6"}]}, "9": {"index": "9", "name": "An Open Field", "desc": ["\"   You stand within a field of tall wheat stalks, growing in a clearing.", "Dense jungle surrounds you in every direction except the west, where some", "small farm building sit.  Smoke pours out of the tiny farm house there,", "evidence that someone has been living here.  This field seems to be the", "residents primary commodity, save for the sounds of animals coming from", "the barn."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:9", "exits": [{"direction": "w", "room": "Bandits_Run:8"}]}, "10": {"index": "10", "name": "A Primitive Barn", "desc": ["\"   This barn seems to house the livestock of the tiny farm.  The animals", "do not appear to be well cared for, as many of them are sick and dying.", "A few cattle lie in the dirt, apparently starving to death.  You wonder", "what has become of their masters.  A large doorway leads back outside to", "the south."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:10", "exits": [{"direction": "s", "room": "Bandits_Run:8"}]}, "11": {"index": "11", "name": "A Small Farm House", "desc": ["\"   You see a horrible sight here.  The farming family that lived here has", "been attacked by bandits, who have ransacked the tiny home, and killed", "everyone while they had been eating a meal.  Blackened chicken is still", "roasting upon the the primitive stove, making a cloud of smoke in the", "room.  Everything here has been demolished and left in ruin, as the pioneer", "family has paid a high price for their courage.  An exit lies north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:11", "exits": [{"direction": "n", "room": "Bandits_Run:8"}]}, "12": {"index": "12", "name": "The Bandit's Run", "desc": ["\"   It seems clear how this road gets its name- bandit's run, as you see", "the rotting bodies of hapless travellers who were left for dead in the", "jungle alongside the road.  They appear to have been backstabbed and", "looted, their killers not even bothering to move the bodies beyond the", "sight of the thoroughfare.  The road twists south and northwest from", "here."], "sector": "Forest", "extra": {"keywords": "bodies", "desc": ["\"   They appear to be merchants, who were on their way to Arador to the", "north, some time ago."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:12", "exits": [{"direction": "s", "room": "Bandits_Run:13"}, {"direction": "northwest", "room": "Bandits_Run:7"}]}, "13": {"index": "13", "name": "The Twisting Road", "desc": ["\"   You are standing upon a dirt road, that creeps long north and southeast", "through the jungle.  It is quite hot and humid here, making travel quite", "uncomfortable.  The thick undergrowth and tall trees prevent you from", "seeing very far ahead, limiting your readiness for mysteries that may be", "there.  In all directions you are greeted by the roars and cries of the", "jungle beasts thriving in this tropical haven."], "sector": "Forest", "extra": {"keywords": "road", "desc": "  \"   It appears that small wagons have travelled through here recently."}, "zone": "Bandits_Run", "room_key": "Bandits_Run:13", "exits": [{"direction": "n", "room": "Bandits_Run:12"}, {"direction": "s", "room": "Bandits_Run:14"}]}, "14": {"index": "14", "name": "The Twisting Roadside", "desc": ["\"   You stop here, on the road, as you hear whispering voices beyond the", "roadside to the west.  Whoever it is, they seem confident enough to be", "tracking you while giving away their presence.  Turning towards the east,", "you see cloaked figures dashing amongst the trees and ferns.  The", "undergrowth is too thick here to pursue them.  The road continues north", "and south from here."], "sector": "Forest", "extra": {"keywords": "cloaked figures", "desc": "  \"   It's too late, they have already hidden themselves from your view."}, "zone": "Bandits_Run", "room_key": "Bandits_Run:14", "exits": [{"direction": "n", "room": "Bandits_Run:13"}, {"direction": "s", "room": "Bandits_Run:15"}]}, "15": {"index": "15", "name": "The Overgrown Road", "desc": ["\"   The road narrows here a bit, as the jungle undergrowth has extended", "outwards almost covering it from view.  Further to the southeast, you see", "a wooden bridge.  Travel is slow here as you step over the ferns and small", "plants.  Odd purple mushrooms are growing here as well, giving off a foul", "odor.  You can proceed north and southeast from here."], "sector": "Forest", "extra": {"keywords": "odd purple mushroom mushrooms", "desc": "\"   They appear to be poisonous.  You almost feel sleepy being around them."}, "zone": "Bandits_Run", "room_key": "Bandits_Run:15", "exits": [{"direction": "n", "room": "Bandits_Run:14"}, {"direction": "southeast", "room": "Bandits_Run:16"}]}, "16": {"index": "16", "name": "The Rotting Bridge", "desc": ["\"   You are standing upon an old rotting bridge, which crosses over a small", "creek flowing through the jungle from the north east.  The bridge is pin-", "cushioned with several arrows from a recent attack.  Looking below, you see", "a human body floating in the stream, which has been looted and backstabbed.", "The bridge crosses over to the south, and the main road continues northwest", "from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:16", "exits": [{"direction": "s", "room": "Bandits_Run:17"}, {"direction": "northwest", "room": "Bandits_Run:15"}]}, "17": {"index": "17", "name": "A Wide Clearing", "desc": ["\"   You are standing within a wide clearing which contains a circle of strange", "looking trees.  The Bandit's Run highway continues south from here, and an", "old bridge sits to the north.  Small animals scurry out of sight at your", "approach, running into the thick green undergrowth.  The odd trees here are", "pink in color, and have deep red leaves."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:17", "exits": [{"direction": "n", "room": "Bandits_Run:16"}, {"direction": "s", "room": "Bandits_Run:18"}]}, "18": {"index": "18", "name": "The Winding Dirt Road", "desc": ["\"   The old dirt road continues on here, winding through the ferns and tall", "vegetation of the dark green jungle.  The sounds of buzzing insects can be", "heard from every direction, and you stop occasionally to swat them away from", "your face.  Your feet splash through small puddles, that have been created", "here from the overflow of a nearby creek.  You can proceed north and south-", "east from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:18", "exits": [{"direction": "n", "room": "Bandits_Run:17"}, {"direction": "southeast", "room": "Bandits_Run:19"}]}, "19": {"index": "19", "name": "The Odd Trail", "desc": ["\"   Over to the northeast you see a large hole which has been dug into the", "ground, with large piles of dirt accumulated around it.  You see the many", "footprints of travellers and animals which seem to have wandered over to the", "pit.  The old road continues on its way from here, however, winding onwards", "northwest and south through the jungle."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:19", "exits": [{"direction": "s", "room": "Bandits_Run:20"}, {"direction": "northwest", "room": "Bandits_Run:18"}]}, "20": {"index": "20", "name": "The Canopy", "desc": ["\"   The trees and foilage above you have blocked your view of the sky here.", "You are moving along a dirt road that makes its lonely way through the", "dense jungle region here, south of Arador.  Small shadowy creatures are", "chattering above you, binding vines and tree branches together to form a", "kind of canopy in the treetops.  You may proceed north and south along the", "road."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:20", "exits": [{"direction": "n", "room": "Bandits_Run:19"}, {"direction": "s", "room": "Bandits_Run:21"}]}, "21": {"index": "21", "name": "The Road", "desc": ["\"   Off to the west of here, you see a small stone tower, which appears", "quite out of place in the green jungle vegetation surrounding it.  Your", "feet slosh through the mud of the winding road, which extends north and", "south deeper into the tropical jungle.  The calls of large jungle cats can", "be heard in the distance towards the north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:21", "exits": [{"direction": "n", "room": "Bandits_Run:20"}, {"direction": "s", "room": "Bandits_Run:26"}, {"direction": "w", "room": "Bandits_Run:22"}]}, "22": {"index": "22", "name": "The Tower", "desc": ["\"   You are standing before a rock hewn tower, which stands thirty feet tall", "into the towering jungle trees above.  It appears to be quite ancient and", "forbidding looking.  Gazing before it, you sense that it is quite old, and", "performed a function here that might even predate the tropical jungle", "which cloaks it from most observers.  Back towards the east, you see a dirt", "road through the underbrush."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:22", "exits": [{"direction": "e", "room": "Bandits_Run:21"}, {"direction": "10", "room": "Bandits_Run:23", "keywords": "archway"}]}, "23": {"index": "23", "name": "The Base of The Tower", "desc": ["\"   You are standing within the walls of a tall tower.  Outside the arrow", "slit windows, you see the thick vegetation of a jungle area.  Stone stairs", "lead upwards into darkness, where you hear odd screeching sounds echoing", "off the walls.  Before you sits a wide stone table, with arcane instruments", "of ancient rituals sitting upon its cobwebbed surface.  A door leads back", "outside through an archway."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:23", "exits": [{"direction": "u", "room": "Bandits_Run:24"}, {"direction": "10", "room": "Bandits_Run:22", "keywords": "archway"}]}, "24": {"index": "24", "name": "The Middle Chamber", "desc": ["\"   Here is the middle floor of the ancient tower.  Stairs lead up further", "into the darkness, and back down into the brighter entry hall.  The floors", "are cold and wet here, offering you some relief from the relentless jungle", "heat outside.  Odd paintings adorn the walls here of burning creatures", "coming up from the underworld to destroy the surface dwellers.  Dangling", "spiderwebs are everywhere in this chamber."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:24", "exits": [{"direction": "u", "room": "Bandits_Run:25"}, {"direction": "d", "room": "Bandits_Run:23"}]}, "25": {"index": "25", "name": "Upper Chamber", "desc": ["\"   You are within the dark and dreadful upper chambers of the ancient tower.", "Something terrible has been living here for some time, as you see the half", "eaten bones of ill-fated travellers who ventured into this doomed structure.", "From the look of the thick webs, you guess that this must be the home of a", "large spider-like creature.  Its sticky trappings are everywhere in the", "chamber, including some cocooned victims in a nearby corner.  The only way", "out of here is back down the stone staircase."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:25", "exits": [{"direction": "d", "room": "Bandits_Run:24"}]}, "26": {"index": "26", "name": "The Twisting Road", "desc": ["\"   You are walking along a twisting road that bends around between the tall", "tropical trees of the jungle.  Off to the northwest, you hear terrifying", "cries of pain and torment, as someone has met with an uncomfortable fate.", "The road is muddy and well travelled here.  Footprints along the ground are", "consistent with the leather boots worn by the jungle bandits through this", "area.  You can continue along the road north and southwest."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:26", "exits": [{"direction": "n", "room": "Bandits_Run:21"}, {"direction": "southwest", "room": "Bandits_Run:27"}]}, "27": {"index": "27", "name": "The Screeching Birds", "desc": ["\"   The sounds of tropical birds, screeching in the trees assails your ears", "as it seems that they have been startled by something moving through the", "jungle beneath them.  Large flocks of startled foul launch off towards the", "north.  The road continues northeast and south from here.  You almost trip", "over the small stones scattered in the dirt."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:27", "exits": [{"direction": "s", "room": "Bandits_Run:28"}, {"direction": "northeast", "room": "Bandits_Run:26"}]}, "28": {"index": "28", "name": "The Odd Stone", "desc": ["\"   Before you, in the center of the muddy twisting road, is a large round", "stone, standing taller than a human off the ground.  It seems that is has", "fallen from some great distance, making a rough crater in the road.  Its", "surfaces are grey and dull, but smooth.  You wonder where it could have", "come from, looking very out of place in these rich green surroundings.", "You can slide by it, heading north or southwest from here."], "sector": "Forest", "extra": {"keywords": "large round stone", "desc": ["\"   It is very cold to the touch, and as you stand in its presence, you", "get an eerie sense that something is alive inside of it."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:28", "exits": [{"direction": "n", "room": "Bandits_Run:27"}, {"direction": "southwest", "room": "Bandits_Run:29"}]}, "29": {"index": "29", "name": "A Dirt Road", "desc": ["\"   You are moving along a jungle road that winds through the swaying vines", "and tall trees.  The sky is almost blocked from view by the foliage above,", "giving you an uncomfortable feeling that the trees are closing in around", "you.  The dirt road bends northeast and southwest from here.  The cries", "of wild birds can be heard coming from the north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:29", "exits": [{"direction": "northeast", "room": "Bandits_Run:28"}, {"direction": "southwest", "room": "Bandits_Run:30"}]}, "30": {"index": "30", "name": "A Gruesome Scene", "desc": ["\"   Dead animals litter the road here, as clumsy hunters seem to have left", "these carcasses here to rot on the roadside.  The helpless creatures seem", "to have been killed at random, broken, skinned, and yet their pelts remain", "close by, rotting in the dirt.  You hear insane laughter coming from the", "south as you stoop over the small animals' bodies.  The road bends northeast", "and south from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:30", "exits": [{"direction": "s", "room": "Bandits_Run:31"}, {"direction": "northeast", "room": "Bandits_Run:29"}]}, "31": {"index": "31", "name": "A Crude Sign", "desc": ["\"   You see a tattered sign along the road, it reads something about a danger", "being nearby in a primitive tongue.  The crude sign is covered with moss", "and vines, almost hidden from view against the heavy jungle undergrowth.", "The danger seems to lie southwards, according to the symbols upon it.  You", "wonder if savages left it here, long ago."], "sector": "Forest", "extra": {"keywords": "sign", "desc": ["\"   Gunga!  Lunga goo!  Grungalagunga munga tunga! Dunga, wana wana wagoa!", "_________________________________________________________________________", "|                  X                                                    |", "|                   X                                                   |", "|                  X                                                    |", "|                   X                                                   |", "|                   X Gungala!                                          |", "|                   X                                                   |", "|                  X                                                    |", "|                   X                                                   |", "-------------------------------------------------------------------------"]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:31", "exits": [{"direction": "n", "room": "Bandits_Run:30"}, {"direction": "s", "room": "Bandits_Run:32"}]}, "32": {"index": "32", "name": "The Marked Trees", "desc": ["\"   The road is marked here by many trees that have been carved into with odd", "symbols and unreadable words.  The heaviest concentration of butchered trees", "huddle around a narrow path to the east.  It looks as if you can just fit", "between the trunks, to investigate what lies beyond there.  Further to the", "north, you smell rotting animal corpses.  The dirt road winds north and south", "from here through the jungle."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:32", "exits": [{"direction": "n", "room": "Bandits_Run:31"}, {"direction": "e", "room": "Bandits_Run:33"}, {"direction": "s", "room": "Bandits_Run:58"}]}, "33": {"index": "33", "name": "A Hidden Path", "desc": ["\"   You are walking on a narrow path that is flanked on either side by trees", "that have grown close together.  The dirt path is well travelled here, as you", "see footprints headed in both directions along the narrow way.  It is very", "quiet here, and you get the sense you are being watched.  The path opens on a", "road to the west, and twists deeper into the jungle to the east."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:33", "exits": [{"direction": "e", "room": "Bandits_Run:34"}, {"direction": "w", "room": "Bandits_Run:32"}]}, "34": {"index": "34", "name": "A Hidden Path", "desc": ["\"   You are moving along a dimly lit path.  It curves around the tall palm", "trees clustered here in the thick of the jungle.  You feet crunch small", "branches as you pass, giving away your presence to anyone within hearing", "distance.  You may continue west or southeast from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:34", "exits": [{"direction": "w", "room": "Bandits_Run:33"}, {"direction": "southeast", "room": "Bandits_Run:35"}]}, "35": {"index": "35", "name": "The Stone Gates", "desc": ["\"   You are standing before an arched stone gate, that blends in with the", "mounds of rock and earth beside it.  The earthen wall provides a barrier,", "circling around some settlement to the east.  You hear voices coming from", "that direction.  You can proceed through the gate to the east, or back west", "to the path."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:35", "exits": [{"direction": "e", "room": "Bandits_Run:36"}, {"direction": "northwest", "room": "Bandits_Run:34"}]}, "36": {"index": "36", "name": "Beneath the Arch", "desc": ["\"   You are standing beneath a tall stone archway, that leads to an encampment", "over towards the east.  You see the light of small fires burning there,", "lighting up the bows of the vine covered jungle trees.  A dark path winds", "back towards the west."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:36", "exits": [{"direction": "e", "room": "Bandits_Run:37"}, {"direction": "w", "room": "Bandits_Run:35"}]}, "37": {"index": "37", "name": "The Bandit Camp", "desc": ["\"   You are standing at the entrance to the infamous bandit camp of the Arador", "jungles.  You see many small structures here made of wood, and large animal", "bones.  Bandits mill about the place, chatting in small circles about their", "adventures in the city to the north.  Most of them ignore you, as you seem", "to blend in with the diverse crowd of ruffians.  Back to the west is a", "stone archway that can take you back out beyond the earthen walls of the", "jungle encampment."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:37", "exits": [{"direction": "n", "room": "Bandits_Run:38"}, {"direction": "e", "room": "Bandits_Run:39"}, {"direction": "w", "room": "Bandits_Run:36"}]}, "38": {"index": "38", "name": "The Bandit Camp", "desc": ["\"   You are standing in a small hut, which houses the guards of the bandit", "complex.  It seems that no one has been posted here, as no one wants to bother", "with the responsibility.  Some straw seats, hardly used, sit at the corners of", "the hut waiting for the arrival of someone to rest upon them.  An exit lies", "to the south."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:38", "exits": [{"direction": "s", "room": "Bandits_Run:37"}]}, "39": {"index": "39", "name": "The Bandit Camp", "desc": ["\"   You are standing within the jungle complex of the infamous bandits who roam", "this part of the world.  Vines dangle down, some of them used by the rogues as", "quick access to the trees above.  You woner if anyone has been watching you", "from up there.  You can proceed further into the camp to the east, or head", "back to the entrance towards the west."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:39", "exits": [{"direction": "e", "room": "Bandits_Run:40"}, {"direction": "w", "room": "Bandits_Run:37"}]}, "40": {"index": "40", "name": "The Bandit Camp", "desc": ["\"   You hesitate before the statue of a large dragon, made up entirely from", "elephant bones.  the wings of the beast stretch out on either side, carved", "from long ivory tusks.  This artifact must have been here prior to the bandits", "arrival, as they seem to think of it as a place to hang their robes, and have", "doodled upon it with ink pens out of boredom.  You can head north, south, or", "back out to the west from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:40", "exits": [{"direction": "n", "room": "Bandits_Run:42"}, {"direction": "s", "room": "Bandits_Run:41"}, {"direction": "w", "room": "Bandits_Run:39"}]}, "41": {"index": "41", "name": "The Bandit Camp", "desc": ["\"   You are walking upon a well trodden path, that has been cut through the", "jungle, within the bandit camp.  A couple of small buildings lie to the south,", "where you hear shouting and arguing going on.  Small purple mushrooms are", "growing here, making a terrible stench.  You can continue north or south from", "here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:41", "exits": [{"direction": "n", "room": "Bandits_Run:40"}, {"direction": "s", "room": "Bandits_Run:55"}]}, "42": {"index": "42", "name": "The Bandit Camp", "desc": ["\"   You are standing upon an well trodden path, that winds through the trees", "of the dense jungle.  The sound of exotic birds reaches your ears, giving you", "a sense of peace, in this hostile place.  Ruffians are moving hastily up and", "down the path, shoving you out of the way.  A stone building sits to the east", "of here, with smoke climbing out of its blackened chimney.  The path goes on", "north and south."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:42", "exits": [{"direction": "n", "room": "Bandits_Run:43"}, {"direction": "e", "room": "Bandits_Run:47"}, {"direction": "s", "room": "Bandits_Run:40"}]}, "43": {"index": "43", "name": "The Bandit Camp", "desc": ["\"   The path is wide here, dotted with broken tree stumps and marred foliage", "where bandits have hacked at things impulsively while passing by.  A large", "log cabin sits to the west from here, where many of the bandits are gathered", "for some kind of meeting.  The building looks newly constructed, an d seems", "to serve as a central location for the camp's population.  The path goes", "further north and south from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:43", "exits": [{"direction": "n", "room": "Bandits_Run:44"}, {"direction": "s", "room": "Bandits_Run:42"}, {"direction": "w", "room": "Bandits_Run:46"}]}, "44": {"index": "44", "name": "The Bandit Camp", "desc": ["\"   You are standing upon a trail that runs through the center of the bandits'", "jungle camp.  Several buildings are spread out over the area, the largest of", "which is further to the north.  The camp is full of life and activity, as", "rogues curse each other about their latest exploits, striving to gain respect", "in this loosely gathered clan.  You may go on north and south from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:44", "exits": [{"direction": "n", "room": "Bandits_Run:45"}, {"direction": "s", "room": "Bandits_Run:43"}]}, "45": {"index": "45", "name": "The Bandit Camp", "desc": ["\"   You are standing upon a path that turns up against a large stone building", "to the north.  It looks like a small castle, its tall chambers lost in the", "tree tops.  The path bends south and east from here, leading to small huts", "further south, and an entrance to the keep over to the east."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:45", "exits": [{"direction": "e", "room": "Bandits_Run:48"}, {"direction": "s", "room": "Bandits_Run:44"}]}, "46": {"index": "46", "name": "The Log Cabin Hall", "desc": ["\"   You are standing is a large hall, with many round tables and primative", "wooden chairs.  Bandits are gathering here, for some kind of meeting.  Most", "of them are complaining about the inconvenience of it all.  From the", "mutterings around you, it sounds as if the bandits are concerened about the", "rise in power of an old theive's guild in Arador.  They have threatened the", "bandits with destruction for impinging on their 'turf'."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:46", "exits": [{"direction": "e", "room": "Bandits_Run:43"}]}, "47": {"index": "47", "name": "A Stone Hut", "desc": ["\"   You are standing within a small stone hut, that seems to have functioned", "some kind of holy altar in eons passed.  You see where worshippers once", "gathered around a rock altar, praying to an unknown god. Now, the bandits", "are using this as a place to store prisoners.  They havent done well at", "feeding them, however, as you see dead bodies chained to the walls.  An exit", "lies west of here."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:47", "exits": [{"direction": "w", "room": "Bandits_Run:42"}]}, "48": {"index": "48", "name": "The Bandit Camp", "desc": ["\"   Here, you stand before the entrance to the hidden bandit castle.  The", "constructionn appears fairly fresh, as if it were completed within the last", "ten years.  A spiked portcullis hangs above the entrance, allowing visitors", "to move in and out of the structure.  A banner of a black dragon hangs", "before the arch, denoting a royal connection to this place.  The path", "heads back west, and the tall entry looms before you to the north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:48", "exits": [{"direction": "n", "room": "Bandits_Run:53"}, {"direction": "w", "room": "Bandits_Run:45"}]}, "49": {"index": "49", "name": "The Courtyard", "desc": ["\"   You see an ornate fountain here, gurgling with fresh water.  Bandits wander", "through here, stealing a quick drink.  This courtyard is open to the sky", "above, where you can see the thick branches of the jungle trees reaching over", "the stone keep.  Torches lit here create a pleasant glow in the unending", "shade of the trees.  The gatehouse sits to the east, and the hall continues", "north of here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:49", "exits": [{"direction": "n", "room": "Bandits_Run:50"}, {"direction": "e", "room": "Bandits_Run:53"}]}, "50": {"index": "50", "name": "The Reception Hall", "desc": ["\"   You stand at the center of the primary reception area for the Lord of this", "keep.  A few nervous merchants are gathered here, waiting to bargain with", "their goods.  They complain about the way they have been treated by the", "rogues as they entered the camp, and some of them mutter about their doubts", "that they will see the outer road again alive.  There seems to be some trust", "in their voices of the Lord of this place, however, which could be what lead", "them to come to this dangerous camp.  You may head south or west from here."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:50", "exits": [{"direction": "s", "room": "Bandits_Run:49"}, {"direction": "w", "room": "Bandits_Run:51"}]}, "51": {"index": "51", "name": "The Throne Hall", "desc": ["\"   You have arrived in the grand throne room of the black dragon Lord of this", "small keep.  Various works of art are proudly displayed within the large,", "vaulted stone chamber, depicting harsh warriors slaughtering the vile minions", "of cloaked invaders.  One painting depicts a tall fighter, who wears the", "black dragon insignia on a shield, proclaiming lordship over the continent.", "A large marbel throne, that seems quite out of place in a bandit camp, sits", "at the far end of the chamber.  You wonder what connection a lordly family", "has to these rogues.  An exit lies east of here, and a tall wooden door", "swings open to the south."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:51", "exits": [{"direction": "e", "room": "Bandits_Run:50"}, {"direction": "s", "room": "Bandits_Run:52"}]}, "52": {"index": "52", "name": "The Lordly Chambers", "desc": ["\"   You have entered the private chambers of the black dragon Lord.  A lavish", "bed is spread out along the southern wall, with a delicate canopy over it.", "Upon an intricately carved wooden desk, you see scrolls of papers outlining", "plans to one day use the bandits to raid the city of Arador.  A stone stair", "leads up to a tower above you.  A tall door stands open to the north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:52", "exits": [{"direction": "n", "room": "Bandits_Run:51"}, {"direction": "u", "room": "Bandits_Run:54"}]}, "53": {"index": "53", "name": "The Gate House", "desc": ["\"   You stand within the great hall of the small castle, surrounded by pillars", "of stone.  A number of bandits are milling about here, arguing about the next", "coordinated attack they will impose upon the region.  A large ornamental", "shield hangs on the north wall, with the black dragon symbol painted upon", "its surface.  An emblem appears at its base reading: 'Larrihl', probably", "referring to a royal family.  Strangely enough, that doesn't ring familiar", "in the great houses of Arador.  A hall continues to the west, and a tall gate", "sits south of you."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:53", "exits": [{"direction": "s", "room": "Bandits_Run:48"}, {"direction": "w", "room": "Bandits_Run:49"}]}, "54": {"index": "54", "name": "The Tower", "desc": ["\"   You stand at the top of a stairway, that leads down into some private", "chambers.  In this room, at the top of a tower, you can see over the tall", "jungle trees into the lands beyond through wide, arched windows.  Looking", "upon the landsacpe, you see the huge city of Arador far to the north, and", "another city of equal distance, but smaller size to the south.  You can", "see the Bandit's Run roadway winding between the two cities, roughly heading", "north and south.  An odd tower sits a bit to the north off the road.  This", "chamber is empty, and you wonder if the lord of this place comes here for", "solace and reflection, to plan grand schemes."], "sector": "Forest", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:54", "exits": [{"direction": "d", "room": "Bandits_Run:52"}]}, "55": {"index": "55", "name": "The Bandit Camp", "desc": ["\"   You stand between two small buildings that are crouched within heavy ferns,", "and tall tropical trees.  You see a strange hut to the east, that is shaped", "like a small beehive.  It has an arched entry, and round yellow walls.  There", "are wounded bandits heading into it from the path.  To the west, you see a", "crude shack made of twigs and branches from the jungle floor.  It hardly looks", "sturdy enough to weather a gentle wind.  The path heads back to the north."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:55", "exits": [{"direction": "n", "room": "Bandits_Run:41"}, {"direction": "e", "room": "Bandits_Run:56"}, {"direction": "w", "room": "Bandits_Run:57"}]}, "56": {"index": "56", "name": "The Healing Dome", "desc": ["\"   This is an odd round chamber, that glows with a soft yellow light.  The", "wounded bandits from the camp are finding respite here, healing up from", "recent raids throughout the jungle.  It seems that the walls of this place", "emanate a magical power, causing you to feel calm and refreshed.  This seems", "to be an ancient building, set in place ages ago, before the bandits came.", "You understand now why they chose this section of the jungle to build their", "haven, as the dome provides a powerful healing resource.  An exit lies west."], "sector": "Forest", "flags": "indoors, peaceful, fast_moves", "zone": "Bandits_Run", "room_key": "Bandits_Run:56", "exits": [{"direction": "w", "room": "Bandits_Run:55"}]}, "57": {"index": "57", "name": "The Bandit Camp", "desc": ["\"   This hut seems to serve as a place where the bandits go over their looted", "goods, throwing aside scraps and other unwanted items.  The contents of the", "building look like small piles of trash, with several bits of useless rubbish.", "The garbage just piles up and up, as no one seems interested in cleaning out", "the mess.  An exit lies to the east."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:57", "exits": [{"direction": "e", "room": "Bandits_Run:55"}]}, "58": {"index": "58", "name": "Bandit's Run", "desc": ["\"   You are standing upon the winding dirt road, that seems to have a big", "group of trees clustered next to it a bit further to the north.  The road", "appears to be less travelled here, and there is evidence that the plant life", "on the jungle floor is beginning to overgrow the thoroughway.  You see a", "useless rusting dagger along the side of the road, that bears the small", "insignia of a dragon.  You can continue on north and south from here."], "sector": "Forest", "zone": "Bandits_Run", "room_key": "Bandits_Run:58", "exits": [{"direction": "n", "room": "Bandits_Run:32"}, {"direction": "s", "room": "Bandits_Run:59"}]}, "59": {"index": "59", "name": "Jungle's Edge", "desc": ["\"   The road you are travelling upon is barely visible here, as the thick,", "jungle undergrowth has almost covered it over.  The treeline of the jungle", "appears to end just south of here, opening up onto wide grassy plains.", "You see the winds from the south blowing the tree branches around, and", "you feel refreshed.  To the north, the jungle thickens into darker, hotter", "nests of mysteries."], "sector": "Forest", "flags": "no_mob", "zone": "Bandits_Run", "room_key": "Bandits_Run:59", "exits": [{"direction": "n", "room": "Bandits_Run:58"}, {"direction": "s", "room": "Bandits_Run:60"}]}, "60": {"index": "60", "name": "Entrance to the Arador Jungle", "desc": ["\"   You stand before the great trees of the jungle south of Arador.  A tall", "arched opening made of bending branches leads into the thick tropical", "growth, where a pale dirt road bends onwards into the darkness to the", "north.  South of you, the road continues wide, and unhampered as it lurches", "across a flowing grassy plain, lost in the distant horizon."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:60", "exits": [{"direction": "n", "room": "Bandits_Run:59"}, {"direction": "s", "room": "Bandits_Run:61"}]}, "61": {"index": "61", "name": "The Open Road", "desc": ["\"   You are travelling along a barren road, that runs north and south of", "here.  Further to the north, the road seems to run into a line of tall", "jungle trees, with hanging vines, and animals jumping along the many", "branches.  This road seems to have few travllers, as your feet are the", "only things making marks upon its pebbled surface."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:61", "exits": [{"direction": "n", "room": "Bandits_Run:60"}, {"direction": "s", "room": "Bandits_Run:62"}]}, "62": {"index": "62", "name": "A Sudden Wind", "desc": ["\"   A sudden wind rips at you, causing you to stumble.  Its origin seems almost", "magical, as the force has arisen from nowhere.  Dust kicks up in the air all", "around you, blurring your vision, and disorienting your sense of direction.", "Through the gale, you make a bare outline of the road winding along southwest", "of you, and also onwards to the north.  You hear the static crackle of", "electrical power nearby, as small energy orbs flash and sparkle."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:62", "exits": [{"direction": "n", "room": "Bandits_Run:61"}, {"direction": "southeast", "room": "Bandits_Run:63"}]}, "63": {"index": "63", "name": "The Fallen Creature", "desc": ["\"   A strange sight meets your gaze, as you travel along the lonely road.  Off", "to the side of the lane, a large skeleton is sprawled upon the ground.  The", "beast that died there seems to have been slain, as the ribs are shattered,", "and the head has been severed from the body.  The shape of the creature is", "quite dragon-like, and seems to have been decaying here for many years.  The", "great bones have been picked clean, and yet its skull stares horribly at you."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:63", "exits": [{"direction": "s", "room": "Bandits_Run:64"}, {"direction": "northwest", "room": "Bandits_Run:62"}]}, "64": {"index": "64", "name": "The Road Continues", "desc": ["\"   A carriage has been overturned here, and is blackened from the heat of a", "fire that was apparently set some time ago.  The wooden frame of the cart is", "scorched, and frail.  It seems that another royal family member was raided", "here by bandits, or rogues.  You see the emblem of the Toskian families upon", "the broken door of the carriage, marred now by sword fighting and flame.  The", "road continues on north and south."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:64", "exits": [{"direction": "n", "room": "Bandits_Run:63"}, {"direction": "s", "room": "Bandits_Run:65"}]}, "65": {"index": "65", "name": "The Open Road", "desc": ["\"   Looking off to the sides of the road, vast fields of tall grasses spread", "out to the horizon, with waves of elegant movement rushing over the grasses", "caused by the wind currents from the south.  Far to the north, you can make", "out the beginnings of a tall tree line.  A bit to the north, a large object", "sits by the side of the road.  Further south, the plains extend, wide, and", "unimpeded by tree or rock."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:65", "exits": [{"direction": "n", "room": "Bandits_Run:64"}, {"direction": "southwest", "room": "Bandits_Run:66"}]}, "66": {"index": "66", "name": "The Crevice", "desc": ["\"   You have come to a large gap in the road, perhaps a full meter wide.  It", "looks as if you could easily jump the distance, but you wonder how wagons", "and carts have ever been able to cross this pit.  The crevice extends a few", "hundred yards to either side of the road, its ends lost it the tall grasses", "of the plain.  You can continue on the road heading northeast or south."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:66", "exits": [{"direction": "s", "room": "Bandits_Run:67"}, {"direction": "northeast", "room": "Bandits_Run:65"}]}, "67": {"index": "67", "name": "The Carcass", "desc": ["\"   Along the side of the road, you see the torn carcass of a mule, that seems", "to have been ravaged by wild dogs.  In the distance, you hear the howls of", "the dogs, as they seek their next victim.  The mule seems to have been", "carrying a merchant, as the torn, ornate saddle attests to.  Ofcourse, the", "rider is nowhere to be seen, and has only left behind the remains of a worn,", "tattered scroll."], "sector": "Road", "extra": {"keywords": "scroll", "desc": ["\"   The scroll reads... and great wealth can be found by importing goods to", "Arador.  They seem especially vulnerable to the exotic crystals of Tosk, and", "the odd wooden carvings made by the humble giants in the northern mountains.", "But beware the bandits along the road to Arador, it is said they have a", "powerful camp of operations in the jungle..."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:67", "exits": [{"direction": "n", "room": "Bandits_Run:66"}, {"direction": "s", "room": "Bandits_Run:68"}]}, "68": {"index": "68", "name": "The Winding Road", "desc": ["\"   The dirt from the road blows around your feet, as rolling leaves tumble", "along, getting caught in the grass along the lane's edge.  Further to the", "south you see a small path that cuts throught the grey-green grasses off", "the road.  You wonder where it might lead to in these wide open spaces.", "Looking around, there is still little evidence of sturtures, buildings, or", "civilization.  You can journey on north and south along the road."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:68", "exits": [{"direction": "n", "room": "Bandits_Run:67"}, {"direction": "s", "room": "Bandits_Run:69"}]}, "69": {"index": "69", "name": "The Path", "desc": ["\"   There are many marks upon the road's, stony surface here, as if a great", "gathering of people took place within the last few days.  Footprints are", "all around, as if the humanoids had been standing, shuffling, and were in", "no hurry to leave.  Off to the east, a wide path is cut into the tall", "grasses, leading to some unknown destination.  Further to the north, you see", "a faint outline of smoke climbing into the air."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:69", "exits": [{"direction": "n", "room": "Bandits_Run:68"}, {"direction": "e", "room": "Bandits_Run:70"}, {"direction": "s", "room": "Bandits_Run:72"}]}, "70": {"index": "70", "name": "On the Path", "desc": ["\"   You are walking along a wide path, that runs through tall grasses on", "either side.  Your feet crunch through the weeds, as you look down and", "notice that this path is quite freshly made, and was created by the feet", "of many humanoids passing through here.  From the direction of the fall of", "the grass, you can see that their initial heading was east bound, to a", "wide clearing in that direction.  A dirt road sits to the west."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:70", "exits": [{"direction": "e", "room": "Bandits_Run:71"}, {"direction": "w", "room": "Bandits_Run:69"}]}, "71": {"index": "71", "name": "The Clearing", "desc": ["\"   You are standing within a wide clearing, in a grassy field.  A path leads", "out of the clearing back to the west.  In the center of this circular field,", "you see a set of three pentagrams, that have been outlined in blood upon the", "ground.  In the center of each magical circle, you see a horrible sight.", "Elven children have been sacrificed here for some mysterious arcane rite.", "Their bodies lie limp and beaten in patches of blood.  No one else is here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:71", "exits": [{"direction": "w", "room": "Bandits_Run:70"}]}, "72": {"index": "72", "name": "The Lonely Road", "desc": ["\"   You are travelling along a dirt road that heads roughly in a north and", "south direction.  Off to the north you hear the howls of wolves, or was it", "a wild dog... it is difficult to be sure.  A boulder on the eastern edge", "bears an arcane symbol of ritual magic.  You get the feeling that you are in", "an area where dark arts are praticed.  Looking in all directions, you see", "no one nearby, and only the sound of the wind greets your ears as the howling", "fades."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:72", "exits": [{"direction": "n", "room": "Bandits_Run:69"}, {"direction": "s", "room": "Bandits_Run:73"}]}, "73": {"index": "73", "name": "A Small Hill", "desc": ["\"   The road twists and turns here, as it winds between two small hills.  A", "few trees dot the landscape here, shading you from the skies above.  You hear", "the songs of wild birds nearby, making their nests in the limbs of the short", "trees.  A sense of peace and calm over comes you, as you hear the sound of a", "gurgling brook nearby.  The chirping of small crickets echo around the hills,", "reminding you og long summer nights.  You may go north and southwest onwards."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:73", "exits": [{"direction": "n", "room": "Bandits_Run:72"}, {"direction": "southwest", "room": "Bandits_Run:74"}]}, "74": {"index": "74", "name": "The Volcanic Stones", "desc": ["\"   Off to the north you see a pair of small hills as you walk along the road.", "Further to the south, you see a small tower rising up above the grassy plain.", "The road climbs a bit to the south, and is dotted along the sides by strange", "shaped rocks.  They look to be volcanic in nature.  Looking more closely at", "them, you see that they are not rocks at all, but broken creatures, who have", "been turned to stone by some magical force.  There are horses, cattle, and", "travellers here, who met with an untimely fate.  You can proceed along the", "road with caution, heading south or northeast from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:74", "exits": [{"direction": "s", "room": "Bandits_Run:75"}, {"direction": "northeast", "room": "Bandits_Run:73"}]}, "75": {"index": "75", "name": "The Marked Road", "desc": ["\"   The road levels out here, before it dips again further to the north.  You", "see the hoofprints of horseback riders in the middle of the lane.  From the", "deep impressions made into the ground, you would guess that these must be", "the marks of heavy warhorses that travelled through here.  It appears that", "they came from the south, pivoted, and returned back the same way for some", "reason.  Perhaps they were on patrol, perhaps they were startled, but it is", "difficult to tell."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:75", "exits": [{"direction": "n", "room": "Bandits_Run:74"}, {"direction": "s", "room": "Bandits_Run:76"}]}, "76": {"index": "76", "name": "Pikeman's Turn", "desc": ["\"   You are standing upon a road marked with heavy traffic.  Most of the", "foot and hoof prints head south, and also west along a path up a hill.  Upon", "the hill to the west, a tall black tower sits, looming against the sky.  It", "looks very unearthly, standing there, upon this barren grassy plain.  Small", "sparkling lights can be seen coming from its windows, but there are no signs", "of life.  The road goes on northwards, and south from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:76", "exits": [{"direction": "n", "room": "Bandits_Run:75"}, {"direction": "s", "room": "Bandits_Run:79"}, {"direction": "w", "room": "Bandits_Run:77"}]}, "77": {"index": "77", "name": "Upon A Hill", "desc": ["\"   You are travelling along a steep path, that climbs a hill to the west.", "Back to the east, the path reconnects with a dirt road that stretches far", "to the north and south along the wide grassy plain.  A few peasants sit", "along the hillside, contemplating the skies.  They mutter something about", "waiting for the end of the world.  A dark tower sits to the west."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:77", "exits": [{"direction": "e", "room": "Bandits_Run:76"}, {"direction": "w", "room": "Bandits_Run:78"}]}, "78": {"index": "78", "name": "The Gathering", "desc": ["\"   You stand before the Great Dark Tower of Owlbane the Seer.  Many people", "are gathered here to wait in line, hoping for an audience with the infamous", "master of mysterious arts.  They all seem to be peasants from the cities to", "the south who have wandered here on a pilgrimage to find wisdom and special", "knowledge.  The tower stands over fifty meters tall, with dark windows", "arranged randomly on its surface.  A path leads down a hill to the east."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:78", "exits": [{"direction": "e", "room": "Bandits_Run:77"}, {"direction": "10", "room": "Bandits_Run:82", "keywords": "archway"}]}, "79": {"index": "79", "name": "The Winding Road", "desc": ["\"   You are walking along a well travelled road, that rund north and south", "through the open grasslands.  Further to the north, you see a black tower", "sitting upon a lonely hill.  The lands are fairly empty here, with few", "travellers braving the open roads.  Further to the north, you see a group", "of peasants heading for the tower."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:79", "exits": [{"direction": "n", "room": "Bandits_Run:76"}, {"direction": "s", "room": "Bandits_Run:80"}]}, "80": {"index": "80", "name": "The Crater", "desc": ["\"   In the center of the road, you see a large gaping hole, with black burnt", "edges and dark scorch marks along its rim.  Small wisps of smoke are rising", "from it.  The crater looks fresh, as you can still see small flames", "sputtering at its basin.  You wonder if this was a random event, or whether", "something or 'someone' was destroyed here.  You can feel the heat of the", "pit as you walk around it down the road."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:80", "exits": [{"direction": "n", "room": "Bandits_Run:79"}, {"direction": "s", "room": "Bandits_Run:81"}]}, "81": {"index": "81", "name": "The Quarry", "desc": ["\"   The road twists southeast and north at this juncture, as it winds around", "a large rock quarry that sits to the southwest.  You see several slave", "laborers down in the vast pit, cutting stone for constructions elsewhere", "in the realms.  There doesn't seem to be any way of getting down into the", "quarry from here, as it is quite a drop down to the bottom.  You hear the", "clang of hammer upon stone as the workers toil endlessly."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:81", "exits": [{"direction": "n", "room": "Bandits_Run:80"}, {"direction": "southeast", "room": "Bandits_Run:85"}]}, "82": {"index": "82", "name": "The Entry Chamber", "desc": ["\"   Here, the wide entry room of the tower speaks of the ancient days when", "mages ruled the world.  You see many rune covered walls, and murals depicting", "mysterious cloaked figures roaming the countryside.  Short robed apprentices", "wander about, trying to help all of the visiting peasants with their concerns", "and questions.  It seems that most of them are seeking an audience with a", "great mage here, and the apprentices are trying to encourage them to leave.", "With all this confusion going on, it looks as if you could easily head up", "the stairs, or back outside without being noticed."], "sector": "Road", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:82", "exits": [{"direction": "u", "room": "Bandits_Run:83"}, {"direction": "10", "room": "Bandits_Run:78", "keywords": "archway"}]}, "83": {"index": "83", "name": "Inside the Dark Tower", "desc": ["\"   As you walk along the road, a great shadow passes over you.  Looking up,", "there is nothing to be seen, but you have the sinking feeling that something", "dreadfully large has just passed overhead.  Only the sound of the wind is", "here to greet you, as you ponder about what has just occurred.  Looking up", "again at the clouds, you see an awesome shape hovering there.  The wide road", "runs south and northwest from here."], "sector": "Road", "extra": [{"keywords": "scrolls"}, {"desc": ["The scrolls are not readable, as they are constructed in long forgotten", "arcane languages.  You do note, however, that many of them have symbols", "of time, and space upon them."]}, {"keywords": "awesome shape"}, {"desc": ["\"   You see a large dark colored dragon, circling a cloud in the sky.  It", "seems to be looking for something.  It must not be you, as you are standing", "in plain view upon the road."]}], "flags": "no_mob, indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:83", "exits": [{"direction": "u", "room": "Bandits_Run:84"}, {"direction": "d", "room": "Bandits_Run:82"}]}, "84": {"index": "84", "name": "Top of the Tower", "desc": ["\"   You are standing atop the Dark Tower now, overlooking the landscape in", "all directions.  A ladder pops out of a trap door nearby, allowing you access", "to return to the chambers below.  Far to the north you see a wide jungle,", "and the tops of towers rising above the trees within it, denoting a large", "city that is there.  Closer, to the south, another city sits in a hazy", "mist, though not as large as the first."], "sector": "Road", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:84", "exits": [{"direction": "d", "room": "Bandits_Run:83"}]}, "85": {"index": "85", "name": "The Shadow", "desc": ["\"   As you walk along the road, a great shadow passes over you.  Looking up,", "there is nothing to be seen, but you have the sinking feeling that something", "dreadfully large has just passed overhead.  Only the sound of the wind is", "here to greet you, as you ponder about what has just occurred.  Looking up", "again at the clouds, you see an awesome shape hovering there.  The wide road", "runs south and northwest from here."], "sector": "Road", "extra": {"keywords": "awesome shape", "desc": ["\"   You see a large dark colored dragon, circling a cloud in the sky.  It", "seems to be looking for something.  It must not be you, as you are standing", "in plain view upon the road."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:85", "exits": [{"direction": "s", "room": "Bandits_Run:86"}, {"direction": "northwest", "room": "Bandits_Run:81"}]}, "86": {"index": "86", "name": "The Scorched Earth", "desc": ["\"   From somewhere close by, you hear the sounds of metal striking stone, as", "if many hammers were falling at rapid speed upon a hard surface.  The clanking", "echoes off stone walls somewhere in the vicinity, but nothing is visible.", "Looking at the edges of the road, you see that the grass has been scorched", "in many places, leaving vast stretches of blackened plant life nearby.  You", "smell the scent of singed leaves and weeds, and wonder how this could have", "happened."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:86", "exits": [{"direction": "n", "room": "Bandits_Run:85"}, {"direction": "s", "room": "Bandits_Run:87"}]}, "87": {"index": "87", "name": "The Circling Vultures", "desc": ["\"   Vultures are circling over head here, as you see their interest in a", "large carcass in the center of the road.  A large warhorse has been decaying", "there for at least a day.  Looking more closely at it, you notice that it", "has large claw marks ripping through its abdomen.  The size of the marks", "are staggering, as you can think of very few beasts that are big enough to", "create the lacerations.  You note that the horse's rider is nowhere to be", "seen.  The road rolls on north and southwest."], "sector": "Road", "extra": {"keywords": "vultures", "desc": "\"  The birds look very hungry, and are screeching at your presence."}, "zone": "Bandits_Run", "room_key": "Bandits_Run:87", "exits": [{"direction": "n", "room": "Bandits_Run:86"}, {"direction": "southwest", "room": "Bandits_Run:88"}]}, "88": {"index": "88", "name": "The Winding Road", "desc": ["\"   You are walking upon a barren road, that rolls through the open", "grasslands north of Phul's Choice.  You see birds circling in the air", "further down the road to the north.  Just south of you, you see a collumn", "of billowing smoke rising steadily into the air.  You can go on south or", "northeast from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:88", "exits": [{"direction": "s", "room": "Bandits_Run:89"}, {"direction": "northeast", "room": "Bandits_Run:87"}]}, "89": {"index": "89", "name": "The Brush Fire", "desc": ["\"   Just off the road to the east, a wide brush fire is burning, lofting tall", "flames into the air.  People pass by on the road unconcerned, as if this", "event is a normal, everyday occurance.  Oddly, the flames have a magical", "sparkle about them, and the area they occupy does not expand as the inferno", "burns.  You can continue on the road north and south from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:89", "exits": [{"direction": "n", "room": "Bandits_Run:88"}, {"direction": "s", "room": "Bandits_Run:90"}]}, "90": {"index": "90", "name": "The Pit", "desc": ["\"   A wide pit, several hundred meters across sits menacingly to the east.", "Tin wisps of smoke rise gently from its hidden depths.  A narrow crevice", "slopes down into its dark center to the east, off the road.  Several small", "human skulls have been placed nearby upon a pole, as a universal warning", "of immanent danger to travellers.  The road rolls on north and south of", "you."], "sector": "Road", "flags": "no_mob", "zone": "Bandits_Run", "room_key": "Bandits_Run:90", "exits": [{"direction": "n", "room": "Bandits_Run:89"}, {"direction": "e", "room": "Bandits_Run:91"}, {"direction": "s", "room": "Bandits_Run:95"}]}, "91": {"index": "91", "name": "The Sloping Crevice", "desc": ["\"   You are moving along a narrow crevice, that slopes downward to the east.", "Up to the west, the passage opens up onto a wide dirt road.  The stones", "here are melded together, scorched, and marred by magical fire.  The constant", "smell of sulphur is in the air.  You can continue on east and west."], "sector": "Mountains", "extra": {"keywords": "stones stone", "desc": ["\"   The markings are consistent with the myths of strong wizard flames, and", "dragon breath.  The rock has taken on a sick white hue, due to the very", "high temperature, and arcane nature of the blast."]}, "flags": "no_mob", "zone": "Bandits_Run", "room_key": "Bandits_Run:91", "exits": [{"direction": "e", "room": "Bandits_Run:92"}, {"direction": "w", "room": "Bandits_Run:90"}]}, "92": {"index": "92", "name": "The Sloping Crevice", "desc": ["\"   You are moving along a narrow crevice, that slopes downward to the east.", "Up to the west, the passage opens up onto a wide open area.  The stones", "here are melded together, scorched, and marred by magical fire.  The constant", "smell of sulphur is in the air.  You can travel along east and west."], "sector": "Mountains", "extra": {"keywords": "stones", "desc": ["\"   The markings are consistent with the myths of strong wizard flames, and", "dragon breath.  The rock has taken on a sick white hue, due to the very", "high temperature, and arcane nature of the blast."]}, "zone": "Bandits_Run", "room_key": "Bandits_Run:92", "exits": [{"direction": "e", "room": "Bandits_Run:93"}, {"direction": "w", "room": "Bandits_Run:91"}]}, "93": {"index": "93", "name": "The Base of the Pit", "desc": ["\"   You are standing at the base of a tremendous stone pit.  Only a narrow", "crevice to the west provides a way out of here, as the walls of the massive", "space are unclimbable for even the most nimble hands.  To the south, a large", "cave sits in the pit wall.  It reeks of rotting flesh, and death.  Several", "old blood stains mark the scorched stones here.  A chilling wind emanates", "from deep within the cave."], "sector": "Mountains", "extra": {"keywords": "stone stones", "desc": ["\"   The markings are consistent with the myths of strong wizard flames, and", "dragon breath.  The rock has taken on a sick white hue, due to the very", "high temperature, and arcane nature of the blast."]}, "flags": "no_mob", "zone": "Bandits_Run", "room_key": "Bandits_Run:93", "exits": [{"direction": "s", "room": "Bandits_Run:94"}, {"direction": "w", "room": "Bandits_Run:92"}]}, "94": {"index": "94", "name": "The Cave", "desc": ["\"   You are standing within a wretched cave, stinking of evil and vile intent.", "Human bodies are strewn about the chamber in pieces, evidencing the many", "unthinkable horrors that happen here routinely.  The smell of the rotting", "bodies is almost unbearable, and you wonder about what kind of creature", "would be capable of such carnage.  The walls of the cave are marked by very", "large claw marks, and patterns of scorched rocks and blasts of dark fires", "are everywhere.  Only one exit sits to the north, back out through the", "mouth of the cave."], "sector": "Road", "flags": "indoors", "zone": "Bandits_Run", "room_key": "Bandits_Run:94", "exits": [{"direction": "n", "room": "Bandits_Run:93"}]}, "95": {"index": "95", "name": "On the Road", "desc": ["\"   As you walk upon the dirt road, you smell the distinct odor of burning", "grass.  Looking over to the northeast, you see billowing smoke, rising up", "from the open grasslands.  You think you hear a screaming cry, emanating", "from the skies above, but looking up, you note that nothing is there.  The", "road winds on north and south through the endless fields of tall grasses."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:95", "exits": [{"direction": "n", "room": "Bandits_Run:90"}, {"direction": "s", "room": "Bandits_Run:96"}]}, "96": {"index": "96", "name": "The Winding Dirt Road", "desc": ["\"   You are travelling along an old road, that curves along lazily through", "the wide open grasslands of middle Arandia.  To the south, you see the", "outline of high walls, and the varied building of a city.  To the north,", "the road is lost is the tall wild grasses, as it winds back and forth,", "out of view.  You can proceed north and southwest from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:96", "exits": [{"direction": "n", "room": "Bandits_Run:95"}, {"direction": "southwest", "room": "Bandits_Run:97"}]}, "97": {"index": "97", "name": "The Travellers", "desc": ["\"   This appears to be a busy road that you are travelling upon, as you see", "military patrols heading out of the city to the south, and peasants making", "pilgramages to 'northern mystic'.  Some travellers mutter warnings to you", "about a great beast that haunts the road further to the north.  Another", "meantions that the road eventually leads to a dark jungle.  You may", "continue northeast and south from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:97", "exits": [{"direction": "s", "room": "Bandits_Run:98"}, {"direction": "northeast", "room": "Bandits_Run:96"}]}, "98": {"index": "98", "name": "The Twisting Road", "desc": ["\"   You are moving along a dusty wide road, that runs out of the main gates", "of a large city to the south.  The wind rises to meet you, slowing your", "progress as you make your way through the groups of travellers here.  One", "person mutters about the many deaths that have occurred increasingly in", "past months as merchants have tried to make their way north to Arador.", "Some speculate about the rumours of a large monster, others suggest that", "a band of riffians lives near the jungle's edge to the north."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:98", "exits": [{"direction": "n", "room": "Bandits_Run:97"}, {"direction": "s", "room": "Bandits_Run:99"}]}, "99": {"index": "99", "name": "Near the City", "desc": ["\"   You are standing before the gates of the city of Phul's Choice, which", "stand proudly just south of here.  Scouting warriors from the city militia", "eye you warily as you make your way along the road at this point so close", "to town.  The road appears to be well travelled, and you find it more", "difficult to wind through the thick crowds, as you are still close to the", "life of the city.  the road runs north and south from here."], "sector": "Road", "zone": "Bandits_Run", "room_key": "Bandits_Run:99", "exits": [{"direction": "n", "room": "Bandits_Run:98"}]}}}