{"zone": "BeachedShipwreck", "rooms": {"0": {"index": "0", "name": "Beach", "desc": ["\"  The soft white sand of the beech spreads apart ever so slightly allowing", "you to sink into the sand a little.  To the South you can see the deep blue", "color of the ocean and the salty spray of the waves as they crash into the", "jagged rocks creating a misty foam.  To the North you can see the rolling", "hills and plains covered in tall thin grass that sways back and forth as the", "wind whips through.  To the East the remnants of a once great ship can be", "seen swaying back and forth as the waves crash into its side."], "sector": "Desert", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:0", "exits": [{"direction": "e", "room": "BeachedShipwreck:1"}]}, "1": {"index": "1", "name": "Beach", "desc": ["\"   The sound of creaking wood and breaking planks can be heard as you", "near the wreck.  The jagged sharp rocks seem to be holding this ship in", "place as the waves continue to beat the side of it relentlessly.  The torn", "and tattered sails of the ship can bee seen draped across the deck and", "down into the water and remnants of the ship are floating in various pools", "of water created by the many sharp jagged rocks jetting up from the ocean floor."], "sector": "Desert", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:1", "exits": [{"direction": "e", "room": "BeachedShipwreck:2"}, {"direction": "w", "room": "BeachedShipwreck:0"}]}, "2": {"index": "2", "name": "Hull of the Shipwreck", "desc": ["\"   You now stand before a huge shipwreck that seems to have been here", "for quite some time.  From here you can see what is left of the sails of this", "once magnificent ship as they billow in the wind uncontrolled.  Some of", "the sails can be seen draped over the ship and dangling down into the sea", "creating shadows of all shapes and sizes and at this point the ship has a", "very large hole in the hull that could be used to enter the wreck."], "sector": "Desert", "extra": {"keywords": "hull", "desc": ["The hull must have been made of a very durable wood to withstand the", "hands of time so well.  You can see a huge hole that looks like it might", "have been created from the inside out."]}, "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:2", "exits": [{"direction": "s", "room": "BeachedShipwreck:3"}, {"direction": "w", "room": "BeachedShipwreck:1"}]}, "3": {"index": "3", "name": "Inside the Hold", "desc": ["\"   From here you can tell that the hull has been badly damaged.  Water can", "Be seen leaking in from every direction and the stench of mildew, salt water", "and decay is very strong.  It is obvious that whatever caused this large hole", "definately made it from this side, as the planks that make up the hull are bent", "and twisted outward not inward.  To the South the Foremast step can be seen", "jetting up from the hull into the deck above, the hold extends to the east and", "there is a large room to the Southwest."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:3", "exits": [{"direction": "n", "room": "BeachedShipwreck:2"}, {"direction": "e", "room": "BeachedShipwreck:9"}, {"direction": "s", "room": "BeachedShipwreck:4"}, {"direction": "southwest", "room": "BeachedShipwreck:7"}]}, "4": {"index": "4", "name": "Fore Mast Step", "desc": ["\"   This is where the Fore Mast is attached to the hull of the ship.  Large", "cracks and splinters can be seen in the mast itself and it is very soft to the", "tough due to how much water it has absorbed over time.  The floor of the", "hold is covered in a thin layer of water and various tiny sea creatures can", "be seen scurrying around in and out of holes and through the mossy", "cover.  The hold extends to the North and South from here."], "extra": {"keywords": "mast", "desc": ["The mast is very large at the point where it attached to the hull.  Large,", "rusty, cast iron bolts can be seen sticking through the mast attaching it to", "the hull itself."]}, "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:4", "exits": [{"direction": "n", "room": "BeachedShipwreck:3"}, {"direction": "s", "room": "BeachedShipwreck:5"}]}, "5": {"index": "5", "name": "Hold", "desc": ["\"   Light streams in from the outside through the various holes in the hull", "penetrating the darkness like a sword penetrating flesh and brightly", "colored moss can be seen glistening in what little light is being provided.  As", "the waves crash into the side of the wreck water is thrust in through the", "holes and finally forming puddles on the floor below your feet.  The hold", "continues to the North and East and there is a Hallway leading to the", "Northwest."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:5", "exits": [{"direction": "n", "room": "BeachedShipwreck:4"}, {"direction": "e", "room": "BeachedShipwreck:11"}, {"direction": "northwest", "room": "BeachedShipwreck:6"}]}, "6": {"index": "6", "name": "Hallway", "desc": ["\"   The musty smell of decaying wood and mildew is very strong in these", "tight quarters.  There are various places for torches and lanterns on the", "wall and the crunch of glass can be heard beneath your feet from oil", "lanterns as you move through the hall.  Bits and peices of shell and", "mounds of sediment litter the floor giving off a distinctively salty smell.", "To the North what is left of a door can be seen hanging from its hinges and", "to the Northwest the hallway ends abruptly leading into a large room."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:6", "exits": [{"direction": "n", "room": "BeachedShipwreck:7"}, {"direction": "southeast", "room": "BeachedShipwreck:5"}, {"direction": "northwest", "room": "BeachedShipwreck:8"}]}, "7": {"index": "7", "name": "Treasure room", "desc": ["\"   Chests of all sizes lie opened and broken apart in this room.  Bags of all", "colors and makes are scattered throughout and netting once used to hold", "all these in place are draped across the floor holding nothing more than", "pieces of old wood and broken locks to the floor.  Remnants of coins and", "trinkets lie in piles on the floor rendered useless by time and wear.  To the", "Southwest is a large hole leading into another room and to the south is a", "dark hallway."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:7", "exits": [{"direction": "s", "room": "BeachedShipwreck:6"}, {"direction": "northeast", "room": "BeachedShipwreck:3"}, {"direction": "southwest", "room": "BeachedShipwreck:8"}]}, "8": {"index": "8", "name": "Weapons Room", "desc": ["\"   The air in this room smells of rusting metal and rotting wood.  The hull", "is littered with holes and missing planks allowing ample light to see.", "Weapons of all shapes, make, and size lie broken and shattered on the floor", "and hanging from pegs in the walls.  They are in horrible and unusable", "condition and pointless to try and salvage.  In the upper right hand corner", "of the room is a very large web of some sort.  Obviously home to some sort", "of spider.  There is a large hole in the wall to the Northeast and a hallway", "continues to the Southeast."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:8", "exits": [{"direction": "northeast", "room": "BeachedShipwreck:7"}, {"direction": "southeast", "room": "BeachedShipwreck:6"}]}, "9": {"index": "9", "name": "Scorched Hold", "desc": ["\"   The charred remains of skeletons lie here decaying in a small puddle of", "water and the sides of the hold have been burned to a crisp and are brittle", "to the touch.  Charred white planks lie strewn throughout the hold giving", "off the smell of burnt wood and decaying flesh.  Something very violent", "took place in this area of the hold.  The hold continues to the South, East", "and West."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:9", "exits": [{"direction": "e", "room": "BeachedShipwreck:14"}, {"direction": "s", "room": "BeachedShipwreck:10"}, {"direction": "w", "room": "BeachedShipwreck:3"}]}, "10": {"index": "10", "name": "Hatch to Main deck", "desc": ["\"   The water is getting deeper the farther towards the back of the wreck", "you go.  Here you can see a large hatch in the ceiling with a long wooden", "ladder leading up to it.  Even though the ladder is made of wood it does", "not seem to be decaying as much as the rest of the ship and might be able", "to hold quite a bit of weight.  The hatch itself is obviously not latched", "down cause there is a little bit of light coming through.  The Hold", "continues to the North and South."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:10", "exits": [{"direction": "n", "room": "BeachedShipwreck:9"}, {"direction": "s", "room": "BeachedShipwreck:11"}, {"direction": "u", "room": "BeachedShipwreck:18", "info": "door, autoclose", "keywords": "Hatch"}]}, "11": {"index": "11", "name": "Hold", "desc": ["\"   Hunched over in the corner are the remains of some sort of hairy,", "flying beast.  The skeletal remains of this once great beast lay here", "decaying and undisturbed, seemingly for quit some time.  Its bleached", "white bones almost glitter in what little light penetrates the hull from the", "outside.  With closer examination remnants of cloth can be seen rapped", "around the creatures almost as if it was wearing clothing."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:11", "exits": [{"direction": "n", "room": "BeachedShipwreck:10"}, {"direction": "e", "room": "BeachedShipwreck:12"}, {"direction": "w", "room": "BeachedShipwreck:5"}]}, "12": {"index": "12", "name": "Large Hole", "desc": ["\"   Water rushes into the room as large waves crash into the side of the", "boat penetrating the hull.  Salty foam and small fragments of wood are", "floating in the hold and slowly run out the hole as the wave subsides.", "Various small fish and small crab like creatures scurry around trying to", "escape the violent force of the waves.  The water here is quit deep and", "continues to get deeper farther towards the back of the ship."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:12", "exits": [{"direction": "n", "room": "BeachedShipwreck:13"}, {"direction": "w", "room": "BeachedShipwreck:11"}, {"direction": "northeast", "room": "BeachedShipwreck:16"}]}, "13": {"index": "13", "name": "Main Mast Step", "desc": ["\"   This is where the main mast connects to the hull of the ship.  All the", "bolts and joints here have been completely ripped out and destroyed.  The", "mast itself is definitily in bad shape.  Huge cracks can be seen in the mast", "and it is leaning towards the front of the boat.  Light can be seen pouring", "in from above where the mast has torn a whole in the deck above.  From", "here the hold extends to the North and South."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:13", "exits": [{"direction": "n", "room": "BeachedShipwreck:14"}, {"direction": "s", "room": "BeachedShipwreck:12"}]}, "14": {"index": "14", "name": "Trail of Blood", "desc": ["\"   A trail of dried blood can be seen along the wall of the hold.  Pieces of", "decaying flesh and bone can be seen embedded in the planks making up", "the hull of the ship.  Various decaying body parts and limbs are scattered", "on the floor giving off a smell of decay and rot.  The walls and planks that", "make up the hull are pitted as if they have been pelted with some sort of", "hard substance.  The hold continues to the South and West and the", "Bulkhead can be seen to the Southeast."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:14", "exits": [{"direction": "s", "room": "BeachedShipwreck:13"}, {"direction": "w", "room": "BeachedShipwreck:9"}, {"direction": "southeast", "room": "BeachedShipwreck:15"}]}, "15": {"index": "15", "name": "Collapsed Bulkhead", "desc": ["\"   The Bulkhead has completely collapsed here allowing water to spill into", "the hull of the ship and on into the hold.  The constant contact with water", "has caused the wood that makes up the hull and the bulkhead to rot and", "fall apart.  All the rot and decay has caused the water to have a redish hue", "making it hard to see the bottom of the boat.  To the Northwest you can", "see the hold, to the South you can make out what might have been a", "supply room and to the Southeast there is an exit leading to the back of", "the boat and it seems to be completely submerged."], "sector": "Shallow Water", "flags": "indoors", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:15", "exits": [{"direction": "s", "room": "BeachedShipwreck:16"}, {"direction": "southeast", "room": "BeachedShipwreck:17"}, {"direction": "northwest", "room": "BeachedShipwreck:14"}]}, "16": {"index": "16", "name": "Supply Room", "desc": ["\"   The water here is so deep you have to swim to maneuver through it.", "This looks to have been some sort of supply room in the past.  You can", "see old moldy rope hanging from the walls and there are various crates", "and barrels floating in the water around you and you can see various tiny", "creatures scurrying around as you make your way through the room.  To", "the North you can see what is left of the bulkhead and to the Northeast", "you can see an exit leading to the back of the boat which is completely", "submerged under water, and the hold extends to the Southwest."], "sector": "Shallow Water", "flags": "indoors", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:16", "exits": [{"direction": "n", "room": "BeachedShipwreck:15"}, {"direction": "northeast", "room": "BeachedShipwreck:17"}, {"direction": "southwest", "room": "BeachedShipwreck:12"}]}, "17": {"index": "17", "name": "Gaping Hole", "desc": ["\"   There is a huge hole in the Hull here.  From the looks of it what ever", "caused this hole came from the outside in.  There are splintered wooden", "planks floating through the water and many colorful fish can be seen", "swimming around as you maneuver through the water.  Through the", "gaping hole you can see the seabed below and part of what used to be the", "rudder lying against a coral reef."], "sector": "Underwater", "flags": "indoors", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:17", "exits": [{"direction": "d", "room": "BeachedShipwreck:43"}, {"direction": "southwest", "room": "BeachedShipwreck:16"}, {"direction": "northwest", "room": "BeachedShipwreck:15"}]}, "18": {"index": "18", "name": "Hatch", "desc": ["\"   The tattered and torn sails of this once great ship can be seen strewn", "throughout the wreck and draped into the water.  The deck itself seems to", "be holding back time but upon closer examination it is obvious the deck", "won't last for long.  From here you can see that the main mast has broken", "about half way up and has fallen forward onto the Forecastle deck.  The", "gangplank can be seen to the North and the remnants of a catapult can be", "seen to the South and there is a hatch leading down to the hull."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:18", "exits": [{"direction": "n", "room": "BeachedShipwreck:19"}, {"direction": "s", "room": "BeachedShipwreck:23"}, {"direction": "d", "room": "BeachedShipwreck:10", "info": "door, autoclose", "keywords": "Hatch"}]}, "19": {"index": "19", "name": "Gang Plank", "desc": ["\"   What is left of the gangplank extends off the side of the boat from here.", "There are only a couple feet left and the rest of it can't be seen anywhere.", "The plank looks pretty rotted through and unable to support any weight", "whatsoever.  Where the plank meets the deck, two large wooden pegs can be seen", "attaching the plank and the deck together.  These wooden pegs look to be very", "loose and could break at anytime.  Rigging for the masts can be seen to", "the East and West and the deck continues South."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:19", "exits": [{"direction": "e", "room": "BeachedShipwreck:27"}, {"direction": "s", "room": "BeachedShipwreck:18"}, {"direction": "w", "room": "BeachedShipwreck:20"}]}, "20": {"index": "20", "name": "Rigging", "desc": ["\"   The rigging for the Fore Mast seems to still be well intact and sturdy.", "The various rope and nets used to climb up to the crows nest looks to be", "in good condition.  The deck in this area has turned an old gray color", "from the constant pounding of the sunrays and white patches of salt", "deposits can be seen where water must have puddled at one point and", "dried.  It looks like the rigging can be used to reach the top of the mast", "and the deck continues to the South and East.  There is also a passage", "leading to the Southwest under the deck."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:20", "exits": [{"direction": "e", "room": "BeachedShipwreck:19"}, {"direction": "s", "room": "BeachedShipwreck:21"}, {"direction": "u", "room": "BeachedShipwreck:33"}, {"direction": "southwest", "room": "BeachedShipwreck:25"}]}, "21": {"index": "21", "name": "Fore Mast", "desc": ["\"   This is where the Fore Mast extends from the deck and into the sky.", "Above you are the various sized sails used to catch the wind and propel", "this ship through the water.  Some of the sails have worked themselves", "loose over time and are dancing wildly in the wind and the others are still", "attached properly.  The mast itself is in amazingly good shape.  No cracks", "or splinters can be seen and the crows nest is still located at the top.  The", "main deck extends to the South and the North."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:21", "exits": [{"direction": "n", "room": "BeachedShipwreck:20"}, {"direction": "s", "room": "BeachedShipwreck:22"}]}, "22": {"index": "22", "name": "Along the Port Railing", "desc": ["\"   From here water can be seen as far as the eye can see.  The light blue of", "the water turns to deep blue several hundred yards out marking a drastic", "change in the depth of the water.  As the waves roll in you can see them", "begin to break and finally crashing into the side of the boat below.  The", "railing in this section seems to be pretty well intact and is a little wet from", "the spray of the waves. To the north you can see one of the ship masts", "towering above you and the deck extends to the East and there is a", "passage leading under the deck to the Northwest."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:22", "exits": [{"direction": "n", "room": "BeachedShipwreck:21"}, {"direction": "e", "room": "BeachedShipwreck:23"}, {"direction": "u", "room": "BeachedShipwreck:37"}, {"direction": "northwest", "room": "BeachedShipwreck:24"}]}, "23": {"index": "23", "name": "Catapult", "desc": ["\"   This catapult has not been used in a very long time.  The ropes used to", "pull down and lock it in place have all broken and ripped apart, the cup", "part of the catapult has broken off and is lying on the deck next to it and", "the support beams have long since been destroyed.  From the looks of it", "the catapult has slide forward breaking through to railing and is partially", "hanging over the side.  The deck continues to the East, West and the", "North."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:23", "exits": [{"direction": "n", "room": "BeachedShipwreck:18"}, {"direction": "e", "room": "BeachedShipwreck:29"}, {"direction": "w", "room": "BeachedShipwreck:22"}]}, "24": {"index": "24", "name": "Mess Hall", "desc": ["\"   From the looks of it this use to be the mess hall.  The benches and", "chairs that use to be spaced throughout the room are now all smashed", "against the left side of the room.  Some of the chairs are still usable but", "for the most part they have all either been destroyed or simply they are", "deteriorated and crumbled due to age and the amount of moisture in the", "air.  The kitchen can be seen to the Northwest and there is a hall leading", "to the north."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:24", "exits": [{"direction": "n", "room": "BeachedShipwreck:25"}, {"direction": "southeast", "room": "BeachedShipwreck:22"}, {"direction": "northwest", "room": "BeachedShipwreck:26"}]}, "25": {"index": "25", "name": "Crews Sleeping Chambers", "desc": ["\"   There are rows and rows of sleeping bunks in this room.  They are all", "suspended from hooks in the ceiling and are stacked three high.  Some of", "the hooks suspending the bunks have pulled free from their anchors", "leaving the bunks to swing freely and rock back and forth as the waves", "collide with the wreck.  The back and forth motion of these bunks makes", "it difficult to see the other side of the room.  There is a hallway to the", "south and the deck is to the Northeast."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:25", "exits": [{"direction": "s", "room": "BeachedShipwreck:24"}, {"direction": "northeast", "room": "BeachedShipwreck:20"}, {"direction": "southwest", "room": "BeachedShipwreck:26"}]}, "26": {"index": "26", "name": "Kitchen", "desc": ["\"   This room has a very strong, pungent smell to it.  From the looks of it", "this is the kitchen.  Cabinets and shelves line all side of the room and", "there is a large wooden island in the middle of the room and a huge wood", "burning stove on the wall behind it.  Various molds can be seen growing", "on almost every surface in the room as well as the floor, and most of the", "cabinets are in total disarray.  The Mess hall is to the Southeast and there", "is a hall leading to the Northeast."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:26", "exits": [{"direction": "northeast", "room": "BeachedShipwreck:25"}, {"direction": "southeast", "room": "BeachedShipwreck:24"}]}, "27": {"index": "27", "name": "Rigging", "desc": ["\"   Along this side of the boat you can see the gnarled and jagged rocks", "below that are keeping the wreck from drifting out to sea and the water is", "thrashed around as the waves collide with the rocks.  The rigging, for the", "main mast, seems to be in good shape and climbable here and extends up", "to the point where the main mast broke apart.  To the West you can see", "the gangplank, the main mast is to the south and there is a passage leading", "under the Quarterdeck to the Southeast."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:27", "exits": [{"direction": "s", "room": "BeachedShipwreck:28"}, {"direction": "w", "room": "BeachedShipwreck:19"}, {"direction": "u", "room": "BeachedShipwreck:36"}, {"direction": "southeast", "room": "BeachedShipwreck:31"}]}, "28": {"index": "28", "name": "Main Mast", "desc": ["\"   The main mast is in bad shape.  The mast has broken off about mid way", "up and cashed into the deck in the front of the boat.  What is left of the", "mast is leaning forward and has ripped a large hole in the deck below and", "large splinters of wood can been seen scattered at your feet.  Some of the", "rigging and netting is still intact and can be seen to the North and the", "main sail can be seen to the South drapped over the railing."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:28", "exits": [{"direction": "n", "room": "BeachedShipwreck:27"}, {"direction": "s", "room": "BeachedShipwreck:29"}]}, "29": {"index": "29", "name": "Ripped and Torn Sails", "desc": ["\"   The main sail is draped over the deck, off the side of the ship and", "into the water below where it is being thrashed around in the crashing", "waves.  The sail must be made of a very durable cloth to have survived", "for so long.  The sail is tattered and torn but doesn't seem to be decaying", "in anyway.  To the North what is left of the main mast can be seen, there", "is a passageway headed Northwest into the Aftcastle, a catapult can be", "seen to the West and there is a small staircase leading up to the Quarter", "deck."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:29", "exits": [{"direction": "n", "room": "BeachedShipwreck:28"}, {"direction": "w", "room": "BeachedShipwreck:23"}, {"direction": "u", "room": "BeachedShipwreck:40"}, {"direction": "northeast", "room": "BeachedShipwreck:30"}]}, "30": {"index": "30", "name": "Aftcastle", "desc": ["\"   You are in a hallway underneath the Quarter deck.  It is fairly dark in", "here since there are no windows and the only light is coming from the", "main deck to the Southwest.  You can hear the squeaks of the boards", "below your feet and the sound of water dripping from the roof.  As you", "make your way through the passage you can hear the sounds of small", "rodents scurrying out of the way.  There is a passage to the North, a large", "oak door to the Northeast, and you can hear the sounds of sails flapping in", "the wind to the Southwest."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:30", "exits": [{"direction": "n", "room": "BeachedShipwreck:31"}, {"direction": "northeast", "room": "BeachedShipwreck:32", "info": "door, closed, autoclose", "keywords": "Door"}, {"direction": "southwest", "room": "BeachedShipwreck:29"}]}, "31": {"index": "31", "name": "First Mates Quarters", "desc": ["\"   This must have been the First Mates quarters when the ship was", "in use.  It would seem as if this place has been ransacked and stripped", "completely of any and all valuables.  The beds have been tossed around", "and what are left of the desks and their drawers are scattered throughout", "the room.  Various chests have been left in the room open and ripped to", "shreds.  To the South there is a hallway, and to the Northwest you", "can see some of the rigging for the Main Mast."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:31", "exits": [{"direction": "s", "room": "BeachedShipwreck:30"}, {"direction": "northwest", "room": "BeachedShipwreck:27"}]}, "32": {"index": "32", "name": "Captains Quarters", "desc": ["\"   This was obviously the Captains Quarters.  From the looks of things", "there must have been a huge battle in here from the blood stains encompassing", "the entire room.  The bed has been flipped on its side and the desk has been", "all but destroyed.  The table has been overturned and the maps are scattered", "all over the floor covered in deep red stains.  The window to the outside has", "been smashed apart allowing a cool breeze to flow in from the waters", "edge.  The only exit is through the door to the Southwest."], "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:32", "exits": [{"direction": "southwest", "room": "BeachedShipwreck:30"}]}, "33": {"index": "33", "name": "On the Rigging", "desc": ["\"   The rigging is surprisingly stable considering how old the wreck must", "be.  The ropes are a little loose causing you to sway back and forth in the", "wind but for the most part it still can be used to reach the top.  The view", "from here is pretty good.  Below you can see where the other mast", "crashed into the deck and its sails draped over the side of the ship into the", "water.  You are going to have to continue your way up the rigging to the", "top since the ropes have become tangled slightly below you."], "sector": "Mountains", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:33", "exits": [{"direction": "u", "room": "BeachedShipwreck:34"}]}, "34": {"index": "34", "name": "Crows Nest", "desc": ["\"   The view from up here is unbelievable.  It is now clear why the crows", "nest is located on the fore mast.  You can see forever in every direction.", "To the South you can see the great expanse of the ocean and to the East", "the white sands of the beach extend as far as the eye can see.  To the", "North you can see the plains and rolling hills just past the beach and a", "small village can be seen to the West.  It seems the only way down will", "be down the mast considering the rigging has become tangled and", "unusable now."], "sector": "Mountains", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:34", "exits": [{"direction": "d", "room": "BeachedShipwreck:35"}]}, "35": {"index": "35", "name": "The Fore Mast", "desc": ["\"   As you work your way down the mast you notice that there are pegs in", "the side of the mast that can be used for footing making it much easier to", "climb down.  The ropes and netting used to make up the rigging is", "swaying back and forth in the wind sometimes swaying in just far enough", "to hit you and almost tangle around you and getting hooked in the various", "pegs.  The only way to go now is down to the main deck."], "sector": "Mountains", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:35", "exits": [{"direction": "d", "room": "BeachedShipwreck:21"}]}, "36": {"index": "36", "name": "The Broken Main Mast", "desc": ["\"   The view from up here is pretty good.  You can see most of the main", "deck and where the top part of the mast crashed into the front deck of the", "boat.  The rigging at this point is tangled all together making it impossible", "to continue up to the point where the mast broke in two.  The mast looks", "to be a little slippery but there are small metal pegs poking out that can be", "used for footing to climb down."], "sector": "Mountains", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:36", "exits": [{"direction": "d", "room": "BeachedShipwreck:28"}]}, "37": {"index": "37", "name": "Remnants of Main Mast", "desc": ["\"   The top half of the main mast has crashed through this part of the deck", "causing a huge hole.  Large planks from the deck stand vertical where the", "mast broke through forcing the deck to buckle and splinter.  The damage", "looks pretty fresh so this must have happened recently.  Ropes and nets", "from the mast are strewn across the deck making it difficult to maneuver", "without getting tangled up.  The deck continues to the North and an old", "Ballista can be seen to the Northwest."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:37", "exits": [{"direction": "n", "room": "BeachedShipwreck:38"}, {"direction": "d", "room": "BeachedShipwreck:22"}, {"direction": "northwest", "room": "BeachedShipwreck:39"}]}, "38": {"index": "38", "name": "Tattered Sails", "desc": ["\"   Sails from the ships mast lie draped across the deck flapping around as", "the wind bellows through.  Most of the sails are torn and threads can be", "seen stuck in the various cracks and holes of the deck where the sails", "were lodged and then ripped free.  As the wind whips through the sails it", "creates and almost hypnotic motion as the sails mold themselves to the", "winds various patterns."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:38", "exits": [{"direction": "s", "room": "BeachedShipwreck:37"}, {"direction": "southwest", "room": "BeachedShipwreck:39"}]}, "39": {"index": "39", "name": "Old Abandoned Ballista", "desc": ["\"   The whole front of the deck is covered in what remains of the ships", "Ballista.  Several large spears, used as ammo for the Ballista, can be seen", "scattered on the deck, broken, rotting and useless.  The bowsprit of the", "ship has broken off and can be seen embedded in the rocks below and the", "deck itself has buckled forcing the planks to tear from the deck."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:39", "exits": [{"direction": "northeast", "room": "BeachedShipwreck:38"}, {"direction": "southeast", "room": "BeachedShipwreck:37"}]}, "40": {"index": "40", "name": "Port Quarter Deck", "desc": ["\"   Up here on left side of the Quarterdeck you can see most of the", "main deck below.  Some of the sails can be seen drifting in the water", "below as they hang over the side of the wreck.  The deck itself looks to be", "in pretty good condition.  Some of the planks have pulled partially free and", "slap against each other as the boat is hit by the ragging waves below.  The", "deck continues to the north and the helm can be seen to the Northwest."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:40", "exits": [{"direction": "n", "room": "BeachedShipwreck:41"}, {"direction": "d", "room": "BeachedShipwreck:29"}, {"direction": "northeast", "room": "BeachedShipwreck:42"}]}, "41": {"index": "41", "name": "Starboard Quarter Deck", "desc": ["\"   This part of the Quarterdeck is somewhat wet and water logged.  The", "waves below crash up the side of the wreck ending here leaving salt", "deposits and debris.  The planks seem to be soaked through and sagging", "badly and some have completely rotted through leaving holes and making", "the deck very unstable.  The deck continues to the South and the helm can", "be seen to the Southeast."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:41", "exits": [{"direction": "s", "room": "BeachedShipwreck:40"}, {"direction": "southeast", "room": "BeachedShipwreck:42"}]}, "42": {"index": "42", "name": "Helm", "desc": ["\"   From here there is a good view of the entire ship.  This is where the", "ship was controlled.  You see a large circular object with several handles", "protruding along its circumference that was used to control the rudder and", "steer the ship.  Not much is left of it now as it has given into time and", "weather.  The deck itself seems to be sagging slightly in the middle and", "most of the planks are warped and pulling apart from one another.  The", "Quarterdeck extends to the Southwest and the Northwest."], "sector": "Road", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:42", "exits": [{"direction": "southwest", "room": "BeachedShipwreck:40"}, {"direction": "northwest", "room": "BeachedShipwreck:41"}]}, "43": {"index": "43", "name": "Rudder", "desc": ["\"   Against the coral reef lies what is left of the ship's rudder.  The rudder", "has been broken into two pieces.  One piece lies here on the coral and the", "other piece is still attached to the hull but seems ready to break away at", "any moment.  The hull of the ship is grown over with moss and you can", "see many small creatures attached to the hull making it their home."], "sector": "Underwater", "zone": "BeachedShipwreck", "room_key": "BeachedShipwreck:43", "exits": [{"direction": "u", "room": "BeachedShipwreck:17"}]}}}