{"zone": "GuildArea", "rooms": {"0": {"index": "0", "name": "Foyer.", "desc": ["\"   This long hallway has been cleared of debris and redecorated as a guild", "house.  Though much of the original stonework has been destroyed, that which", "has survived has been preserved by the guild.  In addition paintings and", "tapestries cover this long hallway.  Paintings of the guildmembers and", "founders are lit by torches placed in sconces along the walls.  To the", "north the tunnel opens up into a much larger cave."], "zone": "GuildArea", "room_key": "GuildArea:0", "exits": [{"direction": "n", "room": "GuildArea:1"}, {"direction": "southwest", "room": "_Unknown7:17", "key": "15842", "info": "door, closed, locked", "keywords": "door"}]}, "1": {"index": "1", "name": "Main Hall.", "desc": ["\"   A quite wide cave, and used as the main guild hall of Pure Madness,", "this cave's central feature is it's great round table, quite able to", "accomodate the entire membership of the guild at once.  The cave itself", "is quite well lit by a multitude of candles and torches on the central", "table and along the cave walls.  There is a stairway just to the left of", "the entrance to this cave leading down into what smells like a storage", "room, and three doors leading out from the cave on the east, west, and", "northern walls of the cave."], "extra": {"keywords": "table round", "desc": ["\"   The table is nearly twenty meters in diameter, and could easily seat", "fifty members for discussions.  There are stacks of paper and the like for", "use in guild activities, and large, comforatable chairs.  The light from", "the cave centers upon the table, providing ample lighting for long nights", "of discussions.  The table itself is made of oak, and the chairs crafted", "of mahogany."]}, "zone": "GuildArea", "room_key": "GuildArea:1", "exits": [{"direction": "n", "room": "GuildArea:3"}, {"direction": "e", "room": "GuildArea:4"}, {"direction": "s", "room": "GuildArea:0"}, {"direction": "w", "room": "GuildArea:2"}, {"direction": "d", "room": "GuildArea:5"}]}, "2": {"index": "2", "name": "Enforcer's Chamber.", "desc": ["\"   This is the room of the guild's enforcer, essentially second in command", "within the guild structure.  Far more spartan than the room of the leader,", "it contains a smaller, less opulent bed, far more utilitarian.  The walls,", "instead of trophies from former victories, contain weapons and armor which", "will contribute to future victories.  While the leader maintains the history,", "the enforcer sees that the history of the guild will continue to be", "written."], "zone": "GuildArea", "room_key": "GuildArea:2", "exits": [{"direction": "e", "room": "GuildArea:1"}]}, "3": {"index": "3", "name": "War Room.", "desc": ["\"   This room, though well lit and still beautiful from it's past inhabitants,", "now has a much more deadly purpose, being the room in which campaigns for", "the guild are planned.  The northern edge is rubble, the guild deciding that", "further excavation of the caves would serve no useful purpose.  Maps and", "graphs showing the strength, resources, and enemies of the guild are rolled", "up in neat scrolls, awaiting the need for use."], "zone": "GuildArea", "room_key": "GuildArea:3", "exits": [{"direction": "s", "room": "GuildArea:1"}]}, "4": {"index": "4", "name": "Guildmaster's Chamber.", "desc": ["\"   Reserved for the leader of the Pure Madness guild, this room is bedecked", "with the various trophies which Pure Madness has gained through it's", "history.  A large desk takes up one side of the room, and a bed the other,", "in between are located various trophies from vanquished enemies and objects", "of sentimental meaning to the leader of Pure Madness.  The room is quite", "well lit, and most of the original detailing on the walls has been", "preserved, the old blending with the new, trophies from the present contained", "in a room with a past."], "zone": "GuildArea", "room_key": "GuildArea:4", "exits": [{"direction": "w", "room": "GuildArea:1"}]}, "5": {"index": "5", "name": "Storage Cellar.", "desc": ["\"   This room is quite dark compared to the rest of the guild house, and kept", "cool by large blocks of ice.  The ice blocks slowly melt, draining into a", "large central pool of very cold water, with the stores suspended above this", "pool upon a metal grating."], "zone": "GuildArea", "room_key": "GuildArea:5", "exits": [{"direction": "u", "room": "GuildArea:1"}]}, "6": {"index": "6", "name": "Great entrance hall.", "desc": ["\"   This great entrance hall serves not only to welcome members, but also as", "a trophy room.  To the north lies a great library, housing maps and books", "which have been collected over the years.  A great golden lattice adorns the", "archway over the door into the library, engraved with the symbol -=MO=-, and", "on each side of the archway, vases carry a potporri of roses and local plants", "to provide the room with a fresh airy scent.", "A great rug adorns the floor, made from the hide of some great beast, and", "large enough to cover almost the entire floor.  Comfortable cushioned chairs", "and large oak tables lie unassumingly along the walls, while tapestries", "depicting the greatest battles in the guild's history line three of the", "walls.  The southern wall, by contrast, houses a large window overlooking", "the once beautiful city of Orshingal.  The view is still breathtaking, even", "though the city itself is in ruins.  Above the window is another gold and", "silver lattice bearing the symbol -=MO=-."], "flags": "indoors, peaceful, no_magic", "zone": "GuildArea", "room_key": "GuildArea:6", "exits": [{"direction": "n", "room": "GuildArea:7", "desc": "To the north is a great library."}, {"direction": "d", "room": "Ershteep:10", "key": "3450", "info": "door, closed, locked, pickproof", "keywords": "door house"}]}, "7": {"index": "7", "name": "Ancient library.", "desc": ["\"   Two great rows of shelves, carved from a rich dark red oak, carry what", "must be a king's ransom in tomes, maps, scrolls, and various other papers", "which have been collected over the years.  The shelves stretch up almost", "twenty feet, the top shelves having access only through use of a ladder made", "of finely carved ash.", "The floor is made of polished wood, probably pine, with the walls carved", "of marble, and lined with furs.  To the north, there is a great brick", "fireplace which gives off a warm glow.  You would think it an act of madness", "to place a roaring fireplace amongst such a wealth of books, though upon", "closer inspection it is clear that the fire is in fact magical in nature.", "There is a great oaken staircase leading upwards to the second story, where", "you can make out what appears to be a game room."], "flags": "indoors, peaceful, no_magic", "zone": "GuildArea", "room_key": "GuildArea:7", "exits": [{"direction": "s", "room": "GuildArea:6", "desc": "To the south is the main entrance hall."}, {"direction": "u", "room": "GuildArea:8", "desc": "Above you is the main meeting hall of -=MO=-."}]}, "8": {"index": "8", "name": "Meeting and games room.", "desc": ["\"   This room hangs in almost perpetual darkness, except for the few well", "lit areas around the tables.  Magical lighting from above provides the", "gaming tables with enough light to allow for playing, but the light seems", "to stop abruptly further than a few feet from the tables themselves.  There", "are several games which are provided both for amusement and to sharpen", "tactical skills, on one table you see a finely crafted marble chess set, on", "another there is a game of backgammon, using gold and silver crafted pieces.", "Along the northern wall is a large dart and dagger target to sharpen", "accuracy upon.", "Though the games look interesting, the main purpose of this room is clear,", "it is used as a meeting place for the members of -=MO=-.  A huge table", "dominates the center, with the symbol of the guild embossed upon the center", "and with chairs seated around it.  Upon the table is place for food and drink,", "though from the papers and scrolls upon it, it is clear that this is not its", "main purpose."], "extra": {"keywords": "_ex2", "desc": ["\"   As you enter the mist filled room, you feel your feet slip out from under", "you and your body begin to float.  The sensation in disorienting at first,", "but then quite pleasant no longer having to carry your own weight."]}, "flags": "indoors, peaceful, no_magic", "zone": "GuildArea", "room_key": "GuildArea:8", "exits": [{"direction": "s", "room": "GuildArea:9", "desc": "South is a room filled with mist.", "info": "message"}, {"direction": "d", "room": "GuildArea:7", "desc": "Below you is a great library."}]}, "9": {"index": "9", "name": "Mystical slumber.", "desc": ["\"   You bask in the soft warm magical glow of this room, provided by the", "guild for use of it's members.  Here you can rest from the hassle of guild", "buisness and adventuring and allow your wounds to heal.  In the safety of", "the guild house, this magical sanctuary protects it's members and lets them", "sleep while awaiting another assignment or adventure.", "Warm mist surrounds you, and though you cannot see the ground or ceiling,", "it is not hard to get comfortable.  The magical wards upon this area", "protect the sleeping, allowing them to rest easy and free from harm.  The", "hustle and bustle of Midgard is far away....."], "extra": {"keywords": "_ex0", "desc": ["\"   You float over to the entrance to the games room, and regain your weight", "as you step through the doorway.  You feel the world begin to weigh down on", "you once again, and look back longingly to the mist filled room."]}, "flags": "indoors, peaceful, no_magic, rent_room", "zone": "GuildArea", "room_key": "GuildArea:9", "exits": [{"direction": "n", "room": "GuildArea:8"}]}}}