{"zone": "MidgardShipyard", "rooms": {"0": {"index": "0", "name": "Endarian Shipyards", "desc": ["\"   You are at the entrance to the shipyard.  A big wooden banner hangs over the", "entrance, with ENDARIAN YARDS embossed in big red letters.  The road has turned", "to a gravel path, with buildings to either side of the entrance.  Looking into", "the yards you can make out the bones of a ship, still under construction.  There", "are a lot of workers clambering all over the ship.  In the distance you can", "see the tall walls of the city."], "sector": "Road", "flags": "no_mob, mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:0", "exits": [{"direction": "e", "room": "Midgard:138"}, {"direction": "w", "room": "MidgardShipyard:1"}]}, "1": {"index": "1", "name": "On a Gravel Path", "desc": ["\"    You are beside the entrance to the yards and one of the drydocks.  From this", "vantage point you can view the work in progress on the ship below.  The keel has", "been laid and the ribs and support beams have been put in place.  The ship is", "quite long, narrow and tall.  It doesn't seem to have the bulk required for a", "cargo ship.  You can see lanterns hung all over the ship, constantly alight as", "it is dark down in the drydock."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:1", "exits": [{"direction": "n", "room": "MidgardShipyard:2"}, {"direction": "e", "room": "MidgardShipyard:0"}, {"direction": "s", "room": "MidgardShipyard:3"}]}, "2": {"index": "2", "name": "On a Gravel Path", "desc": ["\"   You are outside the yard's canteen.  There is a strong smell of tea and fresh", "bread wafting out the door.  It mixes strangely with the smells of the sea.  On", "the other side of this small gravel path you can peer into one of the drydocks", "currently in use.  You can see the outlines of a ship under construction.  It", "seems to be quite a large ship, easily three hundred feet in length, and from", "the height of the ribs you suspect that it will more likely be a warship rather", "that cargo.  The path leads of down to the sea locks that control the drydocks.", "The smell of the sea spray is very strong, as is the smell of rotting seaweed."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:2", "exits": [{"direction": "s", "room": "MidgardShipyard:1"}, {"direction": "w", "room": "MidgardShipyard:4"}, {"direction": "10", "room": "MidgardShipyard:19", "info": "door, closed", "keywords": "office"}]}, "3": {"index": "3", "name": "On a Gravel Path", "desc": ["\"   You are outside the yard's canteen.  There is a strong smell of tea and fresh", "bread wafting out the door.  It mixes strangely with the smells of the sea.  On", "the other side of this small gravel path you can peer into one of the drydocks", "currently in use.  You can see the outlines of a ship under construction.  It", "seems to be quite a large ship, easily three hundred feet in length, and from", "the height of the ribs you suspect that it will more likely be a warship rather", "than cargo.  The path leads of down to the sea locks that control the drydocks.", "The smell of the sea spray is very strong, as is the smell of rotting seaweed."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:3", "exits": [{"direction": "n", "room": "MidgardShipyard:1"}, {"direction": "s", "room": "MidgardShipyard:16"}, {"direction": "w", "room": "MidgardShipyard:6"}, {"direction": "10", "room": "MidgardShipyard:17", "keywords": "canteen"}]}, "4": {"index": "4", "name": "Rear of Keel", "desc": ["\"   You are in the drydock.  There are many ladders along the sides to enable", "you to climb out whenever you wish.  Along the centre of the drydock is a huge", "wooden beam, you are at one end of the beam.  There are several sections cut out", "of the beam, going about six inches deep into the twenty four inch deep beam.", "The cuts go straight across the beam, must be for the ribs of the ship.  There", "is another cut at the end of the beam, going about twelve inches long the", "length of the beam.  You have to be very careful, all these cuts make", "treacherous walking.  Away from the keel you can see that the rest of the", "drydock is actually a mixture of rocks and small ponds."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:4", "exits": [{"direction": "e", "room": "MidgardShipyard:2"}, {"direction": "s", "room": "MidgardShipyard:5"}]}, "5": {"index": "5", "name": "Centre of the Keel", "desc": ["\"   You are in the drydock.  There are many ladders along the sides to enable", "you to climb out whenever you wish.  Along the centre of the drydock is a huge", "wooden beam, you are at the centre of the beam.  There are several sections cut", "out of the beam, going about six inches deep into the twenty four inch thick", "beam. The cuts go straight across the beam, must be for the ribs of the ship.", "There is a large circular hole cut deep into the beam, over half as wide as", "the beam itself.  You have to be very careful, all these cuts make treacherous", "walking.  Away from the keel you can see that the rest of the drydock is", "actually not very dry, being a mixture of rocks and small ponds."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:5", "exits": [{"direction": "n", "room": "MidgardShipyard:4"}, {"direction": "s", "room": "MidgardShipyard:6"}]}, "6": {"index": "6", "name": "Front of the Keel", "desc": ["\"   You are in the drydock.  There are many ladders along the sides to enable", "you to climb out whenever you wish.  Along the centre of the drydock is a huge", "wooden beam, you are at one end of the beam.  There are several sections cut out", "of the beam, going about six inches deep into the twenty four inch deep beam.", "The cuts go straight across the beam, must be for the ribs of the ship. You can", "see that the end of the beam is being bent slightly through the use of weights.", "This must be where the bow of the ship is formed.  Just beyond the front of the", "ship is the sea gate.  Several small puddles have formed near the gate.  Testing", "these pools, you estimate that they are several feet deep yet the pumps seem to", "have everything under control."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:6", "exits": [{"direction": "n", "room": "MidgardShipyard:5"}, {"direction": "e", "room": "MidgardShipyard:3"}, {"direction": "s", "room": "MidgardShipyard:15"}, {"direction": "w", "room": "MidgardShipyard:7"}]}, "7": {"index": "7", "name": "On a Gravel Path", "desc": ["\"   You are between two drydocks.  Looking quickly into one of the drydocks, you", "see that it is not very dry, the sea has been allowed in. On the other side of", "this small gravel path you can peer into one of the drydocks currently in use.", "You can see the outlines of a ship under construction.  It seems to be quite", "a large ship, easily three hundred feet in length, and from the height of the ri", "bs you suspect that it will more likely be a warship rather than cargo.  The", "path leads of down to the sea locks that control the drydocks.  The smell", "of the sea spray is very strong, as is the smell of rotting seaweed.  In the", "other direction you can see large piles of wood and some large machines."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:7", "exits": [{"direction": "n", "room": "MidgardShipyard:8"}, {"direction": "e", "room": "MidgardShipyard:6"}, {"direction": "s", "room": "MidgardShipyard:14"}]}, "8": {"index": "8", "name": "Beside the Lumber Yard", "desc": ["\"   You are between one of the drydocks and the large lumberyard.  There are", "piles upon piles of wood, both cut and uncut, stacked in triangular piles.", "Some of the wood has been here so long that small bushes and grass have sprouted", "between them.  To the other side you can see into the drydock.  The keel has", "been laid and the ribs and support beams have been put in place.  The ship is", "quite long, narrow and tall.  It doesn't seem to have the bulk required for a", "cargo ship, probably going to be commissioned as a warship for some cities navy.", "You can see lanterns hung all over the ship, constantly alight as it is dark", "down in the drydock.  To the north you can see a small shed, surrounded by large", "machines and immense pulleys."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:8", "exits": [{"direction": "n", "room": "MidgardShipyard:9"}, {"direction": "s", "room": "MidgardShipyard:7"}, {"direction": "w", "room": "MidgardShipyard:10"}]}, "9": {"index": "9", "name": "The Bending Room", "desc": ["\"   You are in a large shed.  The purpose of the machinery is obvious.  It's to", "bend the large wooden beams into the correct curvature required for the ribs of", "the ship.  Currently there is a large beam undergoing bending.  It is about", "thirty feet in length and about one foot square.  The wood hasn't been seasoned,", "as seasoned wood would crack.  The machine has been well designed so that if the", "beam cracked, the machine collapses like a book, but the spine of the book moves", "away from you.  Looking at the oft-repaired wall behind the beam it is obvious", "that this is an important design consideration."], "sector": "Road", "extra": {"keywords": "beam bending machine pulleys", "desc": ["\"   The beam is being held by ten adjustable clamps, that are bolted tightly", "to movable boards, the boards have a marker, and these clamps are gradually", "pushed into the right positions in order to get the right curvature.  The", "boards are moved by immense pulleys and held in position by pins as thick as", "an orc's wrist."]}, "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:9", "exits": [{"direction": "s", "room": "MidgardShipyard:8"}]}, "10": {"index": "10", "name": "Lumber Yard", "desc": ["\"   You are among the many piles of wood.  Some of the wood has been here for", "years, slowly being seasoned.  There are several small creatures living here,", "plenty of small lizards and frogs at least.  From this point you can look over", "the entire yard.  You can count ten drydocks, two full of water, one with a", "near completed ship, and all but two of the remainder having ships in some", "state of construction.  The yard stretches further to the west but you cannot", "see how you can get there."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:10", "exits": [{"direction": "n", "room": "MidgardShipyard:11"}, {"direction": "e", "room": "MidgardShipyard:8"}]}, "11": {"index": "11", "name": "Lumber Yard", "desc": ["\"   You are among the many piles of wood.  Some of the wood has been here for", "years, slowly being seasoned.  The pile you are currently standing is under the", "exit of one of the city's drains, a steady stream of foul smelling water flows", "out, splashing all over the room, making the entire place very slippy.  There", "are several small creatures living here, plenty of small lizards and frogs at", "least."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:11", "exits": [{"direction": "s", "room": "MidgardShipyard:10"}]}, "12": {"index": "12", "name": "Slipway No. 2", "desc": ["\"   You are at the bottom of the dry dock.  There are several large crabs and", "other sea creatures scrambling among the bits and pieces left over by the", "exiting of the ship.  Here and there you can seem some nails, lumps of wood and", "other items that must have been dropped when the last ship was being built.  You", "are at the gate now, it is currently closed but the pumps are not operating.", "The gate is totally encrusted with seashells and barnacles."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:12", "exits": [{"direction": "n", "room": "MidgardShipyard:13"}, {"direction": "10", "room": "MidgardShipyard:14", "keywords": "yard"}]}, "13": {"index": "13", "name": "Slipway No. 2", "desc": ["\"   You are at the bottom of the dry dock, the water level must be at least", "thirty foot deep.  There are several large crabs and other sea creatures", "scrambling among the bits and pieces left over by the exiting of the ship.  Here", "and there you can seem some nails, lumps of wood and other items that must have", "been dropped when the last ship was under construction."], "sector": "Shallow Water", "flags": "dark, mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:13", "exits": [{"direction": "s", "room": "MidgardShipyard:12"}]}, "14": {"index": "14", "name": "Upon the Sea Wall", "desc": ["\"   You are at the edge of the yard, upon a small sea wall between two sea locks.", "One of the drydocks looks recently vacated, half-filled with water, whereas in", "the other you can see a large ship under construction.  Looking over the side of", "the wall you can see the waves lapping gently against the edge of the wall.", "Pacing the wall, you ascertain that the wall at the top is at least five yards", "across, and greater than that at sea level as the wall narrows towards the top.", "There are some markings on the outside of the wall, indicating the depth, the", "water is level is currently at fifteen fathoms, sufficient for the largest of", "ships.  A few feet away, separated by water, a small pedestrian bridge connects", "the wharf to the western side of the harbour."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:14", "exits": [{"direction": "n", "room": "MidgardShipyard:7"}, {"direction": "e", "room": "MidgardShipyard:15"}, {"direction": "10", "room": "MidgardShipyard:12", "keywords": "slipway"}]}, "15": {"index": "15", "name": "Upon a Sea Lock", "desc": ["\"   You are standing upon a sea lock.  The gates huge pulleys tower over you,", "their cables thicker than you arm.  It is the purpose of this gate to keep the", "water out of the drydock while the ship is been worked upon.  Peering over the", "seaward side of the gate you can see the water level only a few feet down, but", "in the drydock side, the floor level is at least thirty feet down, and still", "parts of the ship towers over the sides.  You can see that the gate isn't", "perfect as the drydock is not very dry, put you can see that the pumps have the", "situation well in control. Just a few feet away from the dock gates themselves,", "a temporary bridge has been built to allow for pedestrians to cross from", "the west wall to the wharf."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:15", "exits": [{"direction": "n", "room": "MidgardShipyard:6"}, {"direction": "e", "room": "MidgardShipyard:16"}, {"direction": "w", "room": "MidgardShipyard:14"}]}, "16": {"index": "16", "name": "Upon the Sea Wall", "desc": ["\"   You are at the edge of the yard, upon a small sea wall.  The canteen building", "is to one side and the sea lock for the drydock is to the other.  Looking over", "the side of the wall you can see the waves lapping gently against the edge of", "the wall.  Pacing the wall, you ascertain that the wall at the top is at least", "five yards across, and greater than that at sea level as the wall narrows", "towards the top.  There are some markings on the outside of the wall, indicating", "the depth, the water level is currently at fifteen fathoms, sufficient for", "the largest of ships."], "sector": "Road", "flags": "mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:16", "exits": [{"direction": "n", "room": "MidgardShipyard:3"}, {"direction": "w", "room": "MidgardShipyard:15"}]}, "17": {"index": "17", "name": "Site Canteen", "desc": ["\"   You are in the canteen, the shutters have been pulled down over the serving", "hatch, obviously nothing is available.  It is quite a large canteen, capable of", "seating over a hundred men.  Everything is clean and smelling slightly of", "disinfectant.  All the tables are at the end of the room, this section has been", "left clear for serving purposes."], "flags": "indoors, mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:17", "exits": [{"direction": "s", "room": "MidgardShipyard:18"}, {"direction": "10", "room": "MidgardShipyard:3", "keywords": "yard"}]}, "18": {"index": "18", "name": "Site Canteen", "desc": ["\"   You are amongst the tables in the canteen. Everything is clean and smelling", "slightly of disinfectant.  You were once told that every work canteen looks", "exactly the same, and it is true, the same near-indestructible chairs and", "tables, the absolute lack of taste in decoration, if any decoration.  The only", "thing that differentiates canteens is the graffiti often written on the tables."], "extra": {"keywords": "graffitti tables grafitti graffiti table", "desc": ["\"   Ten Steps to Building a Quality Assured Ship.", "1.   Make sure someone wants to buy the ship.", "2.   Find the cheapest wood and charge for the most expensive.", "3.   Place green lumber in bending arms, and hope you don't get killed.", "4.   Use bent lumber to produce backbone, and break your own back.", "5.   Layer seasoned oak upon backbone,", "6.   Put the floors in, or else what use is it?", "7.   Launch Ship, and hope it doesn't sink.", "8.   Outfit ship, as per customer requirements, and your price tag.", "9.   Deliver ship to customer, with an escort to protect from pirates.", "10.   Collect payment UPON delivery, with escort to ensure payment."]}, "flags": "indoors, mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:18", "exits": [{"direction": "n", "room": "MidgardShipyard:17"}]}, "19": {"index": "19", "name": "Site Office", "desc": ["\"   You are in the shipyard's main office.  The desk is currently unoccupied,", "but you can see from the numerous papers on the desk that the yard is extremely", "busy.  There is a chart on the wall identifying the main steps in constructing", "a ship.  The office is very draughty and the scent of the sea permeates through", "the walls.  There is another exit at the back of the room, a door with a large", "sheet of frosted glass.  There seem to be some figures moving in the backroom", "but the door is firmly locked."], "extra": [{"keywords": "chart wall"}, {"desc": ["\"   Ten Steps to Building a Quality Assured Ship.", "1.   Confirm order TWICE with buyer.", "2.   Identify suitable lumber for type of ship.", "3.   Place green lumber in bending arms.", "4.   Lay keel in drydock.", "5.   Use bent lumber to produce backbone.", "6.   Layer seasoned oak upon backbone, the bottom of each", "plank inside the top of the plank below.", "7.   Install the inner decks.", "8.   Launch Ship.", "9.   Outfit ship, as per customer requirements.", "10.   Collect payment UPON delivery.", "\"\t"]}, {"keywords": "_ex11"}, {"desc": ["\"   You enter a smokey room, you see two men crouched over a table, they see", "you and immediately yell at you to leave.  One of them reaches for his sword", "to make you leave, you turn and leave before it gets message, the door slams", "shut after you!"]}], "flags": "indoors, mapable", "zone": "MidgardShipyard", "room_key": "MidgardShipyard:19", "exits": [{"direction": "10", "room": "MidgardShipyard:2", "keywords": "yard"}, {"direction": "11", "room": "MidgardShipyard:19", "info": "door, closed, message, autoclose", "keywords": "door"}]}}}