{"zone": "Redferne", "rooms": {"0": {"index": "0", "name": "Outside Redferne's residence", "desc": ["A huge cloud forms the plateau on which you are now standing. The wind here", "is absolutely quiet and the sun is shining warmly upon you. From under the", "cloud you can hear the faint sounds of Midgaard. Right before you to the", "north lies the grand Mansion of Naris, the residence of the Greater God", "Redferne."], "zone": "Redferne", "room_key": "Redferne:0", "exits": [{"direction": "n", "room": "Redferne:1", "key": "7901", "info": "door, closed, locked", "keywords": "gate door huge arched"}, {"direction": "d", "room": "Redferne:18"}, {"direction": "10", "room": "Abyss:100", "info": "hidden", "keywords": "portal"}]}, "1": {"index": "1", "name": "The Southern end of the hall", "desc": ["\"   You are standing in a vast hall that is dimly lit, but where from the", "light comes, is a mystery. The walls seem to radiate warmth and give", "the pleasent feeling of being welcome here. A large portrait is hanging", "on one of the walls. A large wooden staircase leads up into the tower.", "To the east there is a high passage away from the hall. This ends", "shortly after by a tall oak door. The enormous hall extends further", "north from here. To the south you can see a huge, and VERY heavy-", "looking iron-wrought door. It looks like this is the only exit from", "this magnificent old house. To the west you can see a large ashen door."], "extra": [{"keywords": "letters"}, {"desc": "They read \"LIBRARY\"."}, {"keywords": "runes"}, {"desc": ["These runes are utterly strange to you, but you are in luck today: Under", "the runes you can just make out a sentence in Common. It goes : \" Stay out,", "if you treasure your life. That is if you are mortal.\"."]}], "flags": "no_mob, indoors, private", "zone": "Redferne", "room_key": "Redferne:1", "exits": [{"direction": "n", "room": "Redferne:4", "desc": ["The hallway continues that way. You can see more doorways under the", "wooden staircase in that direction."]}, {"direction": "e", "room": "Redferne:10", "desc": ["You see there a tall oak door. It looks quite tightly closed to you.", "On it little runes are chiselled into the wood."], "info": "door, closed", "keywords": "oak tall east oakdoor talldoor eastdoor"}, {"direction": "s", "room": "Midgard:574"}, {"direction": "w", "room": "Redferne:2", "desc": ["This looks like a \"door\" in the meaning of the word. The ashen wood", "is painted in a peculiar yellow colour. Small letters are written", "with black on it."], "info": "door, closed", "keywords": "ashen ash door west yellow"}, {"direction": "u", "room": "Redferne:9", "desc": ["You see the staircase extending upwards into the very high tower.", "It ends in what seems like a large bedroom up there."]}]}, "2": {"index": "2", "name": "Redferne's Library", "desc": ["This is truly a magnificent place! Books and scrolls lie together on every", "shelf. A large globe, with the map of the Mud-world upon it, stands in the", "dimly lit north-western corner of the room. Two large and comfortable-", "looking leather arm-chairs adourn the center of the library together with", "a huge oak desk. Dim light radiates from an enormous crystal chandelier", "hanging down from the ceiling approximately 10 feet off the floor. To the", "east there is a great old ashen door. A large glass window is set in the", "west wall."], "extra": [{"keywords": "river"}, {"desc": ["You see a large and winding river cut through the landscape, starting at a", "huge mountain chain, it seeps through Midgaard and finally ends up in the", "Grand Sea on the West-coast of the land."]}, {"keywords": "globe world map"}, {"desc": ["You see a large world map stretch out on the enormous globe. It has towns", "drawn in every spot available for such. In the middle of the map you can", "spot a large town with the name 'MIDGAARD' written over it. The rest is", "mountains, woods, plains and water."]}], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:2", "exits": [{"direction": "e", "room": "Redferne:1"}]}, "3": {"index": "3", "name": "The Artifact room of Naris", "desc": ["This is gloomy and dark room with only a faint light radiating from the", "walls. A bunch of funny-looking items fill the center of the room. There are", "no furniture here what-so-ever. The only way out seems to be west, through", "the low steel door."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:3", "exits": [{"direction": "w", "room": "Redferne:10"}]}, "4": {"index": "4", "name": "The Northern end of the hall", "desc": ["You are standing in the northern end of the huge hall. This part is under", "the grand wooden staircase so the light seems a little less bright here,", "but this doesn't bother your sight at all. To the north lies the kitchen.", "To the south lies the Southern end of the hall. To the east there is a huge", "metal door. To the west there is a large aspenwood door."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:4", "exits": [{"direction": "n", "room": "Redferne:6"}, {"direction": "e", "room": "Redferne:13", "desc": ["You see a huge metal door. From it a foul stench emanates. The smell is the", "most awful experience in your entire life. A thought seeps through this", "terrible stench and into your mind : \"Monsters\", you feel BAD about opening", "that door."], "info": "door, closed", "keywords": "steel metal huge"}, {"direction": "s", "room": "Redferne:1", "desc": "The rest of the hall lies in that direction, and so does the exit."}, {"direction": "w", "room": "Redferne:5", "desc": ["The door has \"SITTING ROOM\" written on it. It is made from Aspenwood and", "is beautifully carven with small elves as main issue of sculpture."], "info": "door, closed", "keywords": "aspen asp"}]}, "5": {"index": "5", "name": "The Sitting room of Naris", "desc": ["You are standing in the middle of a really comfortable place. The walls are", "decorated with paintings of smiling Kings and Queens. The most attractive", "picture is one of a Prince in shiny armour. By one of the walls there is an", "old arm-chair. The only exit is through the aspenwood door to the east."], "extra": {"keywords": "chair arm-chair", "desc": "This is truly a wonderful relic of the past. In it is a large cushion."}, "flags": "no_mob, indoors, private", "zone": "Redferne", "room_key": "Redferne:5", "exits": [{"direction": "e", "room": "Redferne:4", "desc": ["The door seems to be a very HEAVY door, carved completely from the trunk of", "an Aspen tree."], "info": "door, closed", "keywords": "asp aspen door heavy"}, {"direction": "10", "room": "Abyss:100", "keywords": "portal"}]}, "6": {"index": "6", "name": "The Kitchen of Naris", "desc": ["This must be the place of food and drink. You can hear the faint noise of", "rats feasting on meat and bread from somewhere undeterminable. The sound", "makes you feel the agony of HUNGER. The only visible exit is south to the", "Northern end of the hall."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:6", "exits": [{"direction": "n", "room": "Redferne:7", "desc": ["It's dark in there. But the sounds from there are unmistakable. The rats are", "here to your information."], "info": "door, closed", "keywords": "larder wooden cupboard"}, {"direction": "e", "room": "Redferne:8", "desc": "You can see the fridge from here. In it are drinks all over.", "info": "door, closed", "keywords": "fridge"}, {"direction": "s", "room": "Redferne:4", "desc": "ou can see the northern end of the hall."}]}, "7": {"index": "7", "name": "The Larder", "desc": ["You can see food all over. Among the heaps of food you notice HUGE rats", "scuttering around, nibling pieces off the heaps here and there."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:7", "exits": [{"direction": "s", "room": "Redferne:6"}]}, "8": {"index": "8", "name": "The Fridge", "desc": "This place is LOADED with drink, water and booze.", "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:8", "exits": [{"direction": "w", "room": "Redferne:6"}]}, "9": {"index": "9", "name": "On the stairs", "desc": ["You can see up and down the stairway. It seems to take forever, either going", "up OR down. It's just a seemingly insurmountable climb, either way. Up is the", "bedroom of Redferne, and Down leads to the Southern end of the hall."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:9", "exits": [{"direction": "u", "room": "Redferne:11"}, {"direction": "d", "room": "Redferne:1"}]}, "10": {"index": "10", "name": "The Treasure room", "desc": ["This place is gloomy. A HUGE safe is cemented into the west wall. The only", "visible exit is west, through the oak door."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:10", "exits": [{"direction": "e", "room": "Redferne:3", "key": "7900", "info": "door, closed, locked", "keywords": "safe steel"}, {"direction": "w", "room": "Redferne:1", "desc": "You see a tall oak door.", "info": "door, closed", "keywords": "door oak tall"}]}, "11": {"index": "11", "name": "Redferne's Bedroom", "desc": ["This is a snugly set bedroom with all the necessities for a romantic evening.", "A large fireplace adourns the east wall, and sizzling away is the wood that", "is ablaze within. The bed is enormous, covering at least HALF of this great", "room. This stretches at least 140 square feet, so can you imagine the BED?", "A large staircase leads down to the hall. A couple of doors open up to a", "broad balcony to the south."], "flags": "no_mob, indoors", "zone": "Redferne", "room_key": "Redferne:11", "exits": [{"direction": "s", "room": "Redferne:12", "desc": "The suns seems to shine out there, warmly and comforting.", "info": "door, closed", "keywords": "doors"}, {"direction": "d", "room": "Redferne:9"}]}, "12": {"index": "12", "name": "The Balcony of Redferne's Residence", "desc": ["You see a splendid of the most of this world. The valleys stretch as far as", "the eye reaches to the south from here. Down below you can see the entrance", "of this magnificent building. To the north are the doors to Redferne's Bedroom."], "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:12", "exits": [{"direction": "n", "room": "Redferne:11"}]}, "13": {"index": "13", "name": "The Monster Pen", "desc": ["This looks like the cage in which a large carnivor is being kept. Judging by", "the state the walls are in, this could very well be a large AGGRESSIVE animal.", "This makes you pretty insecure, this stating your feeling about the place,", "quite mildly."], "flags": "indoors", "zone": "Redferne", "room_key": "Redferne:13", "exits": [{"direction": "w", "room": "Redferne:4"}]}, "14": {"index": "14", "name": "On the Huge Chain", "desc": ["This place has quite a good view over Midgaard. Your possibilities of movement", "seems to extend only to up and down. Unless you want to let go of the secure", "and seemingly unmoveable chain, then those are the directions you should take", "from here."], "sector": "Mountains", "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:14", "exits": [{"direction": "u", "room": "Redferne:15", "desc": "Up the way you see the chain dissappearing into the clouds above."}, {"direction": "d", "room": "MoriaLevel1:75", "desc": "Down below you see the huge chain anchored to the ground in the Road Crossing."}]}, "15": {"index": "15", "name": "The Chain where it's too windy", "desc": ["Hanging on to the chain you figure out that there's no way of leaving down", "from here. The wind pulls you from left to right and back. This seems like a", "totally impossible task. The ascend is the only way ahead for you.", "Otherwise you would risk death by falling to the hard ground below. DO NOT", "DESCEND NOW OR YOU'LL SURELY DIE!!!!"], "sector": "Mountains", "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:15", "exits": [{"direction": "u", "room": "Redferne:16", "desc": "That way seems to be the only way away from here."}, {"direction": "d", "room": "Redferne:20", "desc": ["THAT WAY IS CERTAIN DEATH!!!! You can see the wind tearing at the chain down", "below you. It swings like a furious serpent from side to side! The descend is", "ABSOLUTELY out of the QUESTION."]}]}, "16": {"index": "16", "name": "On the Great Chain of Naris", "desc": ["You are approximately on the middle of the treacherous Chain. One false step", "and death will come and collect you quickly. The chain leads upwards and down.", "No way are you going to descend now... You've only just begun your climb.", "Besides it could cost you your life. Look down and you'll see why."], "sector": "Mountains", "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:16", "exits": [{"direction": "u", "room": "Redferne:18", "desc": "There seems to be only one way from here and that's up."}, {"direction": "d", "room": "Redferne:15", "desc": ["The chain down there is swinging wildly back and forth. Going down there will", "be pretty risky!"]}]}, "17": {"index": "17", "name": "The Chain", "desc": ["As you descend, the chain seems to absorbe all weather around it, making it", "swing less and less in the very powerful wind tearing at it. The Chain seems", "to chuckle quietly, and as you descend further you hear a soft whisper", "originating from within the Chain *ITSELF*.", "It says, \" Welcome back some other time, stranger. Your company is always", "... hmmm ... interesting. God Speed. \"", "The chain extends further down through the now spreading clouds."], "sector": "Mountains", "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:17", "exits": [{"direction": "u", "room": "Redferne:18", "desc": ["It seems to you that the Chain is dissolving again. Maybe it's just an", "illusion, but still ...!"]}, {"direction": "d", "room": "Redferne:14", "desc": "That way seems safe enough ... now."}]}, "18": {"index": "18", "name": "The Mighty Chain of Naris", "desc": ["This place truly a splendid view of the WHOLE COUNTRY SIDE!!! A magnificent", "light shines upon you and the way up through the clouds is opened. Up there", "you can now see the Mansion of Naris, Residence of the Greater God Redferne.", "The chain beneath you seems to evaporate in the mustering clouds that", "surround you by now."], "sector": "Mountains", "flags": "no_mob", "zone": "Redferne", "room_key": "Redferne:18", "exits": [{"direction": "u", "room": "Redferne:0", "desc": ["You see the sunny top of the clouds. Beyond these, the Mansion towers before", "your eyes. Beautiful!!"]}, {"direction": "d", "room": "Redferne:17", "desc": ["You see nothing but the thick clouds. They've closed completely around the", "Chain."]}]}, "20": {"index": "20", "name": "Free fall from the Chain", "desc": ["This is probably the third worst place to be in this entire MUD right now.", "You fall", ".", ".", ".", "and fall", ".", ".", ".", "and fall", ".", ".", ".", "and HIT THE GROUND WITH SUCH A *SPLUTCH* that you die horribly, but instantly.", "Bye Cruel World. You lose all your things immediately, Sorry!!"], "flags": "death", "zone": "Redferne", "room_key": "Redferne:20", "exits": [{"direction": "n", "room": "Redferne:14"}, {"direction": "e", "room": "Redferne:15"}, {"direction": "s", "room": "Redferne:16"}, {"direction": "w", "room": "Redferne:17"}, {"direction": "u", "room": "Redferne:18"}, {"direction": "d", "room": "Midgard:120"}]}}}